[
  {
    "Rarity": "Uncommon",
    "Artist": "Anna Steinbauer",
    "Toughness": "1",
    "cmc": 2,
    "MultiverseID": 435152,
    "SetCode": "XLN",
    "Name": "Adanto Vanguard",
    "Power": "1",
    "Colors": [ "White" ],
    "Manacost": "{{1}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "1",
    "Type": "Creature — Vampire Soldier",
    "SubTypes": [ "Vampire", "Soldier" ],
    "Text": "As long as Adanto Vanguard is attacking, it gets +2/+0.<br/>\nPay 4 life: Adanto Vanguard gains indestructible until end of turn. (Damage and effects that say \"destroy\" don't destroy it.)"
  },
  {
    "Names": [ "Legion's Landing", "Adanto, the First Fort" ],
    "SuperTypes": [ "Legendary" ],
    "Artist": "Svetlin Velinov",
    "cmc": 1,
    "MultiverseID": 435174,
    "SetCode": "XLN",
    "Name": "Adanto, the First Fort",
    "CardNumber": "22b",
    "Types": [ "Land" ],
    "Type": "Legendary Land",
    "Rarity": "Rare",
    "Text": "(Transforms from Legion's Landing.)<br/>\n{{Tap}}: Add {{W}} to your mana pool.<br/>\n{{2}}{{W}}, {{Tap}}: Create a 1/1 white Vampire creature token with lifelink."
  },
  {
    "cmc": 4,
    "MultiverseID": 435373,
    "Colors": [ "Blue", "Black", "Red" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Admiral Beckett Brass's triggered ability checks what happened earlier in the turn. It doesn't care whether Admiral Beckett Brass was on the battlefield when those Pirates dealt combat damage, whether those creatures are still on the battlefield, or whether they're still Pirates."
      },
      {
        "Date": "2017-09-29",
        "Text": "If one Pirate deals combat damage multiple times, most likely because it has double strike, it counts as only one of the three Pirates for Admiral Beckett Brass's triggered ability."
      },
      {
        "Date": "2017-09-29",
        "Text": "If more than one player was dealt combat damage by three Pirates, you target only one permanent. It may be controlled by either of those players."
      },
      {
        "Date": "2017-09-29",
        "Text": "The control-change effect of Admiral Beckett Brass's triggered ability lasts indefinitely. It doesn't wear off during the cleanup step or when you lose control of Admiral Beckett Brass."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well, and any effects that give the player control of permanents immediately end."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a Two-Headed Giant game, an unblocked attacking creature deals its combat damage to one of the two players it's attacking. The attacking team chooses which player that is for each creature as combat damage is assigned. Combat damage dealt by Pirates your teammate controls will count when checking for Admiral Beckett Brass's ability."
      }
    ],
    "Text": "Other Pirates you control get +1/+1.<br/>\nAt the beginning of your end step, gain control of target nonland permanent controlled by a player who was dealt combat damage by three or more Pirates this turn.",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Jason Rainville",
    "Flavor": "\"You and your ship will make a fine addition to my fleet.\"",
    "SetCode": "XLN",
    "Name": "Admiral Beckett Brass",
    "Toughness": "3",
    "Manacost": "{{1}}{{U}}{{B}}{{R}}",
    "Types": [ "Creature" ],
    "Power": "3",
    "Type": "Legendary Creature — Human Pirate",
    "CardNumber": "217",
    "Rarity": "Mythic Rare"
  },
  {
    "Toughness": "4",
    "Rarity": "Uncommon",
    "Artist": "Kev Walker",
    "Flavor": "\"The East Wind, an interloper in the dominions of Westerly Weather, is an impassive-faced tyrant with a sharp poniard held behind his back for a treacherous stab.\"<br/>\n—Joseph Conrad, The Mirror of the Sea",
    "cmc": 5,
    "MultiverseID": 129459,
    "SetCode": "XLN",
    "Name": "Air Elemental",
    "Power": "4",
    "Colors": [ "Blue" ],
    "Manacost": "{{3}}{{U}}{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "64",
    "Type": "Creature — Elemental",
    "SubTypes": [ "Elemental" ],
    "Text": "Flying"
  },
  {
    "Rarity": "Common",
    "Artist": "Jakub Kasper",
    "Flavor": "It is taller than all but the tallest trees, and older than all but the oldest.",
    "cmc": 8,
    "MultiverseID": 435330,
    "SetCode": "XLN",
    "Name": "Ancient Brontodon",
    "Toughness": "9",
    "Colors": [ "Green" ],
    "Manacost": "{{6}}{{G}}{{G}}",
    "Types": [ "Creature" ],
    "Power": "9",
    "Type": "Creature — Dinosaur",
    "CardNumber": "175",
    "SubTypes": [ "Dinosaur" ]
  },
  {
    "cmc": 7,
    "MultiverseID": 435286,
    "Colors": [ "Red" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If a creature with trample you control would deal combat damage to a blocking creature while you control Angrath's Marauders, you must assign its unmodified damage. For example, a 3/3 creature with trample blocked by a 2/2 creature can have at most 1 damage assigned to the defending player. It will then deal 4 damage to the blocking creature and 2 damage to the defending player."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect such as that of Chandra's Pyrohelix asks you to divide damage among targets, you must divide the unmodified damage before doubling it."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you control a second Angrath's Marauders, damage dealt by sources you control will be multiplied by 4. If you control a third, it will be multiplied by 8, and so on."
      }
    ],
    "Text": "If a source you control would deal damage to a permanent or player, it deals double that damage to that permanent or player instead.",
    "Rarity": "Rare",
    "Artist": "Victor Adame Minguez",
    "Flavor": "Captain Angrath cares less about treasure than mayhem. If he can't leave Ixalan, he'll burn the plane down.",
    "SetCode": "XLN",
    "Name": "Angrath's Marauders",
    "Manacost": "{{5}}{{R}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "4",
    "Type": "Creature — Human Pirate",
    "Power": "4",
    "CardNumber": "132"
  },
  {
    "Toughness": "3",
    "Rarity": "Common",
    "Artist": "Winona Nelson",
    "Flavor": "Inspiration is red as rubies, flowing like honeyed wine.",
    "cmc": 5,
    "MultiverseID": 435242,
    "SetCode": "XLN",
    "Name": "Anointed Deacon",
    "Power": "3",
    "Colors": [ "Black" ],
    "Manacost": "{{4}}{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "89",
    "Type": "Creature — Vampire Cleric",
    "SubTypes": [ "Vampire", "Cleric" ],
    "Text": "At the beginning of combat on your turn, you may have target Vampire get +2/+0 until end of turn."
  },
  {
    "Rarity": "Rare",
    "Artist": "Mark Behm",
    "cmc": 3,
    "MultiverseID": 435198,
    "SetCode": "XLN",
    "Name": "Arcane Adaptation",
    "Colors": [ "Blue" ],
    "Manacost": "{{2}}{{U}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "46",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Replacement effects that modify creatures of a certain type as they enter the battlefield will apply after you apply Arcane Adaptation's effect. This is a change from previous rules. If you control Arcane Adaptation and the Aether Revolt card Metallic Mimic, with the same creature type chosen for both, then any creature you control will enter the battlefield with an additional +1/+1 counter on it."
      },
      {
        "Date": "2017-09-29",
        "Text": "To choose a creature type, you must choose an existing creature type, such as Vampire or Knight. You can't choose multiple creature types, such as \"Vampire Knight.\" Card types such as artifact can't be chosen, nor can subtypes that aren't creature types, such as Jace, Vehicle, or Treasure."
      }
    ],
    "Text": "As Arcane Adaptation enters the battlefield, choose a creature type.<br/>\nCreatures you control are the chosen type in addition to their other types. The same is true for creature spells you control and creature cards you own that aren't on the battlefield."
  },
  {
    "Names": [ "Arguel's Blood Fast", "Temple of Aclazotz" ],
    "SuperTypes": [ "Legendary" ],
    "Artist": "Daarken",
    "Flavor": "Arguel's vision led him into the jungles of Ixalan . . .",
    "cmc": 2,
    "MultiverseID": 435243,
    "SetCode": "XLN",
    "Name": "Arguel's Blood Fast",
    "Rarity": "Rare",
    "Colors": [ "Black" ],
    "Manacost": "{{1}}{{B}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "90a",
    "Type": "Legendary Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If your life total is 6 or greater as your upkeep begins, the second ability of Arguel's Blood Fast won't trigger. You can't take any actions during your turn before your upkeep begins."
      },
      {
        "Date": "2017-09-29",
        "Text": "If your life total is 6 or greater as the second ability of Arguel's Blood Fast tries to resolve, it won't do anything."
      },
      {
        "Date": "2017-09-29",
        "Text": "For more information on double-faced cards, see the Ixalan mechanics article (http://magic.wizards.com/en/articles/archive/feature/ixalan-mechanics)."
      }
    ],
    "Text": "{{1}}{{B}}, Pay 2 life: Draw a card.<br/>\nAt the beginning of your upkeep, if you have 5 or less life, you may transform Arguel's Blood Fast."
  },
  {
    "Rarity": "Rare",
    "Artist": "Daarken",
    "Flavor": "\"Let no trace of the vampires' foulness remain.\"",
    "cmc": 2,
    "MultiverseID": 435153,
    "SetCode": "XLN",
    "Name": "Ashes of the Abhorrent",
    "Colors": [ "White" ],
    "Manacost": "{{1}}{{W}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "2",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Activated abilities contain a colon. They're generally written \"[Cost]: [Effect].\" Some keyword abilities (such as embalm from the Amonkhet set) are activated abilities and will have colons in their reminder text. Triggered abilities (starting with \"when,\" \"whenever,\" or \"at\") are unaffected by Ashes of the Abhorrent."
      },
      {
        "Date": "2017-09-29",
        "Text": "Ashes of the Abhorrent doesn't stop players from playing land cards from the graveyard if an effect allows them to do so."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a creature dies at the same time that Ashes of the Abhorrent is destroyed, you'll gain 1 life."
      }
    ],
    "Text": "Players can't cast spells from graveyards or activate abilities of cards in graveyards.<br/>\nWhenever a creature dies, you gain 1 life."
  },
  {
    "cmc": 3,
    "MultiverseID": 435331,
    "Colors": [ "Green" ],
    "SubTypes": [ "Human", "Archer" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You must choose another target creature (if able) as Atzocan Archer's triggered ability is put on the stack. You choose as that ability resolves whether those creatures fight."
      },
      {
        "Date": "2017-09-29",
        "Text": "If Atzocan Archer isn't on the battlefield as its triggered ability resolves, or if the target of that ability is illegal, no creature will deal or be dealt damage."
      },
      {
        "Date": "2017-09-29",
        "Text": "Atzocan Archer's ability can target another creature you control (such as a Dinosaur with an enrage ability)."
      }
    ],
    "Text": "Reach<br/>\nWhen Atzocan Archer enters the battlefield, you may have it fight another target creature. (Each deals damage equal to its power to the other.)",
    "Rarity": "Uncommon",
    "Artist": "Naomi Baker",
    "Flavor": "His arrows are fletched with feathers from the greatest of the winged dinosaurs.",
    "SetCode": "XLN",
    "Name": "Atzocan Archer",
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "4",
    "Type": "Creature — Human Archer",
    "Power": "1",
    "CardNumber": "176"
  },
  {
    "Rarity": "Mythic Rare",
    "Artist": "Bastien L. Deharme",
    "Flavor": "The Church of Dusk teaches there is no gain without loss, no triumph without sacrifice, no drink of exquisite crimson without a dying gasp.",
    "cmc": 6,
    "MultiverseID": 435154,
    "SetCode": "XLN",
    "Name": "Axis of Mortality",
    "Colors": [ "White" ],
    "Manacost": "{{4}}{{W}}{{W}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "3",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If one of the targeted players is an illegal target when the triggered ability of Axis of Mortality tries to resolve, the exchange won't happen. Neither player's life total will change."
      },
      {
        "Date": "2017-09-29",
        "Text": "When the life totals are exchanged, each player gains or loses the amount of life necessary to equal the other player's previous life total. For example, if player A has 5 life and player B has 3 life before the exchange, player A will lose 2 life and player B will gain 2 life. Replacement effects may modify these gains and losses, and triggered abilities may trigger on them."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a player can't gain life, that player can't exchange life totals with a player with a higher life total. If a player can't lose life, that player can't exchange life totals with a player with a lower life total. In either of these cases, neither player's life total will change."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a Two-Headed Giant game, each player is considered to have the same life total as his or her team. If the two targeted players are on different teams, those players gain or lose the appropriate amount of life so that the teams end up exchanging life totals. If the two targeted players are teammates, they can't exchange life totals."
      }
    ],
    "Text": "At the beginning of your upkeep, you may have two target players exchange life totals."
  },
  {
    "Names": [ "Search for Azcanta", "Azcanta, the Sunken Ruin" ],
    "SuperTypes": [ "Legendary" ],
    "Artist": "Magali Villeneuve",
    "cmc": 2,
    "MultiverseID": 435227,
    "SetCode": "XLN",
    "Name": "Azcanta, the Sunken Ruin",
    "CardNumber": "74b",
    "Types": [ "Land" ],
    "Type": "Legendary Land",
    "Rarity": "Rare",
    "Text": "(Transforms from Search for Azcanta.)<br/>\n{{Tap}}: Add {{U}} to your mana pool.<br/>\n{{2}}{{U}}, {{Tap}}: Look at the top four cards of your library. You may reveal a noncreature, nonland card from among them and put it into your hand. Put the rest on the bottom of your library in any order."
  },
  {
    "cmc": 7,
    "MultiverseID": 435374,
    "Colors": [ "White", "Green" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Belligerent Brontodon's ability doesn't actually change any creature's power. It changes only the amount of combat damage it assigns. All other rules and effects that check power or toughness use the real values. For example, Hunt the Weak won't cause a creature to fight with its toughness."
      }
    ],
    "Text": "Each creature you control assigns combat damage equal to its toughness rather than its power.",
    "Rarity": "Uncommon",
    "Artist": "Dan Scott",
    "Flavor": "Predators try to separate the young, old, or injured from the rest of the herd. The alternative is crushing defeat.",
    "SetCode": "XLN",
    "Name": "Belligerent Brontodon",
    "Manacost": "{{5}}{{G}}{{W}}",
    "Types": [ "Creature" ],
    "Toughness": "6",
    "Type": "Creature — Dinosaur",
    "Power": "4",
    "CardNumber": "218"
  },
  {
    "cmc": 6,
    "MultiverseID": 435155,
    "Colors": [ "White" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If another creature you control is dealt lethal damage at the same time that Bellowing Aegisaur is dealt damage, the other creature won't be saved by the +1/+1 counter that would have been put on it."
      },
      {
        "Date": "2017-09-29",
        "Text": "If multiple sources deal damage to a creature with an enrage ability at the same time, most likely because multiple creatures blocked that creature, the enrage ability triggers only once."
      },
      {
        "Date": "2017-09-29",
        "Text": "If lethal damage is dealt to a creature with an enrage ability, that ability triggers. The creature with that enrage ability leaves the battlefield before that ability resolves, so it won't be affected by the resolving ability."
      }
    ],
    "Text": "Enrage — Whenever Bellowing Aegisaur is dealt damage, put a +1/+1 counter on each other creature you control.",
    "Rarity": "Uncommon",
    "Artist": "Craig J Spearing",
    "Flavor": "Its roaring challenge is punctuated by the slam of its tail on the earth, rousing the herds of the plains.",
    "SetCode": "XLN",
    "Name": "Bellowing Aegisaur",
    "Manacost": "{{5}}{{W}}",
    "Types": [ "Creature" ],
    "Toughness": "5",
    "Type": "Creature — Dinosaur",
    "Power": "3",
    "CardNumber": "4"
  },
  {
    "cmc": 5,
    "MultiverseID": 435156,
    "Colors": [ "White" ],
    "SubTypes": [ "Vampire", "Cleric" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the mana cost of a card in your graveyard includes X, X is considered to be 0."
      },
      {
        "Date": "2017-09-29",
        "Text": "All attackers are chosen at once. You can't attack with Bishop of Rebirth, return a creature card to the battlefield, and then attack with that creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the creature returned to the battlefield has any abilities that trigger when creatures attack, those abilities won't trigger."
      }
    ],
    "Text": "Vigilance<br/>\nWhenever Bishop of Rebirth attacks, you may return target creature card with converted mana cost 3 or less from your graveyard to the battlefield.",
    "Rarity": "Rare",
    "Artist": "Tommy Arnold",
    "Flavor": "\"In the death of the foe lies the resurrection of the faithful.\"",
    "SetCode": "XLN",
    "Name": "Bishop of Rebirth",
    "Manacost": "{{3}}{{W}}{{W}}",
    "Types": [ "Creature" ],
    "Toughness": "4",
    "Type": "Creature — Vampire Cleric",
    "Power": "3",
    "CardNumber": "5"
  },
  {
    "cmc": 5,
    "MultiverseID": 435245,
    "Colors": [ "Black" ],
    "SubTypes": [ "Vampire", "Cleric" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The number of Vampires you control is counted only as Bishop of the Bloodstained's ability resolves. If Bishop of the Bloodstained is still on the battlefield, it'll count itself."
      }
    ],
    "Text": "When Bishop of the Bloodstained enters the battlefield, target opponent loses 1 life for each Vampire you control.",
    "Rarity": "Uncommon",
    "Artist": "Yongjae Choi",
    "Flavor": "\"They shall give us all they have as penance for their resistance. Their ships. Their goods. Their rebellious blood.\"",
    "SetCode": "XLN",
    "Name": "Bishop of the Bloodstained",
    "Manacost": "{{3}}{{B}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Vampire Cleric",
    "Power": "3",
    "CardNumber": "91"
  },
  {
    "Toughness": "2",
    "Rarity": "Common",
    "Artist": "Scott Murphy",
    "Flavor": "Vampires, the noble class of old Torrezon, are guided by their dual loyalties to church and crown.",
    "cmc": 2,
    "MultiverseID": 435157,
    "SetCode": "XLN",
    "Name": "Bishop's Soldier",
    "Power": "2",
    "Colors": [ "White" ],
    "Manacost": "{{1}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "6",
    "Type": "Creature — Vampire Soldier",
    "SubTypes": [ "Vampire", "Soldier" ],
    "Text": "Lifelink"
  },
  {
    "Toughness": "1",
    "Rarity": "Common",
    "Artist": "Ben Wootten",
    "Flavor": "It withers fruit and flesh alike.",
    "cmc": 1,
    "MultiverseID": 435246,
    "SetCode": "XLN",
    "Name": "Blight Keeper",
    "Power": "1",
    "Colors": [ "Black" ],
    "Manacost": "{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "92",
    "Type": "Creature — Bat Imp",
    "SubTypes": [ "Bat", "Imp" ],
    "Text": "Flying<br/>\n{{7}}{{B}}, {{Tap}}, Sacrifice Blight Keeper: Target opponent loses 4 life and you gain 4 life."
  },
  {
    "Rarity": "Common",
    "Artist": "Igor Kieryluk",
    "Flavor": "\"I see you, shiny soldiers, but you won't see me.\"",
    "cmc": 3,
    "MultiverseID": 435332,
    "SetCode": "XLN",
    "Name": "Blinding Fog",
    "Colors": [ "Green" ],
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Instant" ],
    "CardNumber": "177",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Blinding Fog prevents all damage that would be dealt to creatures, not just combat damage."
      },
      {
        "Date": "2017-09-29",
        "Text": "Damage that would be dealt to creatures that enter the battlefield later in the turn will also be prevented. However, creatures that come under your control later in the turn won't gain hexproof."
      }
    ],
    "Text": "Prevent all damage that would be dealt to creatures this turn. Creatures you control gain hexproof until end of turn. (They can't be the targets of spells or abilities your opponents control.)"
  },
  {
    "cmc": 2,
    "MultiverseID": 435247,
    "Colors": [ "Black" ],
    "SubTypes": [ "Vampire", "Knight" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Bloodcrazed Paladin's last ability counts all creatures that were put into any graveyard from the battlefield this turn, including token creatures and noncreature cards that were creatures as they left the battlefield. It doesn't check whether any of them are still in graveyards."
      },
      {
        "Date": "2017-09-29",
        "Text": "Bloodcrazed Paladin's last ability won't count creatures that were put directly into a zone other than the graveyard, perhaps because of a replacement effect (for example, a creature that was exiled instead or a commander that moved to the command zone in the Commander variant)."
      }
    ],
    "Text": "Flash<br/>\nBloodcrazed Paladin enters the battlefield with a +1/+1 counter on it for each creature that died this turn.",
    "Rarity": "Rare",
    "Artist": "Daarken",
    "Flavor": "When a paladin undertaking the Blood Fast finally gives in to hunger, the violence is sudden, explosive, and complete.",
    "SetCode": "XLN",
    "Name": "Bloodcrazed Paladin",
    "Manacost": "{{1}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Vampire Knight",
    "Power": "1",
    "CardNumber": "93"
  },
  {
    "Toughness": "2",
    "Rarity": "Common",
    "Artist": "Shreya Shetty",
    "Flavor": "The only force on Ixalan not interested in finding the golden city is Ixalan itself.",
    "cmc": 3,
    "MultiverseID": 435333,
    "SetCode": "XLN",
    "Name": "Blossom Dryad",
    "Power": "2",
    "Colors": [ "Green" ],
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "178",
    "Type": "Creature — Dryad",
    "SubTypes": [ "Dryad" ],
    "Text": "{{Tap}}: Untap target land."
  },
  {
    "cmc": 4,
    "MultiverseID": 435287,
    "Colors": [ "Red" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If you control more than one Bonded Horncrest, they can attack or block together, even if no other creatures attack or block."
      },
      {
        "Date": "2017-09-29",
        "Text": "Although Bonded Horncrest can't attack alone, other attacking creatures don't have to attack the same player or planeswalker. For example, Bonded Horncrest could attack an opponent and another creature could attack a planeswalker that opponent controls. Similarly, other blocking creatures don't have to block the same creature that Bonded Horncrest blocks."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once Bonded Horncrest has attacked or blocked, it will remain in combat even if you no longer control another attacking or blocking creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect says that Bonded Horncrest attacks or blocks if able and you control another creature able to attack or block, you must attack or block with Bonded Horncrest and that creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a Two-Headed Giant game, Bonded Horncrest can attack or block with a creature controlled by your teammate, even if no other creatures you control are attacking or blocking."
      }
    ],
    "Text": "Bonded Horncrest can't attack or block alone.",
    "Rarity": "Uncommon",
    "Artist": "Jesper Ejsing",
    "Flavor": "\"You don't tame a horncrest. You convince it that it's easier to destroy something else.\"<br/>\n—Amautl, knight of Atzocan",
    "SetCode": "XLN",
    "Name": "Bonded Horncrest",
    "Manacost": "{{3}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "5",
    "Type": "Creature — Dinosaur",
    "Power": "5",
    "CardNumber": "133"
  },
  {
    "Rarity": "Mythic Rare",
    "Artist": "James Ryman",
    "cmc": 7,
    "MultiverseID": 435248,
    "SetCode": "XLN",
    "Name": "Boneyard Parley",
    "Colors": [ "Black" ],
    "Manacost": "{{5}}{{B}}{{B}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "94",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The creature cards may come from different graveyards."
      },
      {
        "Date": "2017-09-29",
        "Text": "You (not your opponent) choose which pile to put onto the battlefield and which to return to graveyards."
      },
      {
        "Date": "2017-09-29",
        "Text": "A pile can have no cards in it. In this case, you'll choose whether to put all the exiled cards onto the battlefield or into graveyards."
      },
      {
        "Date": "2017-09-29",
        "Text": "In multiplayer games, you choose an opponent to separate the cards when the ability resolves. This doesn't target that opponent. Because the cards are revealed, all players may see the cards and offer opinions."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, any creatures you control from Boneyard Parley's effect are exiled."
      }
    ],
    "Text": "Exile up to five target creature cards from graveyards. An opponent separates those cards into two piles. Put all cards from the pile of your choice onto the battlefield under your control and the rest into their owners' graveyards."
  },
  {
    "SubTypes": [ "Human", "Pirate" ],
    "Rarity": "Common",
    "Artist": "Joseph Meehan",
    "Toughness": "2",
    "cmc": 4,
    "MultiverseID": 435288,
    "SetCode": "XLN",
    "Name": "Brazen Buccaneers",
    "Power": "2",
    "Colors": [ "Red" ],
    "Manacost": "{{3}}{{R}}",
    "Types": [ "Creature" ],
    "CardNumber": "134",
    "Type": "Creature — Human Pirate",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "Haste<br/>\nWhen Brazen Buccaneers enters the battlefield, it explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Ryan Alexander Lee",
    "Flavor": "Vampires know blood and the systems that carry it. And they know exactly where to strike to set it free.",
    "cmc": 5,
    "MultiverseID": 435158,
    "SetCode": "XLN",
    "Name": "Bright Reprisal",
    "Colors": [ "White" ],
    "Manacost": "{{4}}{{W}}",
    "Types": [ "Instant" ],
    "CardNumber": "7",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the target creature is an illegal target by the time Bright Reprisal resolves, the entire spell is countered. You won't draw a card. If, on the other hand, the target is a legal target but isn't destroyed (most likely because it has indestructible), you'll draw a card."
      }
    ],
    "Text": "Destroy target attacking creature.<br/>\nDraw a card."
  },
  {
    "cmc": 6,
    "MultiverseID": 435289,
    "Colors": [ "Red" ],
    "SubTypes": [ "Dinosaur", "Avatar" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The ability of Burning Sun's Avatar can target any creature, not just one controlled by the target opponent."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the ability of Burning Sun's Avatar has two targets and one becomes illegal, the other will still be dealt damage."
      }
    ],
    "Text": "When Burning Sun's Avatar enters the battlefield, it deals 3 damage to target opponent and 3 damage to up to one target creature.",
    "Rarity": "Rare",
    "Artist": "Randy Vargas",
    "Flavor": "\"Tilonalli's searing rays carry the spark of life's eventual destruction as all light fades.\"<br/>\n—Chitlati, Lightning Rider",
    "SetCode": "XLN",
    "Name": "Burning Sun's Avatar",
    "Manacost": "{{3}}{{R}}{{R}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "6",
    "Type": "Creature — Dinosaur Avatar",
    "Power": "6",
    "CardNumber": "135"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Yongjae Choi",
    "Flavor": "By the law of church and crown, vampires feed only on the blood of the guilty—those declared heretics, rebels, or enemies of war.",
    "cmc": 4,
    "MultiverseID": 435375,
    "SetCode": "XLN",
    "Name": "Call to the Feast",
    "Colors": [ "White", "Black" ],
    "Manacost": "{{2}}{{W}}{{B}}",
    "Types": [ "Sorcery" ],
    "Type": "Sorcery",
    "CardNumber": "219",
    "Text": "Create three 1/1 white Vampire creature tokens with lifelink."
  },
  {
    "Rarity": "Common",
    "Artist": "Mark Poole",
    "cmc": 3,
    "MultiverseID": 129882,
    "SetCode": "XLN",
    "Name": "Cancel",
    "Colors": [ "Blue" ],
    "Manacost": "{{1}}{{U}}{{U}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "71",
    "Text": "Counter target spell."
  },
  {
    "cmc": 3,
    "MultiverseID": 435290,
    "Colors": [ "Red" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can activate the mana ability of a Treasure even if you have nothing to spend that mana on."
      },
      {
        "Date": "2017-09-29",
        "Text": "Captain Lannery Storm's last ability triggers whenever you sacrifice a Treasure for any reason, not just to activate a Treasure's mana ability."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you sacrifice Treasures to cast Captain Lannery Storm, its last ability won't trigger for those Treasures."
      }
    ],
    "Text": "Haste<br/>\nWhenever Captain Lannery Storm attacks, create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\"<br/>\nWhenever you sacrifice a Treasure, Captain Lannery Storm gets +1/+0 until end of turn.",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Chris Rallis",
    "SetCode": "XLN",
    "Name": "Captain Lannery Storm",
    "Toughness": "2",
    "Manacost": "{{2}}{{R}}",
    "Types": [ "Creature" ],
    "Power": "2",
    "Type": "Legendary Creature — Human Pirate",
    "CardNumber": "136",
    "Rarity": "Rare"
  },
  {
    "cmc": 4,
    "MultiverseID": 435291,
    "Colors": [ "Red" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can target and gain control of an untapped creature this way."
      }
    ],
    "Text": "{{3}}{{R}}: Gain control of target creature an opponent controls until end of turn. Untap that creature. It gains haste until end of turn. Activate this ability only any time you could cast a sorcery.",
    "Rarity": "Rare",
    "Artist": "Winona Nelson",
    "Flavor": "\"We sail. We plunder. Then we dance.\"",
    "SetCode": "XLN",
    "Name": "Captivating Crew",
    "Manacost": "{{3}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Human Pirate",
    "Power": "4",
    "CardNumber": "137"
  },
  {
    "Toughness": "6",
    "Rarity": "Mythic Rare",
    "Artist": "Yeong-Hao Han",
    "Flavor": "Sun Empire commanders are well versed in advanced martial strategy. Still, the correct maneuver is usually to deploy the giant, implacable death lizard.",
    "cmc": 6,
    "MultiverseID": 435334,
    "SetCode": "XLN",
    "Name": "Carnage Tyrant",
    "Power": "7",
    "Colors": [ "Green" ],
    "Manacost": "{{4}}{{G}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "179",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Carnage Tyrant can't be countered.<br/>\nTrample, hexproof"
  },
  {
    "Rarity": "Common",
    "Artist": "Chris Rahn",
    "cmc": 4,
    "MultiverseID": 435442,
    "SetCode": "XLN",
    "Name": "Castaway's Despair",
    "SubTypes": [ "Aura" ],
    "Colors": [ "Blue" ],
    "Manacost": "{{3}}{{U}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "281",
    "Type": "Enchantment — Aura",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Castaway's Despair can target a creature that's already tapped."
      }
    ],
    "Text": "Enchant creature<br/>\nWhen Castaway's Despair enters the battlefield, tap enchanted creature.<br/>\nEnchanted creature doesn't untap during its controller's untap step."
  },
  {
    "Toughness": "5",
    "Rarity": "Uncommon",
    "Artist": "Zack Stella",
    "Flavor": "\"I knew I should have stayed with the boat. Always stay with the boat!\"",
    "cmc": 5,
    "MultiverseID": 435292,
    "SetCode": "XLN",
    "Name": "Charging Monstrosaur",
    "Power": "5",
    "Colors": [ "Red" ],
    "Manacost": "{{4}}{{R}}",
    "Types": [ "Creature" ],
    "CardNumber": "138",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Trample, haste"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "James Ryman",
    "Flavor": "While other pirates prowl for treasure, Captain Parrish plunders secrets.",
    "cmc": 2,
    "MultiverseID": 435200,
    "SetCode": "XLN",
    "Name": "Chart a Course",
    "Colors": [ "Blue" ],
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Sorcery" ],
    "Type": "Sorcery",
    "CardNumber": "48",
    "Text": "Draw two cards. Then discard a card unless you attacked with a creature this turn."
  },
  {
    "Rarity": "Common",
    "Artist": "Matt Stewart",
    "Flavor": "For the necro-alchemist, any puzzle can be solved with intelligence and harvested body parts.",
    "cmc": 2,
    "MultiverseID": 220649,
    "SetCode": "XLN",
    "Name": "Cobbled Wings",
    "Manacost": "{{2}}",
    "Types": [ "Artifact" ],
    "CardNumber": "219",
    "Type": "Artifact — Equipment",
    "SubTypes": [ "Equipment" ],
    "Text": "Equipped creature has flying.<br/>\nEquip {{1}} ({{1}}: Attach to target creature you control. Equip only as a sorcery.)"
  },
  {
    "Toughness": "6",
    "Rarity": "Common",
    "Artist": "Jesper Ejsing",
    "Flavor": "If you feel the ground quake, run. If you hear its bellow, flee. If you see its teeth, it's too late.",
    "cmc": 6,
    "MultiverseID": 435335,
    "SetCode": "XLN",
    "Name": "Colossal Dreadmaw",
    "Power": "6",
    "Colors": [ "Green" ],
    "Manacost": "{{4}}{{G}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "180",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Trample"
  },
  {
    "Rarity": "Common",
    "Artist": "Jonathan Kuo",
    "cmc": 1,
    "MultiverseID": 435336,
    "SetCode": "XLN",
    "Name": "Commune with Dinosaurs",
    "Colors": [ "Green" ],
    "Manacost": "{{G}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "181",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If an effect refers to a \"[subtype] spell\" or \"[subtype] card,\" it refers only to a spell or card that has that subtype. For example, March of the Drowned is a card that benefits Pirates and features Pirates in its illustration, but it isn't a Pirate card."
      }
    ],
    "Text": "Look at the top five cards of your library. You may reveal a Dinosaur or land card from among them and put it into your hand. Put the rest on the bottom of your library in any order."
  },
  {
    "Names": [ "Conqueror's Galleon", "Conqueror's Foothold" ],
    "Rarity": "Rare",
    "Artist": "Emrah Elmasli",
    "cmc": 4,
    "MultiverseID": 435391,
    "SetCode": "XLN",
    "Name": "Conqueror's Foothold",
    "CardNumber": "234b",
    "Types": [ "Land" ],
    "Type": "Land",
    "Text": "(Transforms from Conqueror's Galleon.)<br/>\n{{Tap}}: Add {{C}} to your mana pool.<br/>\n{{2}}, {{Tap}}: Draw a card, then discard a card.<br/>\n{{4}}, {{Tap}}: Draw a card.<br/>\n{{6}}, {{Tap}}: Return target card from your graveyard to your hand."
  },
  {
    "Names": [ "Conqueror's Galleon", "Conqueror's Foothold" ],
    "Rarity": "Rare",
    "Artist": "Emrah Elmasli",
    "SubTypes": [ "Vehicle" ],
    "cmc": 4,
    "MultiverseID": 435390,
    "SetCode": "XLN",
    "Name": "Conqueror's Galleon",
    "Power": "2",
    "Toughness": "10",
    "Manacost": "{{4}}",
    "Types": [ "Artifact" ],
    "CardNumber": "234a",
    "Type": "Artifact — Vehicle",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Conqueror's Galleon won't be exiled if it doesn't survive combat."
      },
      {
        "Date": "2017-09-29",
        "Text": "Unlike the other double-faced cards in the Ixalan set, Conqueror's Galleon is exiled and then returned to battlefield transformed. It will be considered a new object entering the battlefield. Notably, it will return to the battlefield untapped."
      },
      {
        "Date": "2017-09-29",
        "Text": "For more information on double-faced cards, see the Ixalan mechanics article (http://magic.wizards.com/en/articles/archive/feature/ixalan-mechanics)."
      },
      {
        "Date": "2017-09-29",
        "Text": "Each Vehicle is printed with a power and toughness, but it's not a creature. If it becomes a creature (most likely through its crew ability), it will have that power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect causes a Vehicle to become an artifact creature with a specified power and toughness, that effect overwrites the Vehicle's printed power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "Vehicle is an artifact type, not a creature type. A Vehicle that's crewed won't normally have any creature type."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once a player announces that he or she is activating a crew ability, no player may take other actions until the ability has been paid for. Notably, players can't try to stop the ability by changing a creature's power or by removing or tapping a creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "Any untapped creature you control can be tapped to pay a crew cost, even one that just came under your control."
      },
      {
        "Date": "2017-09-29",
        "Text": "You may tap more creatures than necessary to activate a crew ability."
      },
      {
        "Date": "2017-09-29",
        "Text": "Creatures that crew a Vehicle aren't attached to it or related in any other way. Effects that affect the Vehicle, such as by destroying it or giving it a +1/+1 counter, don't affect the creatures that crewed it."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once a Vehicle becomes a creature, it behaves exactly like any other artifact creature. It can't attack unless you've controlled it continuously since your turn began, it can block if it's untapped, it can be tapped to pay a Vehicle's crew cost, and so on."
      },
      {
        "Date": "2017-09-29",
        "Text": "You may activate a crew ability of a Vehicle even if it's already an artifact creature. Doing so has no effect on the Vehicle. It doesn't change its power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "For a Vehicle to be able to attack, it must be a creature as the declare attackers step begins, so the latest you can activate its crew ability to attack with it is during the beginning of combat step. For a Vehicle to be able to block, it must be a creature as the declare blockers step begins, so the latest you can activate its crew ability to block with it is during the declare attackers step. In either case, players may take actions after the crew ability resolves but before the Vehicle has been declared as an attacking or blocking creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "When a Vehicle becomes a creature, that doesn't count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won't trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a permanent becomes a copy of a Vehicle, the copy won't be a creature, even if the Vehicle it's copying has become an artifact creature."
      }
    ],
    "Text": "When Conqueror's Galleon attacks, exile it at end of combat, then return it to the battlefield transformed under your control.<br/>\nCrew 4 (Tap any number of creatures you control with total power 4 or more: This Vehicle becomes an artifact creature until end of turn.)"
  },
  {
    "Rarity": "Common",
    "Artist": "Winona Nelson",
    "Flavor": "For a price, the floating city of High and Dry offers all the amenities a pirate could want: rest, recreation, and revenge.",
    "cmc": 5,
    "MultiverseID": 435249,
    "SetCode": "XLN",
    "Name": "Contract Killing",
    "Colors": [ "Black" ],
    "Manacost": "{{3}}{{B}}{{B}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "95",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the target creature is an illegal target by the time Contract Killing resolves, the entire spell is countered. You won't get Treasures. If, on the other hand, the target is a legal target but isn't destroyed (most likely because it has indestructible), you'll get Treasures."
      }
    ],
    "Text": "Destroy target creature. Create two colorless Treasure artifact tokens with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "Rarity": "Common",
    "Artist": "Ben Maier",
    "Flavor": "No lock of iron is a match for Vraska's will of stone.",
    "cmc": 2,
    "MultiverseID": 435250,
    "SetCode": "XLN",
    "Name": "Costly Plunder",
    "Colors": [ "Black" ],
    "Manacost": "{{1}}{{B}}",
    "Types": [ "Instant" ],
    "CardNumber": "96",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can't sacrifice a Treasure to pay mana towards Costly Plunder's cost and also to pay its additional cost."
      }
    ],
    "Text": "As an additional cost to cast Costly Plunder, sacrifice an artifact or creature.<br/>\nDraw two cards."
  },
  {
    "Rarity": "Common",
    "Artist": "Mark Behm",
    "Flavor": "The Legion's conquistadors could endure Ixalan's sun. Their forts could withstand a charging ceratops. But nothing can stop a ceratops strengthened by the sun.",
    "cmc": 3,
    "MultiverseID": 435337,
    "SetCode": "XLN",
    "Name": "Crash the Ramparts",
    "Colors": [ "Green" ],
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "182",
    "Text": "Target creature gets +3/+3 and gains trample until end of turn."
  },
  {
    "Rarity": "Common",
    "Artist": "Tomasz Jedruszek",
    "Flavor": "\"Do not mistake your lofty vantage point for safety.\"<br/>\n—Shaper Tuvasa",
    "cmc": 3,
    "MultiverseID": 435338,
    "SetCode": "XLN",
    "Name": "Crushing Canopy",
    "Colors": [ "Green" ],
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "183",
    "Text": "Choose one —<br/>\n• Destroy target creature with flying.<br/>\n• Destroy target enchantment."
  },
  {
    "cmc": 2,
    "MultiverseID": 435201,
    "Colors": [ "Blue" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Activating the first ability of Daring Saboteur after it has become blocked won't cause it to become unblocked."
      }
    ],
    "Text": "{{2}}{{U}}: Daring Saboteur can't be blocked this turn.<br/>\nWhenever Daring Saboteur deals combat damage to a player, you may draw a card. If you do, discard a card.",
    "Rarity": "Rare",
    "Artist": "Victor Adame Minguez",
    "Flavor": "\"They'll never see me coming.\"",
    "SetCode": "XLN",
    "Name": "Daring Saboteur",
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Human Pirate",
    "Power": "2",
    "CardNumber": "49"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Josh Hass",
    "Flavor": "Demons lurk in the shadows of ancient ruins, spreading plague and corruption across the land.",
    "cmc": 5,
    "MultiverseID": 435251,
    "SetCode": "XLN",
    "Name": "Dark Nourishment",
    "Colors": [ "Black" ],
    "Manacost": "{{4}}{{B}}",
    "Types": [ "Instant" ],
    "CardNumber": "97",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the target creature or player is an illegal target by the time Dark Nourishment resolves, the entire spell is countered. You won't gain life."
      }
    ],
    "Text": "Dark Nourishment deals 3 damage to target creature or player. You gain 3 life."
  },
  {
    "cmc": 5,
    "MultiverseID": 435376,
    "Colors": [ "Blue", "Black" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Because damage remains marked on a creature until it's removed as the turn ends, the damage Deadeye Plunderers takes during combat may become lethal if artifacts you control leave the battlefield later in the turn."
      }
    ],
    "Text": "Deadeye Plunderers gets +1/+1 for each artifact you control.<br/>\n{{2}}{{U}}{{B}}: Create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\"",
    "Rarity": "Uncommon",
    "Artist": "Greg Opalinski",
    "Flavor": "\"Keep your friends close and your enemies within range.\"",
    "SetCode": "XLN",
    "Name": "Deadeye Plunderers",
    "Manacost": "{{3}}{{U}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Human Pirate",
    "Power": "3",
    "CardNumber": "220"
  },
  {
    "Toughness": "2",
    "Rarity": "Uncommon",
    "Artist": "Josh Hass",
    "Flavor": "\"Welcome aboard, mate! You're going to need this.\"",
    "cmc": 4,
    "MultiverseID": 435202,
    "SetCode": "XLN",
    "Name": "Deadeye Quartermaster",
    "Power": "2",
    "Colors": [ "Blue" ],
    "Manacost": "{{3}}{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "50",
    "Type": "Creature — Human Pirate",
    "SubTypes": [ "Human", "Pirate" ],
    "Text": "When Deadeye Quartermaster enters the battlefield, you may search your library for an Equipment or Vehicle card, reveal it, put it into your hand, then shuffle your library."
  },
  {
    "cmc": 3,
    "MultiverseID": 435252,
    "Colors": [ "Black" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      }
    ],
    "Text": "Raid — When Deadeye Tormentor enters the battlefield, if you attacked with a creature this turn, target opponent discards a card.",
    "Rarity": "Common",
    "Artist": "Eric Deschamps",
    "Flavor": "Despite their noble heritage, the pirates of the Deadeye Fleet are known for underhanded tactics and despicable trickery.",
    "SetCode": "XLN",
    "Name": "Deadeye Tormentor",
    "Manacost": "{{2}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Human Pirate",
    "Power": "2",
    "CardNumber": "98"
  },
  {
    "SubTypes": [ "Human", "Pirate" ],
    "Rarity": "Rare",
    "Artist": "Deruchenko Alexander",
    "Toughness": "1",
    "cmc": 1,
    "MultiverseID": 435253,
    "SetCode": "XLN",
    "Name": "Deadeye Tracker",
    "Power": "1",
    "Colors": [ "Black" ],
    "Manacost": "{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "99",
    "Type": "Creature — Human Pirate",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can't activate Deadeye Tracker's ability without targeting two cards in a single opponent's graveyard."
      },
      {
        "Date": "2017-09-29",
        "Text": "If one target card is an illegal target by the time Deadeye Tracker's ability resolves, the remaining legal target is exiled and Deadeye Tracker explores."
      },
      {
        "Date": "2017-09-29",
        "Text": "If each target card is an illegal target by the time Deadeye Tracker's ability resolves, the entire ability is countered. Deadeye Tracker won't explore."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "{{1}}{{B}}, {{Tap}}: Exile two target cards from an opponent's graveyard. Deadeye Tracker explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)"
  },
  {
    "SubTypes": [ "Dinosaur" ],
    "Rarity": "Rare",
    "Artist": "Tyler Jacobson",
    "Toughness": "2",
    "cmc": 3,
    "MultiverseID": 435339,
    "SetCode": "XLN",
    "Name": "Deathgorge Scavenger",
    "Power": "3",
    "Colors": [ "Green" ],
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "184",
    "Type": "Creature — Dinosaur",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "There's no way to get both bonuses at once while Deathgorge Scavenger's ability is resolving. If an artifact creature card is exiled this way, it's a creature card and not a noncreature card."
      }
    ],
    "Text": "Whenever Deathgorge Scavenger enters the battlefield or attacks, you may exile target card from a graveyard. If a creature card is exiled this way, you gain 2 life. If a noncreature card is exiled this way, Deathgorge Scavenger gets +1/+1 until end of turn."
  },
  {
    "cmc": 6,
    "MultiverseID": 435254,
    "Colors": [ "Black" ],
    "SubTypes": [ "Vampire", "Knight" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Deathless Ancient's last ability can be activated only while it's in your graveyard."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once you announce that you're activating Deathless Ancient's last ability, no player may take other actions until the ability's been paid for. Notably, players can't try to stop the ability by tapping or removing Vampires you control."
      },
      {
        "Date": "2017-09-29",
        "Text": "To activate the last ability, you may tap any untapped Vampires you control, including ones you haven't controlled continuously since the beginning of your most recent turn. (Note that tapping the creature doesn't use {T} [the tap symbol].)"
      }
    ],
    "Text": "Flying<br/>\nTap three untapped Vampires you control: Return Deathless Ancient from your graveyard to your hand.",
    "Rarity": "Uncommon",
    "Artist": "Nils Hamm",
    "Flavor": "\"Ancient one, we have reached the promised shore. The Immortal Sun is near. Drink and awake.\"",
    "SetCode": "XLN",
    "Name": "Deathless Ancient",
    "Manacost": "{{4}}{{B}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "4",
    "Type": "Creature — Vampire Knight",
    "Power": "4",
    "CardNumber": "100"
  },
  {
    "cmc": 2,
    "MultiverseID": 435340,
    "Colors": [ "Green" ],
    "SubTypes": [ "Merfolk", "Shaman" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Deeproot Champion's ability resolves before the spell that caused it to trigger."
      }
    ],
    "Text": "Whenever you cast a noncreature spell, put a +1/+1 counter on Deeproot Champion.",
    "Rarity": "Rare",
    "Artist": "Raymond Swanland",
    "Flavor": "\"No good will come from what you seek. Turn back now or suffer an ignoble death far from your home.\"",
    "SetCode": "XLN",
    "Name": "Deeproot Champion",
    "Manacost": "{{1}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Merfolk Shaman",
    "Power": "1",
    "CardNumber": "185"
  },
  {
    "cmc": 2,
    "MultiverseID": 435341,
    "Colors": [ "Green" ],
    "SubTypes": [ "Merfolk", "Warrior" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Deeproot Warrior's ability triggers only once if multiple creatures block it."
      }
    ],
    "Text": "Whenever Deeproot Warrior becomes blocked, it gets +1/+1 until end of turn.",
    "Rarity": "Common",
    "Artist": "Slawomir Maniak",
    "Flavor": "\"We breathe from our soul and bones to give strength to the jungle. The jungle breathes from its roots and rivers to give strength to us.\"<br/>\n—Shaper Falani",
    "SetCode": "XLN",
    "Name": "Deeproot Warrior",
    "Manacost": "{{1}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Merfolk Warrior",
    "Power": "2",
    "CardNumber": "186"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Zezhou Chen",
    "Flavor": "A visit to the Deeproot Tree and its ancient spring replenishes a merfolk's connection to nature.",
    "cmc": 3,
    "MultiverseID": 435203,
    "SetCode": "XLN",
    "Name": "Deeproot Waters",
    "Colors": [ "Blue" ],
    "Manacost": "{{2}}{{U}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "51",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The ability of Deeproot Waters resolves before the spell that caused it to trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect refers to a \"[subtype] spell\" or \"[subtype] card,\" it refers only to a spell or card that has that subtype. For example, March of the Drowned is a card that benefits Pirates and features Pirates in its illustration, but it isn't a Pirate card."
      }
    ],
    "Text": "Whenever you cast a Merfolk spell, create a 1/1 blue Merfolk creature token with hexproof. (A creature with hexproof can't be the target of spells or abilities your opponents control.)"
  },
  {
    "Rarity": "Common",
    "Artist": "Gary Ruddell",
    "Flavor": "\"Pound the steel until it fits.<br/>\nDoesn't work? Bash to bits.\"<br/>\n—Dwarven forging song",
    "cmc": 4,
    "MultiverseID": 129522,
    "SetCode": "XLN",
    "Name": "Demolish",
    "Colors": [ "Red" ],
    "Manacost": "{{3}}{{R}}",
    "Types": [ "Sorcery" ],
    "Type": "Sorcery",
    "CardNumber": "196",
    "Text": "Destroy target artifact or land."
  },
  {
    "Rarity": "Common",
    "Artist": "Christopher Rush",
    "Flavor": "\"Illusion is a crutch for those with no grounding in reality.\"<br/>\n—Cho-Manno",
    "cmc": 1,
    "MultiverseID": 129524,
    "SetCode": "XLN",
    "Name": "Demystify",
    "Colors": [ "White" ],
    "Manacost": "{{W}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "14",
    "Text": "Destroy target enchantment."
  },
  {
    "Rarity": "Common",
    "Artist": "John Stanko",
    "Flavor": "Pockets full of gold, lungs full of brine.",
    "cmc": 3,
    "MultiverseID": 435204,
    "SetCode": "XLN",
    "Name": "Depths of Desire",
    "Colors": [ "Blue" ],
    "Manacost": "{{2}}{{U}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "52",
    "Text": "Return target creature to its owner's hand. Create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "cmc": 2,
    "MultiverseID": 435255,
    "Colors": [ "Black" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once Desperate Castaways has attacked, it will remain in combat even if you no longer control an artifact."
      }
    ],
    "Text": "Desperate Castaways can't attack unless you control an artifact.",
    "Rarity": "Common",
    "Artist": "Zoltan Boros",
    "Flavor": "A pirate crew without a ship is a crew that will do anything to get one.",
    "SetCode": "XLN",
    "Name": "Desperate Castaways",
    "Manacost": "{{1}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Human Pirate",
    "Power": "2",
    "CardNumber": "101"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Bram Sels",
    "Flavor": "If you're in the way of a ceratops charge and you're made of mere flesh and bone, then you're not really in the way.",
    "cmc": 3,
    "MultiverseID": 435294,
    "SetCode": "XLN",
    "Name": "Dinosaur Stampede",
    "Colors": [ "Red" ],
    "Manacost": "{{2}}{{R}}",
    "Types": [ "Instant" ],
    "CardNumber": "140",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "In a Two-Headed Giant game, attacking creatures your teammate controls get +2/+0, but only Dinosaurs you control gain trample."
      }
    ],
    "Text": "Attacking creatures get +2/+0 until end of turn. Dinosaurs you control gain trample until end of turn."
  },
  {
    "cmc": 2,
    "MultiverseID": 435377,
    "Colors": [ "Black", "Red" ],
    "SubTypes": [ "Orc", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Count the number of other attacking Pirates as the ability resolves to determine the size of the bonus."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once the ability resolves, the bonus won't change later in the turn, even if the number of other attacking Pirates does."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a Two-Headed Giant game, attacking Pirates controlled by your teammate will count for Dire Fleet Captain's ability."
      }
    ],
    "Text": "Whenever Dire Fleet Captain attacks, it gets +1/+1 until end of turn for each other attacking Pirate.",
    "Rarity": "Uncommon",
    "Artist": "Yongjae Choi",
    "Flavor": "Orcs are happiest under captains who steer toward battle. Orcs of the Dire Fleet are downright jovial.",
    "SetCode": "XLN",
    "Name": "Dire Fleet Captain",
    "Manacost": "{{B}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Orc Pirate",
    "Power": "2",
    "CardNumber": "221"
  },
  {
    "Toughness": "1",
    "Rarity": "Common",
    "Artist": "Deruchenko Alexander",
    "Flavor": "Among the pirates of the Brazen Coalition, the only thing more dangerous than failure is success.",
    "cmc": 2,
    "MultiverseID": 435256,
    "SetCode": "XLN",
    "Name": "Dire Fleet Hoarder",
    "Power": "2",
    "Colors": [ "Black" ],
    "Manacost": "{{1}}{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "102",
    "Type": "Creature — Human Pirate",
    "SubTypes": [ "Human", "Pirate" ],
    "Text": "When Dire Fleet Hoarder dies, create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "SubTypes": [ "Human", "Pirate" ],
    "Rarity": "Common",
    "Artist": "John Severin Brassell",
    "Toughness": "2",
    "cmc": 4,
    "MultiverseID": 435257,
    "SetCode": "XLN",
    "Name": "Dire Fleet Interloper",
    "Power": "2",
    "Colors": [ "Black" ],
    "Manacost": "{{3}}{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "103",
    "Type": "Creature — Human Pirate",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "Menace<br/>\nWhen Dire Fleet Interloper enters the battlefield, it explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)"
  },
  {
    "cmc": 5,
    "MultiverseID": 435258,
    "Colors": [ "Black" ],
    "SubTypes": [ "Orc", "Pirate", "Wizard" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "For example, if you have 13 life, you'll lose 5 life."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a player has 1 life, that player loses 1 life. If each player has 0 life after that, the game's a draw."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a Two-Headed Giant game, each player loses a third of the team's life total rounded up. For example, if a team has 13 life, each player on that team loses 5 life and the team loses 10 life total."
      }
    ],
    "Text": "Menace, deathtouch<br/>\nWhen Dire Fleet Ravager enters the battlefield, each player loses a third of his or her life, rounded up.",
    "Rarity": "Mythic Rare",
    "Artist": "Bram Sels",
    "Flavor": "His fists fume with the decay of death, each strike a plague on the hearts of his enemies.",
    "SetCode": "XLN",
    "Name": "Dire Fleet Ravager",
    "Manacost": "{{3}}{{B}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "4",
    "Type": "Creature — Orc Pirate Wizard",
    "Power": "4",
    "CardNumber": "104"
  },
  {
    "Rarity": "Common",
    "Artist": "Magali Villeneuve",
    "Flavor": "\"Seeing the river is not the same as seeing the fish.\"",
    "cmc": 1,
    "MultiverseID": 435205,
    "SetCode": "XLN",
    "Name": "Dive Down",
    "Colors": [ "Blue" ],
    "Manacost": "{{U}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "53",
    "Text": "Target creature you control gets +0/+3 and gains hexproof until end of turn. (It can't be the target of spells or abilities your opponents control.)"
  },
  {
    "Names": [ "Dowsing Dagger", "Lost Vale" ],
    "Rarity": "Rare",
    "Artist": "Florian de Gesincourt",
    "cmc": 2,
    "MultiverseID": 435392,
    "SetCode": "XLN",
    "Name": "Dowsing Dagger",
    "SubTypes": [ "Equipment" ],
    "Manacost": "{{2}}",
    "Types": [ "Artifact" ],
    "CardNumber": "235a",
    "Type": "Artifact — Equipment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Attacking with an equipped creature doesn't cause Equipment attached to it to become tapped. Dowsing Dagger will normally be untapped when it transforms into Lost Vale."
      },
      {
        "Date": "2017-09-29",
        "Text": "For more information on double-faced cards, see the Ixalan mechanics article (http://magic.wizards.com/en/articles/archive/feature/ixalan-mechanics)."
      }
    ],
    "Text": "When Dowsing Dagger enters the battlefield, target opponent creates two 0/2 green Plant creature tokens with defender.<br/>\nEquipped creature gets +2/+1.<br/>\nWhenever equipped creature deals combat damage to a player, you may transform Dowsing Dagger.<br/>\nEquip {{2}}"
  },
  {
    "Rarity": "Rare",
    "Artist": "Jon Foster",
    "cmc": 0,
    "MultiverseID": 191091,
    "SetCode": "XLN",
    "Name": "Dragonskull Summit",
    "CardNumber": "223",
    "Types": [ "Land" ],
    "Type": "Land",
    "Rulings": [
      {
        "Date": "2009-10-01",
        "Text": "This checks for lands you control with the land type Swamp or Mountain, not for lands named Swamp or Mountain. The lands it checks for don't have to be basic lands. For example, if you control Stomping Ground (a nonbasic land with the land types Mountain and Forest), Dragonskull Summit will enter the battlefield untapped."
      },
      {
        "Date": "2009-10-01",
        "Text": "As this is entering the battlefield, it checks for lands that are already on the battlefield. It won't see lands that are entering the battlefield at the same time (due to Warp World, for example)."
      }
    ],
    "Text": "Dragonskull Summit enters the battlefield tapped unless you control a Swamp or a Mountain.<br/>\n{{Tap}}: Add {{B}} or {{R}} to your mana pool."
  },
  {
    "SubTypes": [ "Siren", "Pirate" ],
    "Rarity": "Rare",
    "Artist": "Eric Deschamps",
    "Toughness": "3",
    "cmc": 4,
    "MultiverseID": 435206,
    "SetCode": "XLN",
    "Name": "Dreamcaller Siren",
    "Power": "3",
    "Colors": [ "Blue" ],
    "Manacost": "{{2}}{{U}}{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "54",
    "Type": "Creature — Siren Pirate",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Dreamcaller Siren's last ability won't trigger if you don't control another Pirate as it enters the battlefield. If you lose control of each other Pirate before that ability resolves, it won't do anything."
      }
    ],
    "Text": "Flash<br/>\nFlying<br/>\nDreamcaller Siren can block only creatures with flying.<br/>\nWhen Dreamcaller Siren enters the battlefield, if you control another Pirate, tap up to two target nonland permanents."
  },
  {
    "cmc": 2,
    "MultiverseID": 435342,
    "Colors": [ "Green" ],
    "SubTypes": [ "Human", "Druid" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Because damage remains marked on a creature until it's removed as the turn ends, the damage Drover of the Mighty takes during combat may become lethal if you no longer control a Dinosaur later in the turn."
      }
    ],
    "Text": "Drover of the Mighty gets +2/+2 as long as you control a Dinosaur.<br/>\n{{Tap}}: Add one mana of any color to your mana pool.",
    "Rarity": "Uncommon",
    "Artist": "Eric Deschamps",
    "Flavor": "\"I do not lead. They do not follow. We walk together.\"",
    "SetCode": "XLN",
    "Name": "Drover of the Mighty",
    "Manacost": "{{1}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Human Druid",
    "Power": "1",
    "CardNumber": "187"
  },
  {
    "Rarity": "Rare",
    "Artist": "Dave Kendall",
    "cmc": 0,
    "MultiverseID": 191067,
    "SetCode": "XLN",
    "Name": "Drowned Catacomb",
    "CardNumber": "224",
    "Types": [ "Land" ],
    "Type": "Land",
    "Rulings": [
      {
        "Date": "2009-10-01",
        "Text": "This checks for lands you control with the land type Island or Swamp, not for lands named Island or Swamp. The lands it checks for don't have to be basic lands. For example, if you control Blood Crypt (a nonbasic land with the land types Swamp and Mountain), Drowned Catacomb will enter the battlefield untapped."
      },
      {
        "Date": "2009-10-01",
        "Text": "As this is entering the battlefield, it checks for lands that are already on the battlefield. It won't see lands that are entering the battlefield at the same time (due to Warp World, for example)."
      }
    ],
    "Text": "Drowned Catacomb enters the battlefield tapped unless you control an Island or a Swamp.<br/>\n{{Tap}}: Add {{U}} or {{B}} to your mana pool."
  },
  {
    "Rarity": "Common",
    "Artist": "Joseph Meehan",
    "Flavor": "There is an eagerness among the Quiver of Kessig to prove they are the equal of the other cathar orders.",
    "cmc": 1,
    "MultiverseID": 409905,
    "SetCode": "XLN",
    "Name": "Dual Shot",
    "Colors": [ "Red" ],
    "Manacost": "{{R}}",
    "Types": [ "Instant" ],
    "CardNumber": "153",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can't target the same creature twice to have Dual Shot deal 2 damage to it."
      }
    ],
    "Text": "Dual Shot deals 1 damage to each of up to two target creatures."
  },
  {
    "Rarity": "Common",
    "Artist": "Pete Venters",
    "Flavor": "\"Change your mind, or I'll change it for you.\"",
    "cmc": 1,
    "MultiverseID": 14557,
    "SetCode": "XLN",
    "Name": "Duress",
    "Colors": [ "Black" ],
    "Manacost": "{{B}}",
    "Types": [ "Sorcery" ],
    "Type": "Sorcery",
    "CardNumber": "131",
    "Text": "Target opponent reveals his or her hand. You choose a noncreature, nonland card from it. That player discards that card."
  },
  {
    "SubTypes": [ "Vehicle" ],
    "Rarity": "Uncommon",
    "Artist": "Titus Lunter",
    "Flavor": "It loomed up over the horizon, silent and dark as a grave.",
    "cmc": 5,
    "MultiverseID": 435394,
    "SetCode": "XLN",
    "Name": "Dusk Legion Dreadnought",
    "Power": "4",
    "Toughness": "6",
    "Manacost": "{{5}}",
    "Types": [ "Artifact" ],
    "CardNumber": "236",
    "Type": "Artifact — Vehicle",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Each Vehicle is printed with a power and toughness, but it's not a creature. If it becomes a creature (most likely through its crew ability), it will have that power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect causes a Vehicle to become an artifact creature with a specified power and toughness, that effect overwrites the Vehicle's printed power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "Vehicle is an artifact type, not a creature type. A Vehicle that's crewed won't normally have any creature type."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once a player announces that he or she is activating a crew ability, no player may take other actions until the ability has been paid for. Notably, players can't try to stop the ability by changing a creature's power or by removing or tapping a creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "Any untapped creature you control can be tapped to pay a crew cost, even one that just came under your control."
      },
      {
        "Date": "2017-09-29",
        "Text": "You may tap more creatures than necessary to activate a crew ability."
      },
      {
        "Date": "2017-09-29",
        "Text": "Creatures that crew a Vehicle aren't attached to it or related in any other way. Effects that affect the Vehicle, such as by destroying it or giving it a +1/+1 counter, don't affect the creatures that crewed it."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once a Vehicle becomes a creature, it behaves exactly like any other artifact creature. It can't attack unless you've controlled it continuously since your turn began, it can block if it's untapped, it can be tapped to pay a Vehicle's crew cost, and so on."
      },
      {
        "Date": "2017-09-29",
        "Text": "You may activate a crew ability of a Vehicle even if it's already an artifact creature. Doing so has no effect on the Vehicle. It doesn't change its power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "For a Vehicle to be able to attack, it must be a creature as the declare attackers step begins, so the latest you can activate its crew ability to attack with it is during the beginning of combat step. For a Vehicle to be able to block, it must be a creature as the declare blockers step begins, so the latest you can activate its crew ability to block with it is during the declare attackers step. In either case, players may take actions after the crew ability resolves but before the Vehicle has been declared as an attacking or blocking creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "When a Vehicle becomes a creature, that doesn't count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won't trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a permanent becomes a copy of a Vehicle, the copy won't be a creature, even if the Vehicle it's copying has become an artifact creature."
      }
    ],
    "Text": "Vigilance<br/>\nCrew 2 (Tap any number of creatures you control with total power 2 or more: This Vehicle becomes an artifact creature until end of turn.)"
  },
  {
    "Toughness": "1",
    "Rarity": "Uncommon",
    "Artist": "Seb McKinnon",
    "Flavor": "\"The hour of Dusk is come.\"",
    "cmc": 1,
    "MultiverseID": 435160,
    "SetCode": "XLN",
    "Name": "Duskborne Skymarcher",
    "Power": "1",
    "Colors": [ "White" ],
    "Manacost": "{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "9",
    "Type": "Creature — Vampire Cleric",
    "SubTypes": [ "Vampire", "Cleric" ],
    "Text": "Flying<br/>\n{{W}}, {{Tap}}: Target attacking Vampire gets +1/+1 until end of turn."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Adrian Majkrzak",
    "cmc": 2,
    "MultiverseID": 435395,
    "SetCode": "XLN",
    "Name": "Elaborate Firecannon",
    "Manacost": "{{2}}",
    "Types": [ "Artifact" ],
    "Type": "Artifact",
    "CardNumber": "237",
    "Text": "Elaborate Firecannon doesn't untap during your untap step.<br/>\n{{4}}, {{Tap}}: Elaborate Firecannon deals 2 damage to target creature or player.<br/>\nAt the beginning of your upkeep, you may discard a card. If you do, untap Elaborate Firecannon."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Daniel Ljunggren",
    "Flavor": "\"By accepting my smallness I am vast.\"",
    "cmc": 4,
    "MultiverseID": 435343,
    "SetCode": "XLN",
    "Name": "Emergent Growth",
    "Colors": [ "Green" ],
    "Manacost": "{{3}}{{G}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "188",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the target creature attacks, the defending player must assign at least one blocker to it during the declare blockers step if that player controls any creatures that could block it. Other creatures may also block it, block other creatures, or not block at all."
      }
    ],
    "Text": "Target creature gets +5/+5 until end of turn and must be blocked this turn if able."
  },
  {
    "SubTypes": [ "Human", "Cleric" ],
    "Rarity": "Uncommon",
    "Artist": "Deruchenko Alexander",
    "Toughness": "1",
    "cmc": 3,
    "MultiverseID": 435161,
    "SetCode": "XLN",
    "Name": "Emissary of Sunrise",
    "Power": "2",
    "Colors": [ "White" ],
    "Manacost": "{{2}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "10",
    "Type": "Creature — Human Cleric",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "First strike<br/>\nWhen Emissary of Sunrise enters the battlefield, it explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)"
  },
  {
    "SubTypes": [ "Human", "Scout" ],
    "Rarity": "Rare",
    "Artist": "Victor Adame Minguez",
    "Toughness": "3",
    "cmc": 4,
    "MultiverseID": 435344,
    "SetCode": "XLN",
    "Name": "Emperor's Vanguard",
    "Power": "4",
    "Colors": [ "Green" ],
    "Manacost": "{{3}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "189",
    "Type": "Creature — Human Scout",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "Whenever Emperor's Vanguard deals combat damage to a player, it explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)"
  },
  {
    "Toughness": "1",
    "Rarity": "Common",
    "Artist": "Craig J Spearing",
    "Flavor": "Paladins of the Sanctum Seeker order are an adventurous lot, venturing into the wilds with monstrous mastiffs at their side.",
    "cmc": 1,
    "MultiverseID": 435162,
    "SetCode": "XLN",
    "Name": "Encampment Keeper",
    "Power": "1",
    "Colors": [ "White" ],
    "Manacost": "{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "11",
    "Type": "Creature — Hound",
    "SubTypes": [ "Hound" ],
    "Text": "First strike<br/>\n{{7}}{{W}}, {{Tap}}, Sacrifice Encampment Keeper: Creatures you control get +2/+2 until end of turn."
  },
  {
    "Rarity": "Rare",
    "Artist": "Winona Nelson",
    "Flavor": "The stronger the will, the more bewitching the song.",
    "cmc": 2,
    "MultiverseID": 435207,
    "SetCode": "XLN",
    "Name": "Entrancing Melody",
    "Colors": [ "Blue" ],
    "Manacost": "{{X}}{{U}}{{U}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "55",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If a permanent has {X} in its mana cost, X is considered to be 0."
      },
      {
        "Date": "2017-09-29",
        "Text": "The control-change effect of Entrancing Melody lasts indefinitely. It doesn't wear off during the cleanup step."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well, and any effects that give the player control of permanents immediately end."
      }
    ],
    "Text": "Gain control of target creature with converted mana cost X."
  },
  {
    "cmc": 2,
    "MultiverseID": 435260,
    "Colors": [ "Black" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "While resolving Fathom Fleet Captain's triggered ability, you can't pay {2} multiple times to create more than one Pirate token."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you don't control another nontoken Pirate at the moment Fathom Fleet Captain attacks, its triggered ability won't trigger. If you don't control another nontoken Pirate as that ability resolves, you can't pay {2}."
      }
    ],
    "Text": "Menace<br/>\nWhenever Fathom Fleet Captain attacks, if you control another nontoken Pirate, you may pay {{2}}. If you do, create a 2/2 black Pirate creature token with menace.",
    "Rarity": "Rare",
    "Artist": "Matt Stewart",
    "Flavor": "\"Join me, and take the world for yourself!\"",
    "SetCode": "XLN",
    "Name": "Fathom Fleet Captain",
    "Manacost": "{{1}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Human Pirate",
    "Power": "2",
    "CardNumber": "106"
  },
  {
    "Toughness": "3",
    "Rarity": "Common",
    "Artist": "Josu Hernaiz",
    "Flavor": "\"It was a bad evening for you, mate. Now it's chow time for the sharks.\"",
    "cmc": 4,
    "MultiverseID": 435261,
    "SetCode": "XLN",
    "Name": "Fathom Fleet Cutthroat",
    "Power": "3",
    "Colors": [ "Black" ],
    "Manacost": "{{3}}{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "107",
    "Type": "Creature — Human Pirate",
    "SubTypes": [ "Human", "Pirate" ],
    "Text": "When Fathom Fleet Cutthroat enters the battlefield, destroy target creature an opponent controls that was dealt damage this turn."
  },
  {
    "Toughness": "2",
    "Rarity": "Common",
    "Artist": "Zezhou Chen",
    "Flavor": "As she charges into battle, her arcane tattoos stir and crawl like fiery serpents.",
    "cmc": 2,
    "MultiverseID": 435296,
    "SetCode": "XLN",
    "Name": "Fathom Fleet Firebrand",
    "Power": "2",
    "Colors": [ "Red" ],
    "Manacost": "{{1}}{{R}}",
    "Types": [ "Creature" ],
    "CardNumber": "142",
    "Type": "Creature — Human Pirate",
    "SubTypes": [ "Human", "Pirate" ],
    "Text": "{{1}}{{R}}: Fathom Fleet Firebrand gets +1/+0 until end of turn."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Winona Nelson",
    "Flavor": "Long thought to be extinct, flocks of gryffs reappeared with Avacyn's return.",
    "cmc": 2,
    "MultiverseID": 240131,
    "SetCode": "XLN",
    "Name": "Favorable Winds",
    "Colors": [ "Blue" ],
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Enchantment" ],
    "Type": "Enchantment",
    "CardNumber": "51",
    "Text": "Creatures you control with flying get +1/+1."
  },
  {
    "Rarity": "Rare",
    "Artist": "Titus Lunter",
    "SubTypes": [ "Vehicle" ],
    "cmc": 3,
    "MultiverseID": 435396,
    "SetCode": "XLN",
    "Name": "Fell Flagship",
    "Power": "3",
    "Toughness": "3",
    "Manacost": "{{3}}",
    "Types": [ "Artifact" ],
    "CardNumber": "238",
    "Type": "Artifact — Vehicle",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Each Vehicle is printed with a power and toughness, but it's not a creature. If it becomes a creature (most likely through its crew ability), it will have that power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect causes a Vehicle to become an artifact creature with a specified power and toughness, that effect overwrites the Vehicle's printed power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "Vehicle is an artifact type, not a creature type. A Vehicle that's crewed won't normally have any creature type."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once a player announces that he or she is activating a crew ability, no player may take other actions until the ability has been paid for. Notably, players can't try to stop the ability by changing a creature's power or by removing or tapping a creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "Any untapped creature you control can be tapped to pay a crew cost, even one that just came under your control."
      },
      {
        "Date": "2017-09-29",
        "Text": "You may tap more creatures than necessary to activate a crew ability."
      },
      {
        "Date": "2017-09-29",
        "Text": "Creatures that crew a Vehicle aren't attached to it or related in any other way. Effects that affect the Vehicle, such as by destroying it or giving it a +1/+1 counter, don't affect the creatures that crewed it."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once a Vehicle becomes a creature, it behaves exactly like any other artifact creature. It can't attack unless you've controlled it continuously since your turn began, it can block if it's untapped, it can be tapped to pay a Vehicle's crew cost, and so on."
      },
      {
        "Date": "2017-09-29",
        "Text": "You may activate a crew ability of a Vehicle even if it's already an artifact creature. Doing so has no effect on the Vehicle. It doesn't change its power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "For a Vehicle to be able to attack, it must be a creature as the declare attackers step begins, so the latest you can activate its crew ability to attack with it is during the beginning of combat step. For a Vehicle to be able to block, it must be a creature as the declare blockers step begins, so the latest you can activate its crew ability to block with it is during the declare attackers step. In either case, players may take actions after the crew ability resolves but before the Vehicle has been declared as an attacking or blocking creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "When a Vehicle becomes a creature, that doesn't count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won't trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a permanent becomes a copy of a Vehicle, the copy won't be a creature, even if the Vehicle it's copying has become an artifact creature."
      }
    ],
    "Text": "Pirates you control get +1/+0.<br/>\nWhenever Fell Flagship deals combat damage to a player, that player discards a card.<br/>\nCrew 3 (Tap any number of creatures you control with total power 3 or more: This Vehicle becomes an artifact creature until end of turn.)"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Dimitar",
    "cmc": 0,
    "MultiverseID": 435415,
    "SetCode": "XLN",
    "Name": "Field of Ruin",
    "CardNumber": "254",
    "Types": [ "Land" ],
    "Type": "Land",
    "Text": "{{Tap}}: Add {{C}} to your mana pool.<br/>\n{{2}}, {{Tap}}, Sacrifice Field of Ruin: Destroy target nonbasic land an opponent controls. Each player searches his or her library for a basic land card, puts it onto the battlefield, then shuffles his or her library."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Ben Wootten",
    "Flavor": "Wary of the ferocious dinosaurs, the Legion of Dusk built up the walls of their fort—just in time for the pirates to burn them down.",
    "cmc": 3,
    "MultiverseID": 435297,
    "SetCode": "XLN",
    "Name": "Fiery Cannonade",
    "Colors": [ "Red" ],
    "Manacost": "{{2}}{{R}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "143",
    "Text": "Fiery Cannonade deals 2 damage to each non-Pirate creature."
  },
  {
    "cmc": 1,
    "MultiverseID": 435298,
    "Colors": [ "Red" ],
    "SubTypes": [ "Elemental" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can't target the same creature twice to have Fire Shrine Keeper deal 6 damage to it."
      }
    ],
    "Text": "Menace<br/>\n{{7}}{{R}}, {{Tap}}, Sacrifice Fire Shrine Keeper: It deals 3 damage to each of up to two target creatures.",
    "Rarity": "Common",
    "Artist": "Zoltan Boros",
    "Flavor": "Though grimed with the dust of centuries, the ancient shrine was not unguarded.",
    "SetCode": "XLN",
    "Name": "Fire Shrine Keeper",
    "Manacost": "{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Elemental",
    "Power": "1",
    "CardNumber": "144"
  },
  {
    "Rarity": "Common",
    "Artist": "Svetlin Velinov",
    "Flavor": "Goblins' fearlessness and diminutive size make them the perfect cannoneers.",
    "cmc": 3,
    "MultiverseID": 435299,
    "SetCode": "XLN",
    "Name": "Firecannon Blast",
    "Colors": [ "Red" ],
    "Manacost": "{{1}}{{R}}{{R}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "145",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      }
    ],
    "Text": "Firecannon Blast deals 3 damage to target creature.<br/>\nRaid — Firecannon Blast deals 6 damage to that creature instead if you attacked with a creature this turn."
  },
  {
    "cmc": 7,
    "MultiverseID": 435209,
    "Colors": [ "Blue" ],
    "SubTypes": [ "Fish" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Fleet Swallower's triggered ability can target any player, not just the player it's attacking."
      },
      {
        "Date": "2017-09-29",
        "Text": "If two Fleet Swallowers attack, each trigger determines the top half of that player's library separately. For example, if the target player has fifteen cards in his or her library, that player puts the top eight cards into the graveyard, then puts the top four cards into the graveyard."
      }
    ],
    "Text": "Whenever Fleet Swallower attacks, target player puts the top half of his or her library, rounded up, into his or her graveyard.",
    "Rarity": "Rare",
    "Artist": "Tomasz Jedruszek",
    "Flavor": "\"Captain, I think that island is following us.\"",
    "SetCode": "XLN",
    "Name": "Fleet Swallower",
    "Manacost": "{{5}}{{U}}{{U}}",
    "Types": [ "Creature" ],
    "Toughness": "6",
    "Type": "Creature — Fish",
    "Power": "6",
    "CardNumber": "57"
  },
  {
    "SuperTypes": [ "Basic" ],
    "Artist": "Anthony S. Waters",
    "cmc": 0,
    "MultiverseID": 129559,
    "SetCode": "XLN",
    "Name": "Forest",
    "CardNumber": "380",
    "Types": [ "Land" ],
    "Watermark": "Green",
    "Type": "Basic Land — Forest",
    "Rarity": "Basic Land",
    "SubTypes": [ "Forest" ]
  },
  {
    "Rarity": "Common",
    "Artist": "Jesper Ejsing",
    "Flavor": "Sun Empire warriors are taught to emulate the fearless raptors that fling themselves against towers of horn and muscle a hundred times their size.",
    "cmc": 3,
    "MultiverseID": 435300,
    "SetCode": "XLN",
    "Name": "Frenzied Raptor",
    "Toughness": "2",
    "Colors": [ "Red" ],
    "Manacost": "{{2}}{{R}}",
    "Types": [ "Creature" ],
    "Power": "4",
    "Type": "Creature — Dinosaur",
    "CardNumber": "146",
    "SubTypes": [ "Dinosaur" ]
  },
  {
    "Rarity": "Common",
    "Artist": "Izzy",
    "Flavor": "The River Heralds fight to keep all others from reaching the golden city. The city has its own defenses.",
    "cmc": 4,
    "MultiverseID": 435397,
    "SetCode": "XLN",
    "Name": "Gilded Sentinel",
    "Toughness": "3",
    "Manacost": "{{4}}",
    "Types": [ "Artifact", "Creature" ],
    "Power": "3",
    "Type": "Artifact Creature — Golem",
    "CardNumber": "239",
    "SubTypes": [ "Golem" ]
  },
  {
    "cmc": 8,
    "MultiverseID": 435378,
    "Colors": [ "White", "Red", "Green" ],
    "SubTypes": [ "Dinosaur", "Avatar" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If you have fewer cards in your library than the amount of damage Gishath deals, you reveal the cards you have. Because you're not drawing cards, you don't lose the game."
      }
    ],
    "Text": "Trample, vigilance, haste<br/>\nWhenever Gishath, Sun's Avatar deals combat damage to a player, reveal that many cards from the top of your library. Put any number of Dinosaur creature cards from among them onto the battlefield and the rest on the bottom of your library in a random order.",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Zack Stella",
    "SetCode": "XLN",
    "Name": "Gishath, Sun's Avatar",
    "Toughness": "6",
    "Manacost": "{{5}}{{R}}{{G}}{{W}}",
    "Types": [ "Creature" ],
    "Power": "7",
    "Type": "Legendary Creature — Dinosaur Avatar",
    "CardNumber": "222",
    "Rarity": "Mythic Rare"
  },
  {
    "Rarity": "Rare",
    "Artist": "Franz Vohwinkel",
    "cmc": 0,
    "MultiverseID": 190562,
    "SetCode": "XLN",
    "Name": "Glacial Fortress",
    "CardNumber": "226",
    "Types": [ "Land" ],
    "Type": "Land",
    "Rulings": [
      {
        "Date": "2009-10-01",
        "Text": "This checks for lands you control with the land type Plains or Island, not for lands named Plains or Island. The lands it checks for don't have to be basic lands. For example, if you control Watery Grave (a nonbasic land with the land types Island and Swamp), Glacial Fortress will enter the battlefield untapped."
      },
      {
        "Date": "2009-10-01",
        "Text": "As this is entering the battlefield, it checks for lands that are already on the battlefield. It won't see lands that are entering the battlefield at the same time (due to Warp World, for example)."
      }
    ],
    "Text": "Glacial Fortress enters the battlefield tapped unless you control a Plains or an Island.<br/>\n{{Tap}}: Add {{W}} or {{U}} to your mana pool."
  },
  {
    "Toughness": "4",
    "Rarity": "Uncommon",
    "Artist": "Viktor Titov",
    "Flavor": "\"The blood of the enemy is a sacrament. The strength it gives is proof that our cause is just.\"",
    "cmc": 5,
    "MultiverseID": 435163,
    "SetCode": "XLN",
    "Name": "Glorifier of Dusk",
    "Power": "4",
    "Colors": [ "White" ],
    "Manacost": "{{3}}{{W}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "12",
    "Type": "Creature — Vampire Soldier",
    "SubTypes": [ "Vampire", "Soldier" ],
    "Text": "Pay 2 life: Glorifier of Dusk gains flying until end of turn.<br/>\nPay 2 life: Glorifier of Dusk gains vigilance until end of turn."
  },
  {
    "Toughness": "3",
    "Rarity": "Rare",
    "Artist": "Zezhou Chen",
    "Flavor": "\"Follow her footsteps and she will show you the way.\"<br/>\n—Itzama the Crested",
    "cmc": 7,
    "MultiverseID": 435164,
    "SetCode": "XLN",
    "Name": "Goring Ceratops",
    "Power": "3",
    "Colors": [ "White" ],
    "Manacost": "{{5}}{{W}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "13",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Double strike<br/>\nWhenever Goring Ceratops attacks, other creatures you control gain double strike until end of turn."
  },
  {
    "Rarity": "Rare",
    "Artist": "Yongjae Choi",
    "cmc": 5,
    "MultiverseID": 435443,
    "SetCode": "XLN",
    "Name": "Grasping Current",
    "Colors": [ "Blue" ],
    "Manacost": "{{4}}{{U}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "282",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You may cast Grasping Current without choosing any target creatures. You'll just search for Jace, Ingenious Mind-Mage. However, if you choose any targets and all of those targets become illegal before Grasping Current resolves, the spell will be countered and you won't search."
      }
    ],
    "Text": "Return up to two target creatures to their owner's hand.<br/>\nSearch your library and/or graveyard for a card named Jace, Ingenious Mind-Mage, reveal it, and put it into your hand. If you searched your library this way, shuffle it."
  },
  {
    "Toughness": "4",
    "Rarity": "Common",
    "Artist": "Gabor Szikszai",
    "Flavor": "Often found browsing on the upper canopies of Ixalan's jungles, whiptails are known to absently bat away anything foolish enough to interrupt their meal.",
    "cmc": 4,
    "MultiverseID": 435345,
    "SetCode": "XLN",
    "Name": "Grazing Whiptail",
    "Power": "3",
    "Colors": [ "Green" ],
    "Manacost": "{{2}}{{G}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "190",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Reach"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Winona Nelson",
    "Flavor": "When the battle is over, the bitterest foes at last find common ground.",
    "cmc": 3,
    "MultiverseID": 435262,
    "SetCode": "XLN",
    "Name": "Grim Captain's Call",
    "Colors": [ "Black" ],
    "Manacost": "{{2}}{{B}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "108",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Grim Captain's Call doesn't target the cards to return. You choose them while it's resolving. No players may take actions between the time you make each choice and the time you return each card to your hand."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a card in your graveyard has more than one of these types (such as a Dinosaur that's a Vampire Dinosaur due to Arcane Adaptation's effect), you may choose to return it for one of its types and return another card of the other type."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you don't have a card in your graveyard of one of the listed creature types, you just continue to the next listed type."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect refers to a \"[subtype] spell\" or \"[subtype] card,\" it refers only to a spell or card that has that subtype. For example, March of the Drowned is a card that benefits Pirates and features Pirates in its illustration, but it isn't a Pirate card."
      }
    ],
    "Text": "Return a Pirate card from your graveyard to your hand, then do the same for Vampire, Dinosaur, and Merfolk."
  },
  {
    "Names": [ "Growing Rites of Itlimoc", "Itlimoc, Cradle of the Sun" ],
    "SuperTypes": [ "Legendary" ],
    "Artist": "Grzegorz Rutkowski",
    "cmc": 3,
    "MultiverseID": 435346,
    "SetCode": "XLN",
    "Name": "Growing Rites of Itlimoc",
    "Rarity": "Rare",
    "Colors": [ "Green" ],
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "191a",
    "Type": "Legendary Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The last ability of Growing Rites of Itlimoc doesn't trigger if you don't control four or more creatures as your end step begins. If you don't control four or more creatures as it resolves, it does nothing."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you control a creature that will be removed from the battlefield \"at the beginning of the next end step,\" you can resolve the ability of Growing Rites of Itlimoc before that creature leaves the battlefield."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you gain control of a creature \"until end of turn,\" or if a noncreature permanent you control becomes a creature \"until end of turn,\" it'll be a creature under your control through the entire end step."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you've attacked with a creature this turn, you'll get a Treasure even if the target opponent discards one or zero cards."
      },
      {
        "Date": "2017-09-29",
        "Text": "For more information on double-faced cards, see the Ixalan mechanics article (http://magic.wizards.com/en/articles/archive/feature/ixalan-mechanics)."
      }
    ],
    "Text": "When Growing Rites of Itlimoc enters the battlefield, look at the top four cards of your library. You may reveal a creature card from among them and put it into your hand. Put the rest on the bottom of your library in any order.<br/>\nAt the beginning of your end step, if you control four or more creatures, transform Growing Rites of Itlimoc."
  },
  {
    "Toughness": "3",
    "Rarity": "Common",
    "Artist": "Yongjae Choi",
    "Flavor": "\"Watch your backs, keep your blades at hand, and let the orc go first!\"<br/>\n—Captain Brandis Thorn",
    "cmc": 3,
    "MultiverseID": 435301,
    "SetCode": "XLN",
    "Name": "Headstrong Brute",
    "Power": "3",
    "Colors": [ "Red" ],
    "Manacost": "{{2}}{{R}}",
    "Types": [ "Creature" ],
    "CardNumber": "147",
    "Type": "Creature — Orc Pirate",
    "SubTypes": [ "Orc", "Pirate" ],
    "Text": "Headstrong Brute can't block.<br/>\nHeadstrong Brute has menace as long as you control another Pirate."
  },
  {
    "Rarity": "Common",
    "Artist": "Naomi Baker",
    "Flavor": "\"The elders say that if the intruders discovered the secret of the golden city, it would mean an end to our people.\"",
    "cmc": 4,
    "MultiverseID": 435210,
    "SetCode": "XLN",
    "Name": "Headwater Sentries",
    "Toughness": "5",
    "Colors": [ "Blue" ],
    "Manacost": "{{3}}{{U}}",
    "Types": [ "Creature" ],
    "Power": "2",
    "Type": "Creature — Merfolk Warrior",
    "CardNumber": "58",
    "SubTypes": [ "Merfolk", "Warrior" ]
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Sara Winters",
    "cmc": 3,
    "MultiverseID": 435263,
    "SetCode": "XLN",
    "Name": "Heartless Pillage",
    "Colors": [ "Black" ],
    "Manacost": "{{2}}{{B}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "109",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      }
    ],
    "Text": "Target opponent discards two cards.<br/>\nRaid — If you attacked with a creature this turn, create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "cmc": 4,
    "MultiverseID": 435211,
    "Colors": [ "Blue" ],
    "SubTypes": [ "Merfolk", "Warrior" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once a creature you control has become blocked, putting a +1/+1 counter on it won't cause it to become unblocked."
      }
    ],
    "Text": "Creatures you control with +1/+1 counters on them can't be blocked.",
    "Rarity": "Rare",
    "Artist": "Sara Winters",
    "Flavor": "\"You might as well try to stop the waterfall.\"",
    "SetCode": "XLN",
    "Name": "Herald of Secret Streams",
    "Manacost": "{{3}}{{U}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Merfolk Warrior",
    "Power": "2",
    "CardNumber": "59"
  },
  {
    "Rarity": "Common",
    "Artist": "John Stanko",
    "Flavor": "In the Rite of Redemption, nobles take the same vows as Elenda, the first vampire, and make the same eternal sacrifice.",
    "cmc": 3,
    "MultiverseID": 435398,
    "SetCode": "XLN",
    "Name": "Hierophant's Chalice",
    "Manacost": "{{3}}",
    "Types": [ "Artifact" ],
    "Type": "Artifact",
    "CardNumber": "240",
    "Text": "When Hierophant's Chalice enters the battlefield, target opponent loses 1 life and you gain 1 life.<br/>\n{{Tap}}: Add {{C}} to your mana pool."
  },
  {
    "Rarity": "Common",
    "Artist": "Victor Adame Minguez",
    "Flavor": "\"Whoa there. Easy. We're just going to take a little detour.\"",
    "cmc": 3,
    "MultiverseID": 417691,
    "SetCode": "XLN",
    "Name": "Hijack",
    "Colors": [ "Red" ],
    "Manacost": "{{1}}{{R}}{{R}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "118",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can target and gain control of an untapped artifact or creature this way. You can also untap an artifact or creature you already control and give it haste."
      }
    ],
    "Text": "Gain control of target artifact or creature until end of turn. Untap it. It gains haste until end of turn."
  },
  {
    "SubTypes": [ "Human", "Pirate" ],
    "Rarity": "Rare",
    "Artist": "Wayne Reynolds",
    "Toughness": "3",
    "cmc": 4,
    "MultiverseID": 435379,
    "SetCode": "XLN",
    "Name": "Hostage Taker",
    "Power": "2",
    "Colors": [ "Blue", "Black" ],
    "Manacost": "{{2}}{{U}}{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "223",
    "Type": "Creature — Human Pirate",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Hostage Taker has received errata to prevent it from targeting itself. The correct Oracle wording appears above."
      },
      {
        "Date": "2017-09-29",
        "Text": "If Hostage Taker leaves the battlefield before its triggered ability resolves, the target permanent won't be exiled."
      },
      {
        "Date": "2017-09-29",
        "Text": "Auras attached to the exiled permanent will be put into their owners' graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a token is exiled this way, it will cease to exist and won't return to the battlefield. You can't cast it."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once you begin to cast the exiled card, it's considered a new object. You'll control that spell and the permanent that spell becomes even if Hostage Taker leaves the battlefield."
      },
      {
        "Date": "2017-09-29",
        "Text": "If it's still in exile, the exiled card returns to the battlefield immediately after Hostage Taker leaves the battlefield. Nothing happens between the two events, including state-based actions."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a multiplayer game, if Hostage Taker's owner leaves the game while the card is still exiled and another player owns that card, the exiled card will return to the battlefield under its owner's control. Because the one-shot effect that returns the card isn't an ability that goes on the stack, it won't cease to exist along with the leaving player's spells and abilities on the stack."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, any spell or permanent cards you control from Hostage Taker's ability are exiled."
      }
    ],
    "Text": "When Hostage Taker enters the battlefield, exile another target creature or artifact until Hostage Taker leaves the battlefield. You may cast that card for as long as it remains exiled, and you may spend mana as though it were mana of any type to cast that spell."
  },
  {
    "Toughness": "2",
    "Rarity": "Common",
    "Artist": "Randy Vargas",
    "Flavor": "Don't make the mistake of thinking blunt horns can't kill.",
    "cmc": 2,
    "MultiverseID": 435447,
    "SetCode": "XLN",
    "Name": "Huatli's Snubhorn",
    "Power": "2",
    "Colors": [ "White" ],
    "Manacost": "{{1}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "286",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Vigilance (Attacking doesn't cause this creature to tap.)"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Zack Stella",
    "Flavor": "\"Run like the wind, fierce one. The hunt has begun.\"",
    "cmc": 1,
    "MultiverseID": 435448,
    "SetCode": "XLN",
    "Name": "Huatli's Spurring",
    "Colors": [ "Red" ],
    "Manacost": "{{R}}",
    "Types": [ "Instant" ],
    "CardNumber": "287",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Whether you control a Huatli planeswalker is checked only as Huatli's Spurring resolves. The creature's power won't change later in the turn if Huatli leaves or comes under your control."
      }
    ],
    "Text": "Target creature gets +2/+0 until end of turn. If you control a Huatli planeswalker, that creature gets +4/+0 until end of turn instead."
  },
  {
    "Rarity": "Mythic Rare",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Anna Steinbauer",
    "Loyalty": 4,
    "cmc": 6,
    "MultiverseID": 435446,
    "SetCode": "XLN",
    "Name": "Huatli, Dinosaur Knight",
    "CardNumber": "285",
    "Colors": [ "White", "Red" ],
    "Manacost": "{{4}}{{R}}{{W}}",
    "Types": [ "Planeswalker" ],
    "SubTypes": [ "Huatli" ],
    "Type": "Legendary Planeswalker — Huatli",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If either creature is an illegal target as Huatli's second ability resolves, the creature you control won't deal damage."
      },
      {
        "Date": "2017-09-29",
        "Text": "Huatli's last ability affects only Dinosaurs you control at the time it resolves. Dinosaurs you begin to control later in the turn or creatures that become Dinosaurs later in the turn won't get +4/+4."
      }
    ],
    "Text": "+2: Put two +1/+1 counters on up to one target Dinosaur you control.<br/>\n−3: Target Dinosaur you control deals damage equal to its power to target creature you don't control.<br/>\n−7: Dinosaurs you control get +4/+4 until end of turn."
  },
  {
    "Rarity": "Mythic Rare",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Tyler Jacobson",
    "Loyalty": 3,
    "cmc": 5,
    "MultiverseID": 435380,
    "SetCode": "XLN",
    "Name": "Huatli, Warrior Poet",
    "CardNumber": "224",
    "Colors": [ "White", "Red" ],
    "Manacost": "{{3}}{{R}}{{W}}",
    "Types": [ "Planeswalker" ],
    "SubTypes": [ "Huatli" ],
    "Type": "Legendary Planeswalker — Huatli",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The greatest power among creatures you control is determined as Huatli's first ability resolves. If that number is negative, you won't gain or lose any life."
      },
      {
        "Date": "2017-09-29",
        "Text": "You can activate Huatli's first ability even if you control no creatures. You simply won't gain any life."
      },
      {
        "Date": "2017-09-29",
        "Text": "You divide the damage among the target creatures as you activate Huatli's last ability. Each target must be assigned at least 1 damage. If X is 0, you can't choose any targets."
      },
      {
        "Date": "2017-09-29",
        "Text": "If some (but not all) of the targets become illegal, the original division of damage still applies, but no damage is dealt to illegal targets. If all targets become illegal, the ability will be countered."
      }
    ],
    "Text": "+2: You gain life equal to the greatest power among creatures you control.<br/>\n0: Create a 3/3 green Dinosaur creature token with trample.<br/>\n−X: Huatli, Warrior Poet deals X damage divided as you choose among any number of target creatures. Creatures dealt damage this way can't block this turn."
  },
  {
    "Toughness": "3",
    "Rarity": "Uncommon",
    "Artist": "Jesper Ejsing",
    "Flavor": "Its assistance is unnervingly similar to its hunting technique.",
    "cmc": 4,
    "MultiverseID": 435165,
    "SetCode": "XLN",
    "Name": "Imperial Aerosaur",
    "Power": "3",
    "Colors": [ "White" ],
    "Manacost": "{{3}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "14",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Flying<br/>\nWhen Imperial Aerosaur enters the battlefield, another target creature you control gets +1/+1 and gains flying until end of turn."
  },
  {
    "cmc": 1,
    "MultiverseID": 435166,
    "Colors": [ "White" ],
    "SubTypes": [ "Human", "Knight" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If you no longer control a Dinosaur after the first-strike combat damage step, Imperial Lancer won't have double strike, and so it won't deal regular combat damage."
      }
    ],
    "Text": "Imperial Lancer has double strike as long as you control a Dinosaur.",
    "Rarity": "Uncommon",
    "Artist": "Viktor Titov",
    "Flavor": "\"Together my mount and I are stronger than either of us apart.\"",
    "SetCode": "XLN",
    "Name": "Imperial Lancer",
    "Manacost": "{{W}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Human Knight",
    "Power": "1",
    "CardNumber": "15"
  },
  {
    "Toughness": "2",
    "Rarity": "Uncommon",
    "Artist": "Randy Gallegos",
    "Flavor": "\"The Immortal Sun will bring us true eternal life to replace the everlasting shadow of undeath.\"",
    "cmc": 3,
    "MultiverseID": 435167,
    "SetCode": "XLN",
    "Name": "Inspiring Cleric",
    "Power": "3",
    "Colors": [ "White" ],
    "Manacost": "{{2}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "16",
    "Type": "Creature — Vampire Cleric",
    "SubTypes": [ "Vampire", "Cleric" ],
    "Text": "When Inspiring Cleric enters the battlefield, you gain 4 life."
  },
  {
    "SuperTypes": [ "Basic" ],
    "Artist": "Donato Giancola",
    "cmc": 0,
    "MultiverseID": 129606,
    "SetCode": "XLN",
    "Name": "Island",
    "CardNumber": "368",
    "Types": [ "Land" ],
    "Watermark": "Blue",
    "Type": "Basic Land — Island",
    "Rarity": "Basic Land",
    "SubTypes": [ "Island" ]
  },
  {
    "Names": [ "Growing Rites of Itlimoc", "Itlimoc, Cradle of the Sun" ],
    "SuperTypes": [ "Legendary" ],
    "Artist": "Grzegorz Rutkowski",
    "Flavor": "Before the Sun Empire was born, humans and merfolk joined their magic to invoke a blessing of fertility on the land.",
    "cmc": 3,
    "MultiverseID": 435347,
    "SetCode": "XLN",
    "Name": "Itlimoc, Cradle of the Sun",
    "CardNumber": "191b",
    "Types": [ "Land" ],
    "Type": "Legendary Land",
    "Rarity": "Rare",
    "Text": "(Transforms from Growing Rites of Itlimoc.)<br/>\n{{Tap}}: Add {{G}} to your mana pool.<br/>\n{{Tap}}: Add {{G}} to your mana pool for each creature you control."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Chase Stone",
    "Flavor": "Jace awoke to the certainty that he was lost.",
    "cmc": 4,
    "MultiverseID": 435168,
    "SetCode": "XLN",
    "Name": "Ixalan's Binding",
    "Colors": [ "White" ],
    "Manacost": "{{3}}{{W}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "17",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If Ixalan's Binding leaves the battlefield before its triggered ability resolves, the target permanent won't be exiled."
      },
      {
        "Date": "2017-09-29",
        "Text": "Auras attached to the exiled permanent will be put into their owners' graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a token is exiled this way, it will cease to exist and won't return to the battlefield."
      },
      {
        "Date": "2017-09-29",
        "Text": "The exiled card returns to the battlefield immediately after Ixalan's Binding leaves the battlefield. Nothing happens between the two events, including state-based actions."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the exiled card has a different name in exile than it did on the battlefield, Ixalan's Binding stops players from casting spells with the name of that card as it exists in exile."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the exiled card is a land card that's become a nonland permanent, Ixalan's Binding won't stop players from playing lands with that name."
      },
      {
        "Date": "2017-09-29",
        "Text": "If there is no exiled card (perhaps because the exiled permanent was a token or was a commander that moved to the command zone in the Commander variant), Ixalan's Binding won't stop players from casting spells."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a multiplayer game, if Ixalan's Binding's owner leaves the game and another player owns the exiled card, the exiled card will return to the battlefield under its owner's control. Because the one-shot effect that returns the card isn't an ability that goes on the stack, it won't cease to exist along with the leaving player's spells and abilities on the stack."
      },
      {
        "Date": "2017-09-29",
        "Text": "There are many important moments in the story, but the most crucial—called \"story spotlights\"—are shown on cards. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."
      }
    ],
    "Text": "When Ixalan's Binding enters the battlefield, exile target nonland permanent an opponent controls until Ixalan's Binding leaves the battlefield.<br/>\nYour opponents can't cast spells with the same name as the exiled card."
  },
  {
    "SubTypes": [ "Human", "Druid" ],
    "Rarity": "Common",
    "Artist": "Lucas Graciano",
    "Toughness": "3",
    "cmc": 2,
    "MultiverseID": 435348,
    "SetCode": "XLN",
    "Name": "Ixalli's Diviner",
    "Power": "0",
    "Colors": [ "Green" ],
    "Manacost": "{{1}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "192",
    "Type": "Creature — Human Druid",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "When Ixalli's Diviner enters the battlefield, it explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)"
  },
  {
    "Toughness": "2",
    "Rarity": "Common",
    "Artist": "Lake Hurwitz",
    "Flavor": "The people of the Sun Empire worship the sun in three aspects. Ixalli is the Verdant Sun, who fosters growth in all things.",
    "cmc": 2,
    "MultiverseID": 435349,
    "SetCode": "XLN",
    "Name": "Ixalli's Keeper",
    "Power": "2",
    "Colors": [ "Green" ],
    "Manacost": "{{1}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "193",
    "Type": "Creature — Human Shaman",
    "SubTypes": [ "Human", "Shaman" ],
    "Text": "{{7}}{{G}}, {{Tap}}, Sacrifice Ixalli's Keeper: Target creature gets +5/+5 and gains trample until end of turn."
  },
  {
    "Toughness": "3",
    "Rarity": "Uncommon",
    "Artist": "Alex Konstad",
    "Flavor": "\"We drove the Sun Empire out of the forest long ago, and we will not let them return.\"",
    "cmc": 2,
    "MultiverseID": 435444,
    "SetCode": "XLN",
    "Name": "Jace's Sentinel",
    "Power": "1",
    "Colors": [ "Blue" ],
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "283",
    "Type": "Creature — Merfolk Warrior",
    "SubTypes": [ "Merfolk", "Warrior" ],
    "Text": "As long as you control a Jace planeswalker, Jace's Sentinel gets +1/+0 and can't be blocked."
  },
  {
    "Rarity": "Mythic Rare",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Kieran Yanner",
    "Loyalty": 3,
    "cmc": 3,
    "MultiverseID": 435212,
    "SetCode": "XLN",
    "Name": "Jace, Cunning Castaway",
    "CardNumber": "60",
    "Colors": [ "Blue" ],
    "Manacost": "{{1}}{{U}}{{U}}",
    "Types": [ "Planeswalker" ],
    "SubTypes": [ "Jace" ],
    "Type": "Legendary Planeswalker — Jace",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The delayed triggered ability created by Jace's first ability can trigger more than once in a turn if creatures you control deal combat damage at different times in a turn (most likely because one or more has first strike) or if creatures you control deal combat damage to more than one player at once."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a token created by Jace's second ability becomes the target of a spell, its ability triggers and goes on the stack on top of that spell. The ability will resolve first (causing the token to be sacrificed). Unless the spell has another target, it will then be countered when it tries to resolve for having no legal targets."
      },
      {
        "Date": "2017-09-29",
        "Text": "The tokens from Jace's last ability copy exactly what is printed on Jace and nothing else. They don't copy how many counters are on him or Auras attached to him, or any non-copy effects that have changed his color or types, and so on. They'll each enter the battlefield with three loyalty counters. You can activate one loyalty ability of each of the tokens this turn."
      },
      {
        "Date": "2017-09-29",
        "Text": "The tokens created by Jace's last ability don't have the legendary supertype. If another object becomes a copy of the token, that copy also won't be legendary."
      },
      {
        "Date": "2017-09-29",
        "Text": "You can control one legendary Jace, Cunning Castaway in addition to any number of nonlegendary copies of Jace, Cunning Castaway."
      }
    ],
    "Text": "+1: Whenever one or more creatures you control deal combat damage to a player this turn, draw a card, then discard a card.<br/>\n−2: Create a 2/2 blue Illusion creature token with \"When this creature becomes the target of a spell, sacrifice it.\"<br/>\n−5: Create two tokens that are copies of Jace, Cunning Castaway, except they're not legendary."
  },
  {
    "Rarity": "Mythic Rare",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Clint Cearley",
    "Loyalty": 5,
    "cmc": 6,
    "MultiverseID": 435441,
    "SetCode": "XLN",
    "Name": "Jace, Ingenious Mind-Mage",
    "CardNumber": "280",
    "Colors": [ "Blue" ],
    "Manacost": "{{4}}{{U}}{{U}}",
    "Types": [ "Planeswalker" ],
    "SubTypes": [ "Jace" ],
    "Type": "Legendary Planeswalker — Jace",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The control-change effect of Jace's last ability lasts indefinitely. It doesn't wear off during the cleanup step or when you lose control of Jace."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well, and any effects that give the player control of permanents immediately end."
      }
    ],
    "Text": "+1: Draw a card.<br/>\n+1: Untap all creatures you control.<br/>\n−9: Gain control of up to three target creatures."
  },
  {
    "cmc": 4,
    "MultiverseID": 435350,
    "Colors": [ "Green" ],
    "SubTypes": [ "Merfolk", "Shaman" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Jade Guardian can be the target of its own ability."
      }
    ],
    "Text": "Hexproof (This creature can't be the target of spells or abilities your opponents control.)<br/>\nWhen Jade Guardian enters the battlefield, put a +1/+1 counter on target Merfolk you control.",
    "Rarity": "Common",
    "Artist": "Chris Seaman",
    "Flavor": "The River Heralds believe that jade gives weight to their magic.",
    "SetCode": "XLN",
    "Name": "Jade Guardian",
    "Manacost": "{{3}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Merfolk Shaman",
    "Power": "2",
    "CardNumber": "194"
  },
  {
    "Toughness": "1",
    "Rarity": "Common",
    "Artist": "Kieran Yanner",
    "Flavor": "\"There is no power too great to be used in the defense of our ancestral lands.\"",
    "cmc": 1,
    "MultiverseID": 435351,
    "SetCode": "XLN",
    "Name": "Jungle Delver",
    "Power": "1",
    "Colors": [ "Green" ],
    "Manacost": "{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "195",
    "Type": "Creature — Merfolk Warrior",
    "SubTypes": [ "Merfolk", "Warrior" ],
    "Text": "{{3}}{{G}}: Put a +1/+1 counter on Jungle Delver."
  },
  {
    "cmc": 1,
    "MultiverseID": 435169,
    "Colors": [ "White" ],
    "SubTypes": [ "Human", "Cleric" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "To determine the total cost of a Dinosaur spell, start with the mana cost or alternative cost you're paying, add any cost increases, then apply any cost reductions. The converted mana cost of the creature remains unchanged, no matter what the total cost to cast it was."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect refers to a \"[subtype] spell\" or \"[subtype] card,\" it refers only to a spell or card that has that subtype. For example, March of the Drowned is a card that benefits Pirates and features Pirates in its illustration, but it isn't a Pirate card."
      }
    ],
    "Text": "Dinosaur spells you cast cost {{1}} less to cast.",
    "Rarity": "Common",
    "Artist": "Sara Winters",
    "Flavor": "The people of the Sun Empire worship the sun in three aspects. Kinjalli is the Wakening Sun, who created humans from clay and baked them in the sun's warmth.",
    "SetCode": "XLN",
    "Name": "Kinjalli's Caller",
    "Manacost": "{{W}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Human Cleric",
    "Power": "0",
    "CardNumber": "18"
  },
  {
    "cmc": 3,
    "MultiverseID": 435170,
    "Colors": [ "White" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If a creature an opponent controls enters the battlefield at the same time that Kinjalli's Sunwing enters the battlefield under your control, Kinjalli's Sunwing's effect doesn't apply to your opponent's creature."
      }
    ],
    "Text": "Flying<br/>\nCreatures your opponents control enter the battlefield tapped.",
    "Rarity": "Rare",
    "Artist": "Simon Dominic",
    "Flavor": "\"There are moments when I feel I could fly like the sunwing. Far away I would soar, but always a golden gale pushes me back.\"<br/>\n—Huatli",
    "SetCode": "XLN",
    "Name": "Kinjalli's Sunwing",
    "Manacost": "{{2}}{{W}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Dinosaur",
    "Power": "2",
    "CardNumber": "19"
  },
  {
    "SubTypes": [ "Human", "Pirate" ],
    "Rarity": "Uncommon",
    "Artist": "Dan Scott",
    "Toughness": "2",
    "cmc": 2,
    "MultiverseID": 435264,
    "SetCode": "XLN",
    "Name": "Kitesail Freebooter",
    "Power": "1",
    "Colors": [ "Black" ],
    "Manacost": "{{1}}{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "110",
    "Type": "Creature — Human Pirate",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If Kitesail Freebooter leaves the battlefield before its enters-the-battlefield ability resolves, the opponent will reveal his or her hand, but no card will be exiled."
      },
      {
        "Date": "2017-09-29",
        "Text": "The exiled card returns to its owner's hand immediately after Kitesail Freebooter leaves the battlefield. Nothing happens between the two events, including state-based actions."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a multiplayer game, if Kitesail Freebooter's owner leaves the game, the exiled card will return to its owner's hand. Because the one-shot effect that returns the card isn't an ability that goes on the stack, it won't cease to exist along with the leaving player's spells and abilities on the stack."
      }
    ],
    "Text": "Flying<br/>\nWhen Kitesail Freebooter enters the battlefield, target opponent reveals his or her hand. You choose a noncreature, nonland card from it. Exile that card until Kitesail Freebooter leaves the battlefield."
  },
  {
    "cmc": 3,
    "MultiverseID": 435213,
    "Colors": [ "Blue" ],
    "SubTypes": [ "Merfolk", "Wizard" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "To determine the total cost of an opponent's spell that targets a Merfolk you control, start with the mana cost or alternative cost that player is paying, add any cost increases, then apply any cost reductions. The converted mana cost of the spell remains unchanged, no matter what the total cost to cast it was."
      },
      {
        "Date": "2017-09-29",
        "Text": "Activated abilities contain a colon. They're generally written \"[Cost]: [Effect].\""
      },
      {
        "Date": "2017-09-29",
        "Text": "Kopala's abilities won't affect triggered abilities (starting with \"when,\" \"whenever,\" or \"at\") that target a Merfolk you control."
      },
      {
        "Date": "2017-09-29",
        "Text": "Spells and abilities that target more than one Merfolk you control cost only {2} more to cast or activate."
      }
    ],
    "Text": "Spells your opponents cast that target a Merfolk you control cost {{2}} more to cast.<br/>\nAbilities your opponents activate that target a Merfolk you control cost {{2}} more to activate.",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Magali Villeneuve",
    "Flavor": "\"I know these waters better than you know yourselves.\"",
    "SetCode": "XLN",
    "Name": "Kopala, Warden of Waves",
    "Toughness": "2",
    "Manacost": "{{1}}{{U}}{{U}}",
    "Types": [ "Creature" ],
    "Power": "2",
    "Type": "Legendary Creature — Merfolk Wizard",
    "CardNumber": "61",
    "Rarity": "Rare"
  },
  {
    "cmc": 1,
    "MultiverseID": 435352,
    "Colors": [ "Green" ],
    "SubTypes": [ "Merfolk", "Shaman" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Kumena's Speaker gets only +1/+1 from its ability, no matter how many Merfolk and Islands you control."
      },
      {
        "Date": "2017-09-29",
        "Text": "Most nonbasic lands that produce blue mana aren't Islands. For example, Glacial Fortress isn't an Island. Some nonbasic lands (such as Irrigated Farmland from the Amonkhet set) do have basic land types printed on the type line and may be Islands."
      },
      {
        "Date": "2017-09-29",
        "Text": "Because damage remains marked on a creature until it's removed as the turn ends, the damage Kumena's Speaker takes during combat may become lethal if you no longer control a Merfolk or Island later in the turn."
      }
    ],
    "Text": "Kumena's Speaker gets +1/+1 as long as you control another Merfolk or an Island.",
    "Rarity": "Uncommon",
    "Artist": "Johann Bodin",
    "Flavor": "\"The same power that drives the river ever onward flows through the roots and branches—to me.\"",
    "SetCode": "XLN",
    "Name": "Kumena's Speaker",
    "Manacost": "{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Merfolk Shaman",
    "Power": "1",
    "CardNumber": "196"
  },
  {
    "Toughness": "2",
    "Rarity": "Common",
    "Artist": "Sidharth Chaturvedi",
    "Flavor": "The Legion of Dusk sailed from Torrezon in search of glory, riches, and the Immortal Sun.",
    "cmc": 3,
    "MultiverseID": 435171,
    "SetCode": "XLN",
    "Name": "Legion Conquistador",
    "Power": "2",
    "Colors": [ "White" ],
    "Manacost": "{{2}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "20",
    "Type": "Creature — Vampire Soldier",
    "SubTypes": [ "Vampire", "Soldier" ],
    "Text": "When Legion Conquistador enters the battlefield, you may search your library for any number of cards named Legion Conquistador, reveal them, put them into your hand, then shuffle your library."
  },
  {
    "Rarity": "Common",
    "Artist": "Lucas Graciano",
    "Flavor": "\"My lance was once wielded by Venerable Tarrian. In his name and by his might, I cast you down!\"",
    "cmc": 3,
    "MultiverseID": 435172,
    "SetCode": "XLN",
    "Name": "Legion's Judgment",
    "Colors": [ "White" ],
    "Manacost": "{{2}}{{W}}",
    "Types": [ "Sorcery" ],
    "Type": "Sorcery",
    "CardNumber": "21",
    "Text": "Destroy target creature with power 4 or greater."
  },
  {
    "Names": [ "Legion's Landing", "Adanto, the First Fort" ],
    "SuperTypes": [ "Legendary" ],
    "Artist": "Svetlin Velinov",
    "Flavor": "\"I claim this land in the name of the queen.\"<br/>\n—Adrian Adanto of Lujio",
    "cmc": 1,
    "MultiverseID": 435173,
    "SetCode": "XLN",
    "Name": "Legion's Landing",
    "Rarity": "Rare",
    "Colors": [ "White" ],
    "Manacost": "{{W}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "22a",
    "Type": "Legendary Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once you've attacked with three or more creatures, Legion's Landing will transform even if some of those creatures leave the battlefield or are removed from combat."
      },
      {
        "Date": "2017-09-29",
        "Text": "The last ability of Legion's Landing only counts creatures that you declare as attacking creatures. Creatures that enter the battlefield attacking won't count."
      },
      {
        "Date": "2017-09-29",
        "Text": "For more information on double-faced cards, see the Ixalan mechanics article (http://magic.wizards.com/en/articles/archive/feature/ixalan-mechanics)."
      }
    ],
    "Text": "When Legion's Landing enters the battlefield, create a 1/1 white Vampire creature token with lifelink.<br/>\nWhen you attack with three or more creatures, transform Legion's Landing."
  },
  {
    "Rarity": "Common",
    "Artist": "Adam Paquette",
    "Flavor": "To wield lightning is to tame chaos.",
    "cmc": 2,
    "MultiverseID": 383299,
    "SetCode": "XLN",
    "Name": "Lightning Strike",
    "Colors": [ "Red" ],
    "Manacost": "{{1}}{{R}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "155",
    "Text": "Lightning Strike deals 3 damage to target creature or player."
  },
  {
    "cmc": 3,
    "MultiverseID": 435304,
    "Colors": [ "Red" ],
    "SubTypes": [ "Goblin", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Lightning-Rig Crew's second ability resolves before the spell that caused it to trigger. The ability will resolve even if that spell is countered."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a Two-Headed Giant game, Lightning-Rig Crew's activated ability causes the opposing team to lose 2 life."
      }
    ],
    "Text": "{{Tap}}: Lightning-Rig Crew deals 1 damage to each opponent.<br/>\nWhenever you cast a Pirate spell, untap Lightning-Rig Crew.",
    "Rarity": "Uncommon",
    "Artist": "Filip Burburan",
    "Flavor": "A pirate ship in battle is a storm of activity.",
    "SetCode": "XLN",
    "Name": "Lightning-Rig Crew",
    "Manacost": "{{2}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "5",
    "Type": "Creature — Goblin Pirate",
    "Power": "0",
    "CardNumber": "150"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Ryan Yee",
    "Flavor": "Her song plucks the strings of the storm, shifting wind and storm into a harmony that will carry her ship to safety.",
    "cmc": 3,
    "MultiverseID": 435214,
    "SetCode": "XLN",
    "Name": "Lookout's Dispersal",
    "Colors": [ "Blue" ],
    "Manacost": "{{2}}{{U}}",
    "Types": [ "Instant" ],
    "CardNumber": "62",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once you announce that you're casting Lookout's Dispersal, no player may take other actions until the spell's been paid for. Notably, players can't try to raise the spell's cost by removing your Pirates."
      }
    ],
    "Text": "Lookout's Dispersal costs {{1}} less to cast if you control a Pirate.<br/>\nCounter target spell unless its controller pays {{4}}."
  },
  {
    "Rarity": "Common",
    "Artist": "Lars Grant-West",
    "Flavor": "Nature can't be tamed, but the Sun Empire believes that humans are made stronger when they test themselves against the wild strength of the dinosaurs.",
    "cmc": 4,
    "MultiverseID": 435175,
    "SetCode": "XLN",
    "Name": "Looming Altisaur",
    "Toughness": "7",
    "Colors": [ "White" ],
    "Manacost": "{{3}}{{W}}",
    "Types": [ "Creature" ],
    "Power": "1",
    "Type": "Creature — Dinosaur",
    "CardNumber": "23",
    "SubTypes": [ "Dinosaur" ]
  },
  {
    "Names": [ "Dowsing Dagger", "Lost Vale" ],
    "Rarity": "Rare",
    "Artist": "Florian de Gesincourt",
    "Flavor": "The pirates had ventured into the interior for treasure. They found something far greater.",
    "cmc": 2,
    "MultiverseID": 435393,
    "SetCode": "XLN",
    "Name": "Lost Vale",
    "CardNumber": "235b",
    "Types": [ "Land" ],
    "Type": "Land",
    "Text": "(Transforms from Dowsing Dagger.)<br/>\n{{Tap}}: Add three mana of any one color to your mana pool."
  },
  {
    "cmc": 4,
    "MultiverseID": 435265,
    "Colors": [ "Black" ],
    "SubTypes": [ "Beast", "Horror" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You don't choose a target for Lurking Chupacabra's ability until after your creature has finished exploring."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. Effects that trigger when a creature you control explores, such as that of Lurking Chupacabra, trigger if appropriate."
      }
    ],
    "Text": "Whenever a creature you control explores, target creature an opponent controls gets -2/-2 until end of turn.",
    "Rarity": "Uncommon",
    "Artist": "YW Tang",
    "Flavor": "\"Shadow birthed it. The moon gave it eyes, and the jungle gave it teeth. But it was Death that taught it cruelty.\"<br/>\n—Huatli",
    "SetCode": "XLN",
    "Name": "Lurking Chupacabra",
    "Manacost": "{{3}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Beast Horror",
    "Power": "2",
    "CardNumber": "111"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Filip Burburan",
    "Flavor": "\"Grease up a firecannon good and proper with dinosaur-liver oil, and it'll shoot just about anything.\"",
    "cmc": 2,
    "MultiverseID": 435305,
    "SetCode": "XLN",
    "Name": "Makeshift Munitions",
    "Colors": [ "Red" ],
    "Manacost": "{{1}}{{R}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "151",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can't sacrifice the same Treasure to pay both {1} and \"sacrifice an artifact or creature.\""
      }
    ],
    "Text": "{{1}}, Sacrifice an artifact or creature: Makeshift Munitions deals 1 damage to target creature or player."
  },
  {
    "cmc": 4,
    "MultiverseID": 435381,
    "Colors": [ "Blue", "Red" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      },
      {
        "Date": "2017-09-29",
        "Text": "Some raid abilities trigger at the beginning of your end step. These abilities trigger if you attacked with a creature that turn, even if the card with that raid ability wasn't on the battlefield when you attacked."
      }
    ],
    "Text": "Raid — At the beginning of your end step, if you attacked with a creature this turn, you may draw a card. If you do, discard a card.",
    "Rarity": "Uncommon",
    "Artist": "Jason A. Engle",
    "Flavor": "\"I'll be taking that.\"",
    "SetCode": "XLN",
    "Name": "Marauding Looter",
    "Manacost": "{{2}}{{U}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Human Pirate",
    "Power": "4",
    "CardNumber": "225"
  },
  {
    "Rarity": "Common",
    "Artist": "Ben Wootten",
    "cmc": 1,
    "MultiverseID": 435266,
    "SetCode": "XLN",
    "Name": "March of the Drowned",
    "Colors": [ "Black" ],
    "Manacost": "{{B}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "112",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If an effect refers to a \"[subtype] spell\" or \"[subtype] card,\" it refers only to a spell or card that has that subtype. For example, March of the Drowned is a card that benefits Pirates and features Pirates in its illustration, but it isn't a Pirate card."
      }
    ],
    "Text": "Choose one —<br/>\n• Return target creature card from your graveyard to your hand.<br/>\n• Return two target Pirate cards from your graveyard to your hand."
  },
  {
    "Rarity": "Common",
    "Artist": "Winona Nelson",
    "Flavor": "\"My 'condition' is a trial. The weak are consumed by it. The strong transcend it.\"<br/>\n—Sorin Markov",
    "cmc": 4,
    "MultiverseID": 253723,
    "SetCode": "XLN",
    "Name": "Mark of the Vampire",
    "SubTypes": [ "Aura" ],
    "Colors": [ "Black" ],
    "Manacost": "{{3}}{{B}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "99",
    "Type": "Enchantment — Aura",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Multiple instances of lifelink on the same creature are redundant."
      }
    ],
    "Text": "Enchant creature<br/>\nEnchanted creature gets +2/+2 and has lifelink."
  },
  {
    "cmc": 3,
    "MultiverseID": 435176,
    "Colors": [ "White" ],
    "SubTypes": [ "Vampire", "Cleric" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once you attack with one or more nontoken Vampires, Mavren Fein's ability will create a Vampire token even if some or all of those Vampires leave the battlefield or are removed from combat."
      }
    ],
    "Text": "Whenever one or more nontoken Vampires you control attack, create a 1/1 white Vampire creature token with lifelink.",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Daarken",
    "Flavor": "In the rapture of his Blood Fast, he destroyed the navigator's tools and steered the ship to shore by faith alone.",
    "SetCode": "XLN",
    "Name": "Mavren Fein, Dusk Apostle",
    "Toughness": "2",
    "Manacost": "{{2}}{{W}}",
    "Types": [ "Creature" ],
    "Power": "2",
    "Type": "Legendary Creature — Vampire Cleric",
    "CardNumber": "24",
    "Rarity": "Rare"
  },
  {
    "SubTypes": [ "Merfolk", "Scout" ],
    "Rarity": "Uncommon",
    "Artist": "Kieran Yanner",
    "Toughness": "1",
    "cmc": 2,
    "MultiverseID": 435353,
    "SetCode": "XLN",
    "Name": "Merfolk Branchwalker",
    "Power": "2",
    "Colors": [ "Green" ],
    "Manacost": "{{1}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "197",
    "Type": "Creature — Merfolk Scout",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "When Merfolk Branchwalker enters the battlefield, it explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)"
  },
  {
    "SuperTypes": [ "Basic" ],
    "Artist": "John Avon",
    "cmc": 0,
    "MultiverseID": 129649,
    "SetCode": "XLN",
    "Name": "Mountain",
    "CardNumber": "376",
    "Types": [ "Land" ],
    "Watermark": "Red",
    "Type": "Basic Land — Mountain",
    "Rarity": "Basic Land",
    "SubTypes": [ "Mountain" ]
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Zoltan Boros",
    "Flavor": "\"You won't be needing this. Or this. Or these . . .\"",
    "cmc": 3,
    "MultiverseID": 435215,
    "SetCode": "XLN",
    "Name": "Navigator's Ruin",
    "Colors": [ "Blue" ],
    "Manacost": "{{2}}{{U}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "63",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      },
      {
        "Date": "2017-09-29",
        "Text": "Some raid abilities trigger at the beginning of your end step. These abilities trigger if you attacked with a creature that turn, even if the card with that raid ability wasn't on the battlefield when you attacked."
      }
    ],
    "Text": "Raid — At the beginning of your end step, if you attacked with a creature this turn, target opponent puts the top four cards of his or her library into his or her graveyard."
  },
  {
    "Toughness": "1",
    "Rarity": "Common",
    "Artist": "Jonathan Kuo",
    "Flavor": "\"These sailors on our shores are like the dinosaurs that plunder eggs from nests. They live on the labors of others.\"<br/>\n—Itzama the Crested",
    "cmc": 2,
    "MultiverseID": 435306,
    "SetCode": "XLN",
    "Name": "Nest Robber",
    "Power": "2",
    "Colors": [ "Red" ],
    "Manacost": "{{1}}{{R}}",
    "Types": [ "Creature" ],
    "CardNumber": "152",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Haste"
  },
  {
    "Rarity": "Common",
    "Artist": "Noah Bradley",
    "cmc": 3,
    "MultiverseID": 435354,
    "SetCode": "XLN",
    "Name": "New Horizons",
    "SubTypes": [ "Aura" ],
    "Colors": [ "Green" ],
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "198",
    "Type": "Enchantment — Aura",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can cast New Horizons even if you control no creatures."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the land this Aura would enchant is an illegal target by the time New Horizons resolves, the entire spell is countered. It won't enter the battlefield, so its ability won't trigger."
      }
    ],
    "Text": "Enchant land<br/>\nWhen New Horizons enters the battlefield, put a +1/+1 counter on target creature you control.<br/>\nEnchanted land has \"{{Tap}}: Add two mana of any one color to your mana pool.\""
  },
  {
    "Toughness": "3",
    "Rarity": "Rare",
    "Artist": "Yongjae Choi",
    "Flavor": "\"The jungle was here before any city. It will be here after the last city falls.\"",
    "cmc": 1,
    "MultiverseID": 435355,
    "SetCode": "XLN",
    "Name": "Old-Growth Dryads",
    "Power": "3",
    "Colors": [ "Green" ],
    "Manacost": "{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "199",
    "Type": "Creature — Dryad",
    "SubTypes": [ "Dryad" ],
    "Text": "When Old-Growth Dryads enters the battlefield, each opponent may search his or her library for a basic land card, put it onto the battlefield tapped, then shuffle his or her library."
  },
  {
    "Rarity": "Common",
    "Artist": "Naomi Baker",
    "Flavor": "\"River and sea, jungle and sky. Water flows freely between the two halves of the world. We are creatures of the water.\"<br/>\n—Shaper Tuvasa",
    "cmc": 2,
    "MultiverseID": 435216,
    "SetCode": "XLN",
    "Name": "One With the Wind",
    "Colors": [ "Blue" ],
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "64",
    "Type": "Enchantment — Aura",
    "SubTypes": [ "Aura" ],
    "Text": "Enchant creature<br/>\nEnchanted creature gets +2/+2 and has flying."
  },
  {
    "Rarity": "Common",
    "Artist": "John Howe",
    "Flavor": "\"We need alternatives, Hanna,\" yelled Gerrard. \"Now\"",
    "cmc": 1,
    "MultiverseID": 22988,
    "SetCode": "XLN",
    "Name": "Opt",
    "Colors": [ "Blue" ],
    "Manacost": "{{U}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "64",
    "Text": "Scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)<br/>\nDraw a card."
  },
  {
    "cmc": 2,
    "MultiverseID": 435307,
    "Colors": [ "Red" ],
    "SubTypes": [ "Human", "Shaman" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "To determine the total cost of a Dinosaur spell, start with the mana cost or alternative cost you're paying, add any cost increases, then apply any cost reductions. The converted mana cost of the creature remains unchanged, no matter what the total cost to cast it was."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect refers to a \"[subtype] spell\" or \"[subtype] card,\" it refers only to a spell or card that has that subtype. For example, March of the Drowned is a card that benefits Pirates and features Pirates in its illustration, but it isn't a Pirate card."
      }
    ],
    "Text": "Dinosaur spells you cast cost {{1}} less to cast.<br/>\n{{Tap}}: Target Dinosaur gains haste until end of turn.",
    "Rarity": "Uncommon",
    "Artist": "Daarken",
    "Flavor": "\"Forward! Let the Burning Sun's light guide you to deserving prey!\"",
    "SetCode": "XLN",
    "Name": "Otepec Huntmaster",
    "Manacost": "{{1}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Human Shaman",
    "Power": "1",
    "CardNumber": "153"
  },
  {
    "Rarity": "Mythic Rare",
    "Artist": "Lucas Graciano",
    "Flavor": "The truth came to Kumena like the Great River's torrent: the only way to keep his enemies away from the hidden city was to claim its power for himself.",
    "cmc": 7,
    "MultiverseID": 435218,
    "SetCode": "XLN",
    "Name": "Overflowing Insight",
    "Colors": [ "Blue" ],
    "Manacost": "{{4}}{{U}}{{U}}{{U}}",
    "Types": [ "Sorcery" ],
    "Type": "Sorcery",
    "CardNumber": "66",
    "Text": "Target player draws seven cards."
  },
  {
    "Toughness": "2",
    "Rarity": "Common",
    "Artist": "Bastien L. Deharme",
    "Flavor": "Closely linked to the Church of Dusk, the paladins of the Bloodstained order are devout to the point of fanaticism.",
    "cmc": 4,
    "MultiverseID": 435177,
    "SetCode": "XLN",
    "Name": "Paladin of the Bloodstained",
    "Power": "3",
    "Colors": [ "White" ],
    "Manacost": "{{3}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "25",
    "Type": "Creature — Vampire Knight",
    "SubTypes": [ "Vampire", "Knight" ],
    "Text": "When Paladin of the Bloodstained enters the battlefield, create a 1/1 white Vampire creature token with lifelink."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Wesley Burt",
    "Flavor": "For the first time in her life, Vraska tried to prevent death.",
    "cmc": 2,
    "MultiverseID": 435219,
    "SetCode": "XLN",
    "Name": "Perilous Voyage",
    "Colors": [ "Blue" ],
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Instant" ],
    "CardNumber": "67",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the target permanent is an illegal target by the time Perilous Voyage resolves, the entire spell is countered. You won't scry."
      },
      {
        "Date": "2017-09-29",
        "Text": "Use the permanent's converted mana cost as it existed on the battlefield to determine whether you scry."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a permanent has {X} in its mana cost, X is considered to be 0."
      },
      {
        "Date": "2017-09-29",
        "Text": "There are many important moments in the story, but the most crucial—called \"story spotlights\"—are shown on cards. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."
      }
    ],
    "Text": "Return target nonland permanent you don't control to its owner's hand. If its converted mana cost was 2 or less, scry 2."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Dimitar",
    "cmc": 2,
    "MultiverseID": 435399,
    "SetCode": "XLN",
    "Name": "Pillar of Origins",
    "Manacost": "{{2}}",
    "Types": [ "Artifact" ],
    "CardNumber": "241",
    "Type": "Artifact",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "To choose a creature type, you must choose an existing creature type, such as Vampire or Knight. You can't choose multiple creature types, such as \"Vampire Knight.\" Card types such as artifact can't be chosen, nor can subtypes that aren't creature types, such as Jace, Vehicle, or Treasure."
      }
    ],
    "Text": "As Pillar of Origins enters the battlefield, choose a creature type.<br/>\n{{Tap}}: Add one mana of any color to your mana pool. Spend this mana only to cast a creature spell of the chosen type."
  },
  {
    "Rarity": "Common",
    "Artist": "Lake Hurwitz",
    "Flavor": "\"Ours is the true and righteous path. You will bow before our might.\"",
    "cmc": 4,
    "MultiverseID": 435178,
    "SetCode": "XLN",
    "Name": "Pious Interdiction",
    "SubTypes": [ "Aura" ],
    "Colors": [ "White" ],
    "Manacost": "{{3}}{{W}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "26",
    "Type": "Enchantment — Aura",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the creature this Aura would enchant is an illegal target by the time Pious Interdiction resolves, the entire spell is countered. It won't enter the battlefield, so its ability won't trigger."
      }
    ],
    "Text": "Enchant creature<br/>\nWhen Pious Interdiction enters the battlefield, you gain 2 life.<br/>\nEnchanted creature can't attack or block."
  },
  {
    "Rarity": "Common",
    "Artist": "John Stanko",
    "cmc": 3,
    "MultiverseID": 435400,
    "SetCode": "XLN",
    "Name": "Pirate's Cutlass",
    "SubTypes": [ "Equipment" ],
    "Manacost": "{{3}}",
    "Types": [ "Artifact" ],
    "CardNumber": "242",
    "Type": "Artifact — Equipment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can cast Pirate's Cutlass even if you control no Pirates."
      }
    ],
    "Text": "When Pirate's Cutlass enters the battlefield, attach it to target Pirate you control.<br/>\nEquipped creature gets +2/+1.<br/>\nEquip {{2}} ({{2}}: Attach to target creature you control. Equip only as a sorcery.)"
  },
  {
    "Rarity": "Common",
    "Artist": "Deruchenko Alexander",
    "Flavor": "Nothing warms the heart like plunder.",
    "cmc": 4,
    "MultiverseID": 435220,
    "SetCode": "XLN",
    "Name": "Pirate's Prize",
    "Colors": [ "Blue" ],
    "Manacost": "{{3}}{{U}}",
    "Types": [ "Sorcery" ],
    "Type": "Sorcery",
    "CardNumber": "68",
    "Text": "Draw two cards. Create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "SuperTypes": [ "Basic" ],
    "Artist": "Rob Alexander",
    "cmc": 0,
    "MultiverseID": 129680,
    "SetCode": "XLN",
    "Name": "Plains",
    "CardNumber": "364",
    "Types": [ "Land" ],
    "Watermark": "White",
    "Type": "Basic Land — Plains",
    "Rarity": "Basic Land",
    "SubTypes": [ "Plains" ]
  },
  {
    "Rarity": "Common",
    "Artist": "Lucas Graciano",
    "Flavor": "The drive to hunt and feed is raw instinct for dinosaurs. The trick is simply to channel it in the right direction.",
    "cmc": 2,
    "MultiverseID": 435356,
    "SetCode": "XLN",
    "Name": "Pounce",
    "Colors": [ "Green" ],
    "Manacost": "{{1}}{{G}}",
    "Types": [ "Instant" ],
    "CardNumber": "200",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If either or both targets are illegal when Pounce tries to resolve, no creature will deal or be dealt damage."
      }
    ],
    "Text": "Target creature you control fights target creature you don't control. (Each deals damage equal to its power to the other.)"
  },
  {
    "SubTypes": [ "Human", "Cleric" ],
    "Rarity": "Rare",
    "Artist": "Bastien L. Deharme",
    "Toughness": "1",
    "cmc": 1,
    "MultiverseID": 435179,
    "SetCode": "XLN",
    "Name": "Priest of the Wakening Sun",
    "Power": "1",
    "Colors": [ "White" ],
    "Manacost": "{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "27",
    "Type": "Creature — Human Cleric",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You don't choose whether to reveal a Dinosaur card from your hand until the triggered ability of Priest of the Wakening Sun resolves. You may respond to the triggered ability by taking an action to get a Dinosaur card into your hand, such as activating its second ability."
      },
      {
        "Date": "2017-09-29",
        "Text": "While resolving Priest of the Wakening Sun's triggered ability, you can't reveal multiple Dinosaur cards to gain more life."
      },
      {
        "Date": "2017-09-29",
        "Text": "You can reveal the same Dinosaur card for multiple Priests of the Wakening Sun or for the same one over multiple turns."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect refers to a \"[subtype] spell\" or \"[subtype] card,\" it refers only to a spell or card that has that subtype. For example, March of the Drowned is a card that benefits Pirates and features Pirates in its illustration, but it isn't a Pirate card."
      }
    ],
    "Text": "At the beginning of your upkeep, you may reveal a Dinosaur card from your hand. If you do, you gain 2 life.<br/>\n{{3}}{{W}}{{W}}, Sacrifice Priest of the Wakening Sun: Search your library for a Dinosaur card, reveal it, put it into your hand, then shuffle your library."
  },
  {
    "Names": [ "Primal Amulet", "Primal Wellspring" ],
    "Rarity": "Rare",
    "Artist": "John Avon",
    "cmc": 4,
    "MultiverseID": 435401,
    "SetCode": "XLN",
    "Name": "Primal Amulet",
    "Manacost": "{{4}}",
    "Types": [ "Artifact" ],
    "CardNumber": "243a",
    "Type": "Artifact",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "To determine the total cost of a spell, start with the mana cost or alternative cost you're paying, add any cost increases, then apply any cost reductions. The converted mana cost of the spell remains unchanged, no matter what the total cost to cast it was."
      },
      {
        "Date": "2017-09-29",
        "Text": "Effects that reduce the generic mana cost of a spell can't reduce that spell's colored mana requirements."
      },
      {
        "Date": "2017-09-29",
        "Text": "Primal Amulet's last ability triggers once you've completed casting a spell. Notably, you can't use Primal Wellspring to pay for the spell that gives Primal Amulet its fourth counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a fourth charge counter is put on Primal Amulet by something other than the resolution of its ability (as modified by any applicable replacement effects), you won't be able to remove those counters and transform it yet. You'll have to wait until you cast an instant or sorcery spell again."
      },
      {
        "Date": "2017-09-29",
        "Text": "For more information on double-faced cards, see the Ixalan mechanics article (http://magic.wizards.com/en/articles/archive/feature/ixalan-mechanics)."
      }
    ],
    "Text": "Instant and sorcery spells you cast cost {{1}} less to cast.<br/>\nWhenever you cast an instant or sorcery spell, put a charge counter on Primal Amulet. Then if there are four or more charge counters on it, you may remove those counters and transform it."
  },
  {
    "Names": [ "Primal Amulet", "Primal Wellspring" ],
    "Rarity": "Rare",
    "Artist": "John Avon",
    "cmc": 4,
    "MultiverseID": 435402,
    "SetCode": "XLN",
    "Name": "Primal Wellspring",
    "CardNumber": "243b",
    "Types": [ "Land" ],
    "Type": "Land",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The mana produced by Primal Wellspring can be spent on anything, not just an instant or sorcery spell."
      },
      {
        "Date": "2017-09-29",
        "Text": "Any instant or sorcery spell you spend the mana on will be copied, not just one that requires targets."
      },
      {
        "Date": "2017-09-29",
        "Text": "The delayed triggered ability from Primal Wellspring's mana ability will trigger even if Primal Wellspring leaves the battlefield before that mana is spent."
      },
      {
        "Date": "2017-09-29",
        "Text": "If more than one mana produced by a Primal Wellspring is spent to cast a single instant or sorcery spell, the delayed triggered ability associated with each mana spent will trigger. That many copies will be created. It doesn't matter if this mana was produced by one Primal Wellspring or by multiple Primal Wellsprings."
      },
      {
        "Date": "2017-09-29",
        "Text": "Primal Wellspring's delayed triggered ability can copy the spell even if that spell is countered before the ability resolves."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a copy is created, you control the copy. That copy is created on the stack, so it's not \"cast.\" Abilities that trigger when a player casts a spell won't trigger. The copy will then resolve like a normal spell, after players get a chance to cast spells and activate abilities."
      },
      {
        "Date": "2017-09-29",
        "Text": "The copy will have the same targets as the spell it's copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can't choose a new legal target, then it remains unchanged (even if the current target is illegal)."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the copied spell is modal (that is, it says \"Choose one —\" or the like), the copy will have the same mode. You can't choose a different one."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the copied spell has an X whose value was determined as it was cast, the copy has the same value of X."
      },
      {
        "Date": "2017-09-29",
        "Text": "You can't choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too. For example, if you sacrifice a 3/3 creature to cast Fling, and you copy it, the copy of Fling will also deal 3 damage to its target."
      }
    ],
    "Text": "(Transforms from Primal Amulet.)<br/>\n{{Tap}}: Add one mana of any color to your mana pool. When that mana is spent to cast an instant or sorcery spell, copy that spell and you may choose new targets for the copy."
  },
  {
    "Toughness": "4",
    "Rarity": "Common",
    "Artist": "Josh Hass",
    "Flavor": "The floating city of High and Dry hasn't yet sunk under the weight of gold, but it's not for want of trying.",
    "cmc": 5,
    "MultiverseID": 435221,
    "SetCode": "XLN",
    "Name": "Prosperous Pirates",
    "Power": "3",
    "Colors": [ "Blue" ],
    "Manacost": "{{4}}{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "69",
    "Type": "Creature — Human Pirate",
    "SubTypes": [ "Human", "Pirate" ],
    "Text": "When Prosperous Pirates enters the battlefield, create two colorless Treasure artifact tokens with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "Rarity": "Common",
    "Artist": "Aaron Miller",
    "cmc": 1,
    "MultiverseID": 435403,
    "SetCode": "XLN",
    "Name": "Prying Blade",
    "Manacost": "{{1}}",
    "Types": [ "Artifact" ],
    "CardNumber": "244",
    "Type": "Artifact — Equipment",
    "SubTypes": [ "Equipment" ],
    "Text": "Equipped creature gets +1/+0.<br/>\nWhenever equipped creature deals combat damage to a player, create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\"<br/>\nEquip {{2}} ({{2}}: Attach to target creature you control. Equip only as a sorcery.)"
  },
  {
    "Toughness": "3",
    "Rarity": "Common",
    "Artist": "Anthony Palumbo",
    "Flavor": "\"To rise like the sun—there is no greater feeling.\"",
    "cmc": 4,
    "MultiverseID": 435180,
    "SetCode": "XLN",
    "Name": "Pterodon Knight",
    "Power": "3",
    "Colors": [ "White" ],
    "Manacost": "{{3}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "28",
    "Type": "Creature — Human Knight",
    "SubTypes": [ "Human", "Knight" ],
    "Text": "Pterodon Knight has flying as long as you control a Dinosaur."
  },
  {
    "SubTypes": [ "Vampire", "Scout" ],
    "Rarity": "Common",
    "Artist": "Winona Nelson",
    "Toughness": "3",
    "cmc": 6,
    "MultiverseID": 435268,
    "SetCode": "XLN",
    "Name": "Queen's Agent",
    "Power": "3",
    "Colors": [ "Black" ],
    "Manacost": "{{5}}{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "114",
    "Type": "Creature — Vampire Scout",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "Lifelink<br/>\nWhen Queen's Agent enters the battlefield, it explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)"
  },
  {
    "Rarity": "Common",
    "Artist": "Jesper Ejsing",
    "Flavor": "The soldiers of the Legion of Dusk have come to the colonies at Queen's Bay in search of glory and riches. They are veterans of centuries of warfare, and they thirst for conquest.",
    "cmc": 2,
    "MultiverseID": 435269,
    "SetCode": "XLN",
    "Name": "Queen's Bay Soldier",
    "Toughness": "2",
    "Colors": [ "Black" ],
    "Manacost": "{{1}}{{B}}",
    "Types": [ "Creature" ],
    "Power": "2",
    "Type": "Creature — Vampire Soldier",
    "CardNumber": "115",
    "SubTypes": [ "Vampire", "Soldier" ]
  },
  {
    "Rarity": "Common",
    "Artist": "Mark Behm",
    "Flavor": "\"Let the blood of the impure flow through you. Only the blessings of the golden city will purge its acrid taste from your mouth.\"<br/>\n—High Marshal Arguel",
    "cmc": 3,
    "MultiverseID": 435181,
    "SetCode": "XLN",
    "Name": "Queen's Commission",
    "Colors": [ "White" ],
    "Manacost": "{{2}}{{W}}",
    "Types": [ "Sorcery" ],
    "Type": "Sorcery",
    "CardNumber": "29",
    "Text": "Create two 1/1 white Vampire creature tokens with lifelink."
  },
  {
    "Toughness": "5",
    "Rarity": "Uncommon",
    "Artist": "Izzy",
    "Flavor": "Carnivorous dinosaurs developed a taste for undead flesh, tracking the vampires by the scent of blood on their breath.",
    "cmc": 5,
    "MultiverseID": 435382,
    "SetCode": "XLN",
    "Name": "Raging Swordtooth",
    "Power": "5",
    "Colors": [ "Red", "Green" ],
    "Manacost": "{{3}}{{R}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "226",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Trample<br/>\nWhen Raging Swordtooth enters the battlefield, it deals 1 damage to each other creature."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Zack Stella",
    "Flavor": "One was spared to tell the gruesome tale.",
    "cmc": 4,
    "MultiverseID": 435270,
    "SetCode": "XLN",
    "Name": "Raiders' Wake",
    "Colors": [ "Black" ],
    "Manacost": "{{3}}{{B}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "116",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      },
      {
        "Date": "2017-09-29",
        "Text": "Some raid abilities trigger at the beginning of your end step. These abilities trigger if you attacked with a creature that turn, even if the card with that raid ability wasn't on the battlefield when you attacked."
      }
    ],
    "Text": "Whenever an opponent discards a card, that player loses 2 life.<br/>\nRaid — At the beginning of your end step, if you attacked with a creature this turn, target opponent discards a card."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "John Stanko",
    "Flavor": "\"The sun's strength sings in our hearts! I have never been more proud of my home and my people.\"<br/>\n—Huatli",
    "cmc": 3,
    "MultiverseID": 435182,
    "SetCode": "XLN",
    "Name": "Rallying Roar",
    "Colors": [ "White" ],
    "Manacost": "{{2}}{{W}}",
    "Types": [ "Instant" ],
    "CardNumber": "30",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Rallying Roar affects only creatures you control at the time it resolves. Creatures you begin to control later in the turn won't get +1/+1."
      },
      {
        "Date": "2017-09-29",
        "Text": "Untapped creatures you control get +1/+1 even though Rallying Roar doesn't untap them."
      }
    ],
    "Text": "Creatures you control get +1/+1 until end of turn. Untap them."
  },
  {
    "cmc": 3,
    "MultiverseID": 435308,
    "Colors": [ "Red" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Spells and abilities that cause players to gain life still resolve while Rampaging Ferocidon is on the battlefield. No player will gain life, but any other effects of that spell or ability will happen."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect says to set a player's life total to a number that's higher than the player's current life total while Rampaging Ferocidon is on the battlefield, the player's life total doesn't change."
      },
      {
        "Date": "2017-09-29",
        "Text": "Rampaging Ferocidon's last ability triggers whenever any player has a creature enter the battlefield, including you."
      },
      {
        "Date": "2017-09-29",
        "Text": "If another creature enters the battlefield at the same time as Rampaging Ferocidon, its last ability triggers."
      }
    ],
    "Text": "Menace<br/>\nPlayers can't gain life.<br/>\nWhenever another creature enters the battlefield, Rampaging Ferocidon deals 1 damage to that creature's controller.",
    "Rarity": "Rare",
    "Artist": "Jonathan Kuo",
    "Flavor": "All raptors are aggressive, but ferocidons seem to enjoy their prey's pain.",
    "SetCode": "XLN",
    "Name": "Rampaging Ferocidon",
    "Manacost": "{{2}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Dinosaur",
    "Power": "3",
    "CardNumber": "154"
  },
  {
    "cmc": 3,
    "MultiverseID": 435357,
    "Colors": [ "Green" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If multiple sources deal damage to a creature with an enrage ability at the same time, most likely because multiple creatures blocked that creature, the enrage ability triggers only once."
      },
      {
        "Date": "2017-09-29",
        "Text": "If lethal damage is dealt to a creature with an enrage ability, that ability triggers. The creature with that enrage ability leaves the battlefield before that ability resolves, so it won't be affected by the resolving ability."
      }
    ],
    "Text": "Enrage — Whenever Ranging Raptors is dealt damage, you may search your library for a basic land card, put it onto the battlefield tapped, then shuffle your library.",
    "Rarity": "Uncommon",
    "Artist": "Simon Dominic",
    "Flavor": "They cover their territory like a tide of teeth and claws.",
    "SetCode": "XLN",
    "Name": "Ranging Raptors",
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Dinosaur",
    "Power": "2",
    "CardNumber": "201"
  },
  {
    "Rarity": "Common",
    "Artist": "Slawomir Maniak",
    "Flavor": "A raptor will follow any order as long as that order is \"hunt,\" \"kill,\" or \"go for the guts.\"",
    "cmc": 2,
    "MultiverseID": 435183,
    "SetCode": "XLN",
    "Name": "Raptor Companion",
    "Toughness": "1",
    "Colors": [ "White" ],
    "Manacost": "{{1}}{{W}}",
    "Types": [ "Creature" ],
    "Power": "3",
    "Type": "Creature — Dinosaur",
    "CardNumber": "31",
    "SubTypes": [ "Dinosaur" ]
  },
  {
    "cmc": 2,
    "MultiverseID": 435309,
    "Colors": [ "Red" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If multiple sources deal damage to a creature with an enrage ability at the same time, most likely because multiple creatures blocked that creature, the enrage ability triggers only once."
      },
      {
        "Date": "2017-09-29",
        "Text": "If lethal damage is dealt to a creature with an enrage ability, that ability triggers. The creature with that enrage ability leaves the battlefield before that ability resolves, so it won't be affected by the resolving ability."
      }
    ],
    "Text": "Enrage — Whenever Raptor Hatchling is dealt damage, create a 3/3 green Dinosaur creature token with trample.",
    "Rarity": "Uncommon",
    "Artist": "Even Amundsen",
    "Flavor": "\"Every little hatchling has a parent's claws to guard it.\"<br/>\n—Sun Empire saying",
    "SetCode": "XLN",
    "Name": "Raptor Hatchling",
    "Manacost": "{{1}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Dinosaur",
    "Power": "1",
    "CardNumber": "155"
  },
  {
    "cmc": 3,
    "MultiverseID": 435358,
    "Colors": [ "Green" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If your life total is brought to 0 or less at the same time that Ravenous Daggertooth is dealt damage, you lose the game before its enrage ability resolves."
      },
      {
        "Date": "2017-09-29",
        "Text": "If multiple sources deal damage to a creature with an enrage ability at the same time, most likely because multiple creatures blocked that creature, the enrage ability triggers only once."
      },
      {
        "Date": "2017-09-29",
        "Text": "If lethal damage is dealt to a creature with an enrage ability, that ability triggers. The creature with that enrage ability leaves the battlefield before that ability resolves, so it won't be affected by the resolving ability."
      }
    ],
    "Text": "Enrage — Whenever Ravenous Daggertooth is dealt damage, you gain 2 life.",
    "Rarity": "Common",
    "Artist": "Jakub Kasper",
    "Flavor": "A daggertooth's triumphant roar makes all the sounds of jungle life fall silent.",
    "SetCode": "XLN",
    "Name": "Ravenous Daggertooth",
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Dinosaur",
    "Power": "3",
    "CardNumber": "202"
  },
  {
    "Toughness": "4",
    "Rarity": "Rare",
    "Artist": "Jonathan Kuo",
    "Flavor": "\"Seeing a pack of these monsters hunt together, I'm at a loss to imagine the size of their prey.\"<br/>\n—Adrian Adanto of Lujio",
    "cmc": 5,
    "MultiverseID": 435383,
    "SetCode": "XLN",
    "Name": "Regisaur Alpha",
    "Power": "4",
    "Colors": [ "Red", "Green" ],
    "Manacost": "{{3}}{{R}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "227",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Other Dinosaurs you control have haste.<br/>\nWhen Regisaur Alpha enters the battlefield, create a 3/3 green Dinosaur creature token with trample."
  },
  {
    "Rarity": "Rare",
    "Artist": "Dan Scott",
    "cmc": 3,
    "MultiverseID": 435310,
    "SetCode": "XLN",
    "Name": "Repeating Barrage",
    "Colors": [ "Red" ],
    "Manacost": "{{1}}{{R}}{{R}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "156",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      }
    ],
    "Text": "Repeating Barrage deals 3 damage to target creature or player.<br/>\nRaid — {{3}}{{R}}{{R}}: Return Repeating Barrage from your graveyard to your hand. Activate this ability only if you attacked with a creature this turn."
  },
  {
    "Rarity": "Rare",
    "Artist": "Eric Deschamps",
    "cmc": 5,
    "MultiverseID": 435271,
    "SetCode": "XLN",
    "Name": "Revel in Riches",
    "Colors": [ "Black" ],
    "Manacost": "{{4}}{{B}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "117",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If you don't control ten Treasures as your upkeep begins, the second ability of Revel in Riches won't trigger. You can't take any actions during your turn before your upkeep begins."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you don't control ten Treasures as the second ability of Revel in Riches resolves, you won't win the game."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an opponent's creature dies at the same time that Revel in Riches is destroyed, you'll get a Treasure."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the second ability of Revel in Riches causes you to win the game, please refrain from throwing your Treasure tokens into the air as this may distract or injure other players."
      }
    ],
    "Text": "Whenever a creature an opponent controls dies, create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\"<br/>\nAt the beginning of your upkeep, if you control ten or more Treasures, you win the game."
  },
  {
    "cmc": 1,
    "MultiverseID": 435311,
    "Colors": [ "Red" ],
    "SubTypes": [ "Goblin", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      }
    ],
    "Text": "First strike<br/>\nRaid — Rigging Runner enters the battlefield with a +1/+1 counter on it if you attacked with a creature this turn.",
    "Rarity": "Uncommon",
    "Artist": "Simon Dominic",
    "Flavor": "The hook makes him feel brave, and the hat makes him feel fancy.",
    "SetCode": "XLN",
    "Name": "Rigging Runner",
    "Manacost": "{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Goblin Pirate",
    "Power": "1",
    "CardNumber": "157"
  },
  {
    "Rarity": "Common",
    "Artist": "Igor Kieryluk",
    "Flavor": "The enormous can still be at the mercy of the small.",
    "cmc": 1,
    "MultiverseID": 435312,
    "SetCode": "XLN",
    "Name": "Rile",
    "Colors": [ "Red" ],
    "Manacost": "{{R}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "158",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If Rile targets a creature with 1 toughness, that creature won't be destroyed until after you've drawn a card. Its abilities may affect that draw or trigger on that draw if appropriate."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the damage that would be dealt by Rile is prevented, the creature still gains trample until end of turn."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the target creature is an illegal target by the time Rile resolves, the entire spell is countered. You won't draw a card."
      }
    ],
    "Text": "Rile deals 1 damage to target creature you control. That creature gains trample until end of turn.<br/>\nDraw a card."
  },
  {
    "cmc": 4,
    "MultiverseID": 435359,
    "Colors": [ "Green" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If multiple sources deal damage to a creature with an enrage ability at the same time, most likely because multiple creatures blocked that creature, the enrage ability triggers only once."
      },
      {
        "Date": "2017-09-29",
        "Text": "If lethal damage is dealt to a creature with an enrage ability, that ability triggers. The creature with that enrage ability leaves the battlefield before that ability resolves, so it won't be affected by the resolving ability."
      }
    ],
    "Text": "Enrage — Whenever Ripjaw Raptor is dealt damage, draw a card.",
    "Rarity": "Rare",
    "Artist": "Ryan Pancoast",
    "Flavor": "Raptors are clever enough to tear away a hard metal shell to get at the tasty morsel inside.",
    "SetCode": "XLN",
    "Name": "Ripjaw Raptor",
    "Manacost": "{{2}}{{G}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "5",
    "Type": "Creature — Dinosaur",
    "Power": "4",
    "CardNumber": "203"
  },
  {
    "Rarity": "Common",
    "Artist": "Bastien L. Deharme",
    "Flavor": "\"Nothing is more sacred than the gift of blood. Blessed are the vein that empties and the heart that is renewed.\"",
    "cmc": 3,
    "MultiverseID": 435184,
    "SetCode": "XLN",
    "Name": "Ritual of Rejuvenation",
    "Colors": [ "White" ],
    "Manacost": "{{2}}{{W}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "32",
    "Text": "You gain 4 life.<br/>\nDraw a card."
  },
  {
    "Rarity": "Common",
    "Artist": "Alex Konstad",
    "Flavor": "\"We are kin to the trees, and their strength is our own.\"",
    "cmc": 2,
    "MultiverseID": 435360,
    "SetCode": "XLN",
    "Name": "River Heralds' Boon",
    "Colors": [ "Green" ],
    "Manacost": "{{1}}{{G}}",
    "Types": [ "Instant" ],
    "CardNumber": "204",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can choose one Merfolk creature as both targets for River Heralds' Boon. You can also choose two different Merfolk creatures."
      }
    ],
    "Text": "Put a +1/+1 counter on target creature and a +1/+1 counter on up to one target Merfolk."
  },
  {
    "Toughness": "1",
    "Rarity": "Uncommon",
    "Artist": "Slawomir Maniak",
    "Flavor": "No ripples, no splashes, no warning.",
    "cmc": 2,
    "MultiverseID": 435222,
    "SetCode": "XLN",
    "Name": "River Sneak",
    "Power": "1",
    "Colors": [ "Blue" ],
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "70",
    "Type": "Creature — Merfolk Warrior",
    "SubTypes": [ "Merfolk", "Warrior" ],
    "Text": "River Sneak can't be blocked.<br/>\nWhenever another Merfolk enters the battlefield under your control, River Sneak gets +1/+1 until end of turn."
  },
  {
    "Rarity": "Rare",
    "Artist": "Raymond Swanland",
    "Flavor": "Carefully following the thaumatic compass Bolas had given her, Vraska blundered straight into the River Heralds' trap.",
    "cmc": 6,
    "MultiverseID": 435223,
    "SetCode": "XLN",
    "Name": "River's Rebuke",
    "Colors": [ "Blue" ],
    "Manacost": "{{4}}{{U}}{{U}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "71",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "There are many important moments in the story, but the most crucial—called \"story spotlights\"—are shown on cards. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."
      }
    ],
    "Text": "Return all nonland permanents target player controls to their owner's hand."
  },
  {
    "Rarity": "Rare",
    "Artist": "Matt Stewart",
    "cmc": 0,
    "MultiverseID": 191057,
    "SetCode": "XLN",
    "Name": "Rootbound Crag",
    "CardNumber": "227",
    "Types": [ "Land" ],
    "Type": "Land",
    "Rulings": [
      {
        "Date": "2009-10-01",
        "Text": "This checks for lands you control with the land type Mountain or Forest, not for lands named Mountain or Forest. The lands it checks for don't have to be basic lands. For example, if you control Temple Garden (a nonbasic land with the land types Forest and Plains), Rootbound Crag will enter the battlefield untapped."
      },
      {
        "Date": "2009-10-01",
        "Text": "As this is entering the battlefield, it checks for lands that are already on the battlefield. It won't see lands that are entering the battlefield at the same time (due to Warp World, for example)."
      }
    ],
    "Text": "Rootbound Crag enters the battlefield tapped unless you control a Mountain or a Forest.<br/>\n{{Tap}}: Add {{R}} or {{G}} to your mana pool."
  },
  {
    "SubTypes": [ "Human", "Pirate" ],
    "Rarity": "Mythic Rare",
    "Artist": "Steve Prescott",
    "Toughness": "3",
    "cmc": 4,
    "MultiverseID": 435313,
    "SetCode": "XLN",
    "Name": "Rowdy Crew",
    "Power": "3",
    "Colors": [ "Red" ],
    "Manacost": "{{2}}{{R}}{{R}}",
    "Types": [ "Creature" ],
    "CardNumber": "159",
    "Type": "Creature — Human Pirate",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once Rowdy Crew's triggered ability begins to resolve, no player may take other actions until it's done. Notably, you can't discard or cast any of the cards you draw to try to rig the results of the random discard."
      },
      {
        "Date": "2017-09-29",
        "Text": "The card types that can appear on the discarded cards are artifact, creature, enchantment, instant, land, planeswalker, sorcery, and tribal (a card type that appears on some older cards). Legendary is a supertype, not a card type."
      },
      {
        "Date": "2017-09-29",
        "Text": "The discarded cards just need to share one card type. For example, Rowdy Crew will get two +1/+1 counters if you discard an artifact creature and an enchantment creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "Rowdy Crew doesn't get more than two +1/+1 counters if the discarded cards happen to share more than one card type."
      }
    ],
    "Text": "Trample<br/>\nWhen Rowdy Crew enters the battlefield, draw three cards, then discard two cards at random. If two cards that share a card type are discarded this way, put two +1/+1 counters on Rowdy Crew."
  },
  {
    "SubTypes": [ "Orc", "Pirate" ],
    "Rarity": "Rare",
    "Artist": "Kieran Yanner",
    "Toughness": "2",
    "cmc": 3,
    "MultiverseID": 435272,
    "SetCode": "XLN",
    "Name": "Ruin Raider",
    "Power": "3",
    "Colors": [ "Black" ],
    "Manacost": "{{2}}{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "118",
    "Type": "Creature — Orc Pirate",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the mana cost of the revealed card includes {X}, X is considered to be 0."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the revealed card doesn't have a mana cost (because it's a land card, for example), its converted mana cost is 0."
      },
      {
        "Date": "2017-09-29",
        "Text": "The converted mana cost of a split card, such as cards with aftermath from the Amonkhet block, is based on the combined mana cost of its two halves."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      },
      {
        "Date": "2017-09-29",
        "Text": "Some raid abilities trigger at the beginning of your end step. These abilities trigger if you attacked with a creature that turn, even if the card with that raid ability wasn't on the battlefield when you attacked."
      }
    ],
    "Text": "Raid — At the beginning of your end step, if you attacked with a creature this turn, reveal the top card of your library and put that card into your hand. You lose life equal to the card's converted mana cost."
  },
  {
    "cmc": 3,
    "MultiverseID": 249705,
    "Colors": [ "Red" ],
    "SubTypes": [ "Goblin", "Rogue" ],
    "Rulings": [
      {
        "Date": "2012-07-01",
        "Text": "Discarding a card is part of the cost to activate Rummaging Goblin's ability. If you don't have a card in your hand, you can't pay this part of the cost and you can't activate the ability."
      }
    ],
    "Text": "{{Tap}}, Discard a card: Draw a card.",
    "Rarity": "Common",
    "Artist": "Karl Kopinski",
    "Flavor": "To a goblin, value is based on the four S's: shiny, stabby, smelly, and super smelly.",
    "SetCode": "XLN",
    "Name": "Rummaging Goblin",
    "Manacost": "{{2}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Goblin Rogue",
    "Power": "1",
    "CardNumber": "146"
  },
  {
    "Rarity": "Common",
    "Artist": "Sara Winters",
    "Flavor": "\"That's the first time I've seen the ground do the running.\"<br/>\n—Captain Brinely Rage",
    "cmc": 4,
    "MultiverseID": 435224,
    "SetCode": "XLN",
    "Name": "Run Aground",
    "Colors": [ "Blue" ],
    "Manacost": "{{3}}{{U}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "72",
    "Text": "Put target artifact or creature on top of its owner's library."
  },
  {
    "cmc": 3,
    "MultiverseID": 435273,
    "Colors": [ "Black" ],
    "SubTypes": [ "Orc", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can sacrifice Ruthless Knave to pay the cost for its first ability."
      },
      {
        "Date": "2017-09-29",
        "Text": "The Treasures you sacrifice to activate Ruthless Knave's last ability can't also be sacrificed for mana."
      }
    ],
    "Text": "{{2}}{{B}}, Sacrifice a creature: Create two colorless Treasure artifact tokens with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\"<br/>\nSacrifice three Treasures: Draw a card.",
    "Rarity": "Uncommon",
    "Artist": "Aaron Miller",
    "Flavor": "\"This scum is barely worth the trouble.\"",
    "SetCode": "XLN",
    "Name": "Ruthless Knave",
    "Manacost": "{{2}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Orc Pirate",
    "Power": "3",
    "CardNumber": "119"
  },
  {
    "Toughness": "4",
    "Rarity": "Common",
    "Artist": "Ryan Pancoast",
    "Flavor": "In the Brazen Coalition, the wheels of business are greased with plunder.",
    "cmc": 3,
    "MultiverseID": 435225,
    "SetCode": "XLN",
    "Name": "Sailor of Means",
    "Power": "1",
    "Colors": [ "Blue" ],
    "Manacost": "{{2}}{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "73",
    "Type": "Creature — Human Pirate",
    "SubTypes": [ "Human", "Pirate" ],
    "Text": "When Sailor of Means enters the battlefield, create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "cmc": 4,
    "MultiverseID": 435274,
    "Colors": [ "Black" ],
    "SubTypes": [ "Vampire", "Knight" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "In a Two-Headed Giant game, Sanctum Seeker's ability causes the opposing team to lose 2 life and you to gain 1 life."
      }
    ],
    "Text": "Whenever a Vampire you control attacks, each opponent loses 1 life and you gain 1 life.",
    "Rarity": "Rare",
    "Artist": "Volkan Baga",
    "Flavor": "The Sanctum Seekers were the first of the knightly orders to cross the sea and are still the most zealous.",
    "SetCode": "XLN",
    "Name": "Sanctum Seeker",
    "Manacost": "{{2}}{{B}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "4",
    "Type": "Creature — Vampire Knight",
    "Power": "3",
    "CardNumber": "120"
  },
  {
    "Rarity": "Rare",
    "Artist": "Bastien L. Deharme",
    "Flavor": "\"As the sun sets to make way for dawn, so we turn to darkness to bring about the coming salvation.\"",
    "cmc": 2,
    "MultiverseID": 435185,
    "SetCode": "XLN",
    "Name": "Sanguine Sacrament",
    "Colors": [ "White" ],
    "Manacost": "{{X}}{{W}}{{W}}",
    "Types": [ "Instant" ],
    "CardNumber": "33",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Sanguine Sacrament causes you to gain an amount of life equal to twice the number chosen for X as a single life-gain event. An ability that triggers \"Whenever you gain life\" will trigger only once."
      }
    ],
    "Text": "You gain twice X life. Put Sanguine Sacrament on the bottom of its owner's library."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Wayne Reynolds",
    "cmc": 3,
    "MultiverseID": 435361,
    "SetCode": "XLN",
    "Name": "Savage Stomp",
    "Colors": [ "Green" ],
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "205",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can't cast Savage Stomp unless you choose both a creature you control and a creature you don't control as targets."
      },
      {
        "Date": "2017-09-29",
        "Text": "If either target is an illegal target as Savage Stomp resolves, neither creature will deal or be dealt damage."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the creature you control is an illegal target as Savage Stomp tries to resolve, you won't put a +1/+1 counter on it. If that creature is a legal target but the other creature isn't, you'll still put the counter on the creature you control."
      }
    ],
    "Text": "Savage Stomp costs {{2}} less to cast if it targets a Dinosaur you control.<br/>\nPut a +1/+1 counter on target creature you control. Then that creature fights target creature you don't control. (Each deals damage equal to its power to the other.)"
  },
  {
    "Names": [ "Search for Azcanta", "Azcanta, the Sunken Ruin" ],
    "SuperTypes": [ "Legendary" ],
    "Artist": "Magali Villeneuve",
    "Flavor": "The Sunken Ruin houses all the learning of a long-forgotten age.",
    "cmc": 2,
    "MultiverseID": 435226,
    "SetCode": "XLN",
    "Name": "Search for Azcanta",
    "Rarity": "Rare",
    "Colors": [ "Blue" ],
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "74a",
    "Type": "Legendary Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If a seventh card is put into your graveyard by something other than resolving Search for Azcanta's triggered ability, you won't transform it yet. You'll have to wait until your next upkeep."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you have seven or more cards in your graveyard, you may transform Search for Azcanta while resolving its triggered ability even if you choose not to put the top card of your library into your graveyard."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you don't put the top card of your library into your graveyard while resolving Search for Azcanta's triggered ability, you'll leave it on top of your library (and probably draw it during your draw step)."
      },
      {
        "Date": "2017-09-29",
        "Text": "For more information on double-faced cards, see the Ixalan mechanics article (http://magic.wizards.com/en/articles/archive/feature/ixalan-mechanics)."
      }
    ],
    "Text": "At the beginning of your upkeep, look at the top card of your library. You may put it into your graveyard. Then if you have seven or more cards in your graveyard, you may transform Search for Azcanta."
  },
  {
    "cmc": 2,
    "MultiverseID": 435275,
    "Colors": [ "Black" ],
    "SubTypes": [ "Human", "Scout" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "When Seekers' Squire enters the battlefield, it explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)",
    "Rarity": "Uncommon",
    "Artist": "Anthony Palumbo",
    "Flavor": "Dusk follows the light.",
    "SetCode": "XLN",
    "Name": "Seekers' Squire",
    "Manacost": "{{1}}{{B}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Human Scout",
    "Power": "1",
    "CardNumber": "121"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Anthony Palumbo",
    "cmc": 1,
    "MultiverseID": 435404,
    "SetCode": "XLN",
    "Name": "Sentinel Totem",
    "Manacost": "{{1}}",
    "Types": [ "Artifact" ],
    "Type": "Artifact",
    "CardNumber": "245",
    "Text": "When Sentinel Totem enters the battlefield, scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)<br/>\n{{Tap}}, Exile Sentinel Totem: Exile all cards from all graveyards."
  },
  {
    "Rarity": "Rare",
    "Artist": "Dimitar",
    "cmc": 4,
    "MultiverseID": 435186,
    "SetCode": "XLN",
    "Name": "Settle the Wreckage",
    "Colors": [ "White" ],
    "Manacost": "{{2}}{{W}}{{W}}",
    "Types": [ "Instant" ],
    "CardNumber": "34",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Settle the Wreckage targets only the player. Creatures with hexproof that player controls will be exiled as this spell resolves."
      },
      {
        "Date": "2017-09-29",
        "Text": "That player can find fewer basic land cards than the number of exiled creatures, whether because he or she wants to or because he or she doesn't have that many basic land cards left."
      },
      {
        "Date": "2017-09-29",
        "Text": "The number of lands that player may find is the number of attacking creatures that were exiled, even if some of those creatures were tokens, weren't creature cards, or didn't end up in exile (most likely because one was that player's commander in the Commander variant)."
      }
    ],
    "Text": "Exile all attacking creatures target player controls. That player may search his or her library for that many basic land cards, put those cards onto the battlefield tapped, then shuffle his or her library."
  },
  {
    "Rarity": "Rare",
    "Artist": "Jason Felix",
    "SubTypes": [ "Vehicle" ],
    "cmc": 2,
    "MultiverseID": 435405,
    "SetCode": "XLN",
    "Name": "Shadowed Caravel",
    "Power": "2",
    "Toughness": "2",
    "Manacost": "{{2}}",
    "Types": [ "Artifact" ],
    "CardNumber": "246",
    "Type": "Artifact — Vehicle",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Noncreature permanents such as Shadowed Caravel can have +1/+1 counters put on them. Those counters remain on it while it's not a creature, and will apply if it becomes a creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. Effects that trigger when a creature you control explores, such as that of Shadowed Caravel, trigger if appropriate."
      },
      {
        "Date": "2017-09-29",
        "Text": "Each Vehicle is printed with a power and toughness, but it's not a creature. If it becomes a creature (most likely through its crew ability), it will have that power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect causes a Vehicle to become an artifact creature with a specified power and toughness, that effect overwrites the Vehicle's printed power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "Vehicle is an artifact type, not a creature type. A Vehicle that's crewed won't normally have any creature type."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once a player announces that he or she is activating a crew ability, no player may take other actions until the ability has been paid for. Notably, players can't try to stop the ability by changing a creature's power or by removing or tapping a creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "Any untapped creature you control can be tapped to pay a crew cost, even one that just came under your control."
      },
      {
        "Date": "2017-09-29",
        "Text": "You may tap more creatures than necessary to activate a crew ability."
      },
      {
        "Date": "2017-09-29",
        "Text": "Creatures that crew a Vehicle aren't attached to it or related in any other way. Effects that affect the Vehicle, such as by destroying it or giving it a +1/+1 counter, don't affect the creatures that crewed it."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once a Vehicle becomes a creature, it behaves exactly like any other artifact creature. It can't attack unless you've controlled it continuously since your turn began, it can block if it's untapped, it can be tapped to pay a Vehicle's crew cost, and so on."
      },
      {
        "Date": "2017-09-29",
        "Text": "You may activate a crew ability of a Vehicle even if it's already an artifact creature. Doing so has no effect on the Vehicle. It doesn't change its power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "For a Vehicle to be able to attack, it must be a creature as the declare attackers step begins, so the latest you can activate its crew ability to attack with it is during the beginning of combat step. For a Vehicle to be able to block, it must be a creature as the declare blockers step begins, so the latest you can activate its crew ability to block with it is during the declare attackers step. In either case, players may take actions after the crew ability resolves but before the Vehicle has been declared as an attacking or blocking creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "When a Vehicle becomes a creature, that doesn't count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won't trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a permanent becomes a copy of a Vehicle, the copy won't be a creature, even if the Vehicle it's copying has become an artifact creature."
      }
    ],
    "Text": "Whenever a creature you control explores, put a +1/+1 counter on Shadowed Caravel.<br/>\nCrew 2 (Tap any number of creatures you control with total power 2 or more: This Vehicle becomes an artifact creature until end of turn.)"
  },
  {
    "Toughness": "1",
    "Rarity": "Common",
    "Artist": "Yongjae Choi",
    "Flavor": "The River Heralds would wreck a thousand ships to keep intruders from finding the golden city.",
    "cmc": 2,
    "MultiverseID": 435228,
    "SetCode": "XLN",
    "Name": "Shaper Apprentice",
    "Power": "2",
    "Colors": [ "Blue" ],
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "75",
    "Type": "Creature — Merfolk Wizard",
    "SubTypes": [ "Merfolk", "Wizard" ],
    "Text": "Shaper Apprentice has flying as long as you control another Merfolk."
  },
  {
    "Toughness": "3",
    "Rarity": "Uncommon",
    "Artist": "Chris Seaman",
    "Flavor": "Shapers adapt nature to fit their needs and then return it to the way it was, leaving no trace of their passing.",
    "cmc": 3,
    "MultiverseID": 435384,
    "SetCode": "XLN",
    "Name": "Shapers of Nature",
    "Power": "3",
    "Colors": [ "Blue", "Green" ],
    "Manacost": "{{1}}{{G}}{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "228",
    "Type": "Creature — Merfolk Shaman",
    "SubTypes": [ "Merfolk", "Shaman" ],
    "Text": "{{3}}{{G}}: Put a +1/+1 counter on target creature.<br/>\n{{2}}{{U}}, Remove a +1/+1 counter from a creature you control: Draw a card."
  },
  {
    "Rarity": "Rare",
    "Artist": "Zezhou Chen",
    "Flavor": "Protection is woven into every vine and branch.",
    "cmc": 1,
    "MultiverseID": 435362,
    "SetCode": "XLN",
    "Name": "Shapers' Sanctuary",
    "Colors": [ "Green" ],
    "Manacost": "{{G}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "206",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The triggered ability of Shapers' Sanctuary resolves before the spell or ability that caused it to trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "Players can cast spells and activate abilities after the triggered ability of Shapers' Sanctuary resolves but before the spell or ability that caused it to trigger does. Notably, the card you draw may be able to counter that spell or ability."
      }
    ],
    "Text": "Whenever a creature you control becomes the target of a spell or ability an opponent controls, you may draw a card."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Gabor Szikszai",
    "Flavor": "Those who wield the power of the sun protect the Empire from darkness.",
    "cmc": 1,
    "MultiverseID": 435187,
    "SetCode": "XLN",
    "Name": "Sheltering Light",
    "Colors": [ "White" ],
    "Manacost": "{{W}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "35",
    "Text": "Target creature gains indestructible until end of turn. Scry 1. (Damage and effects that say \"destroy\" don't destroy the creature.)"
  },
  {
    "Toughness": "4",
    "Rarity": "Common",
    "Artist": "Dan Scott",
    "Flavor": "\"The invaders cloak themselves in the shadows of dusk. Aerosaurs hide in the brilliance of the noonday sun.\"<br/>\n—Caparocti Sunborn",
    "cmc": 5,
    "MultiverseID": 435188,
    "SetCode": "XLN",
    "Name": "Shining Aerosaur",
    "Power": "3",
    "Colors": [ "White" ],
    "Manacost": "{{4}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "36",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Flying"
  },
  {
    "cmc": 2,
    "MultiverseID": 435229,
    "Colors": [ "Blue" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      }
    ],
    "Text": "Raid — When Shipwreck Looter enters the battlefield, if you attacked with a creature this turn, you may draw a card. If you do, discard a card.",
    "Rarity": "Common",
    "Artist": "Wayne Reynolds",
    "Flavor": "One pirate's wreck is another's reward.",
    "SetCode": "XLN",
    "Name": "Shipwreck Looter",
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Human Pirate",
    "Power": "2",
    "CardNumber": "76"
  },
  {
    "Toughness": "3",
    "Rarity": "Common",
    "Artist": "YW Tang",
    "Flavor": "Over their long life spans, the larger trilobites accumulate vast treasure troves in their guts.",
    "cmc": 1,
    "MultiverseID": 435230,
    "SetCode": "XLN",
    "Name": "Shore Keeper",
    "Power": "0",
    "Colors": [ "Blue" ],
    "Manacost": "{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "77",
    "Type": "Creature — Trilobite",
    "SubTypes": [ "Trilobite" ],
    "Text": "{{7}}{{U}}, {{Tap}}, Sacrifice Shore Keeper: Draw three cards."
  },
  {
    "SubTypes": [ "Siren", "Pirate" ],
    "Rarity": "Common",
    "Artist": "Chris Rallis",
    "Toughness": "2",
    "cmc": 3,
    "MultiverseID": 435231,
    "SetCode": "XLN",
    "Name": "Siren Lookout",
    "Power": "1",
    "Colors": [ "Blue" ],
    "Manacost": "{{2}}{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "78",
    "Type": "Creature — Siren Pirate",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "Flying<br/>\nWhen Siren Lookout enters the battlefield, it explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)"
  },
  {
    "cmc": 1,
    "MultiverseID": 435232,
    "Colors": [ "Blue" ],
    "SubTypes": [ "Siren", "Pirate", "Wizard" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Siren Stormtamer's activated ability can target a spell or ability that has multiple targets, as long as at least one of those targets is you or a creature you control."
      }
    ],
    "Text": "Flying<br/>\n{{U}}, Sacrifice Siren Stormtamer: Counter target spell or ability that targets you or a creature you control.",
    "Rarity": "Uncommon",
    "Artist": "Josu Hernaiz",
    "Flavor": "He's the calm that hides the coming storm.",
    "SetCode": "XLN",
    "Name": "Siren Stormtamer",
    "Manacost": "{{U}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Siren Pirate Wizard",
    "Power": "1",
    "CardNumber": "79"
  },
  {
    "Rarity": "Common",
    "Artist": "Ben Maier",
    "Flavor": "Deception and misdirection are the heart of the pirate's arsenal.",
    "cmc": 2,
    "MultiverseID": 435233,
    "SetCode": "XLN",
    "Name": "Siren's Ruse",
    "Colors": [ "Blue" ],
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Instant" ],
    "CardNumber": "80",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once the exiled creature returns, it's considered a new object with no relation to the object that it was. Auras attached to the exiled creature will be put into their owners' graveyards. Equipment attached to the exiled creature will become unattached and remain on the battlefield. Any counters on the exiled creature will cease to exist."
      },
      {
        "Date": "2017-09-29",
        "Text": "The returned creature won't be the target of any spells or abilities that targeted it before. Any spells that don't target it, such as Star of Extinction, will still affect it."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a token is exiled this way, it will cease to exist and won't return to the battlefield."
      },
      {
        "Date": "2017-09-29",
        "Text": "You'll draw a card if the creature was a Pirate as it was exiled, even if it doesn't return to the battlefield (most likely because it's a token) or if it returns to the battlefield but isn't a Pirate anymore (most likely because it's copying something else)."
      }
    ],
    "Text": "Exile target creature you control, then return that card to the battlefield under its owner's control. If a Pirate was exiled this way, draw a card."
  },
  {
    "Toughness": "2",
    "Rarity": "Common",
    "Artist": "Aaron Miller",
    "Flavor": "It flows like water over the forest floor, as deadly as the swiftest current.",
    "cmc": 1,
    "MultiverseID": 435276,
    "SetCode": "XLN",
    "Name": "Skittering Heartstopper",
    "Power": "1",
    "Colors": [ "Black" ],
    "Manacost": "{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "122",
    "Type": "Creature — Insect",
    "SubTypes": [ "Insect" ],
    "Text": "{{B}}: Skittering Heartstopper gains deathtouch until end of turn."
  },
  {
    "Rarity": "Common",
    "Artist": "Deruchenko Alexander",
    "Flavor": "\"They're so much more willing to parley once they're hanging from a boom by the ankle!\"",
    "cmc": 1,
    "MultiverseID": 435277,
    "SetCode": "XLN",
    "Name": "Skulduggery",
    "Colors": [ "Black" ],
    "Manacost": "{{B}}",
    "Types": [ "Instant" ],
    "CardNumber": "123",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can't cast Skulduggery unless you choose both a creature you control and a creature you don't control as targets."
      },
      {
        "Date": "2017-09-29",
        "Text": "If either target becomes illegal after you cast Skulduggery but before it resolves, the other is still affected as appropriate."
      }
    ],
    "Text": "Until end of turn, target creature you control gets +1/+1 and target creature an opponent controls gets -1/-1."
  },
  {
    "Toughness": "2",
    "Rarity": "Uncommon",
    "Artist": "Johann Bodin",
    "Flavor": "\"Wherever the Threefold Sun shines, great wings may go.\"<br/>\n—Emperor Apatzec Intli III",
    "cmc": 2,
    "MultiverseID": 435385,
    "SetCode": "XLN",
    "Name": "Sky Terror",
    "Power": "2",
    "Colors": [ "White", "Red" ],
    "Manacost": "{{R}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "229",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Flying, menace"
  },
  {
    "Toughness": "3",
    "Rarity": "Common",
    "Artist": "Daarken",
    "Flavor": "Vampires call the gift of flight \"exultation.\" For their enemies, it brings only sorrow.",
    "cmc": 2,
    "MultiverseID": 435189,
    "SetCode": "XLN",
    "Name": "Skyblade of the Legion",
    "Power": "1",
    "Colors": [ "White" ],
    "Manacost": "{{1}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "37",
    "Type": "Creature — Vampire Soldier",
    "SubTypes": [ "Vampire", "Soldier" ],
    "Text": "Flying"
  },
  {
    "Toughness": "2",
    "Rarity": "Common",
    "Artist": "Tomasz Jedruszek",
    "Flavor": "From the perpetual shadowsmoke that hung above the ship, a silent form emerged, lips curled with malice and anticipation.",
    "cmc": 3,
    "MultiverseID": 435278,
    "SetCode": "XLN",
    "Name": "Skymarch Bloodletter",
    "Power": "2",
    "Colors": [ "Black" ],
    "Manacost": "{{2}}{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "124",
    "Type": "Creature — Vampire Soldier",
    "SubTypes": [ "Vampire", "Soldier" ],
    "Text": "Flying<br/>\nWhen Skymarch Bloodletter enters the battlefield, target opponent loses 1 life and you gain 1 life."
  },
  {
    "Rarity": "Common",
    "Artist": "Magali Villeneuve",
    "Flavor": "\"The amber sun smokes with fury, gazing on foes that gather like ants invading our home. We are ready! Blade and claw strike as one.\"<br/>\n—Huatli",
    "cmc": 1,
    "MultiverseID": 435190,
    "SetCode": "XLN",
    "Name": "Slash of Talons",
    "Colors": [ "White" ],
    "Manacost": "{{W}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "38",
    "Text": "Slash of Talons deals 2 damage to target attacking or blocking creature."
  },
  {
    "SubTypes": [ "Vehicle" ],
    "Rarity": "Uncommon",
    "Artist": "Mark Winters",
    "Flavor": "The pirates had left the open sea behind, but they were still in their element: reckless adventure.",
    "cmc": 3,
    "MultiverseID": 435406,
    "SetCode": "XLN",
    "Name": "Sleek Schooner",
    "Power": "4",
    "Toughness": "3",
    "Manacost": "{{3}}",
    "Types": [ "Artifact" ],
    "CardNumber": "247",
    "Type": "Artifact — Vehicle",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Each Vehicle is printed with a power and toughness, but it's not a creature. If it becomes a creature (most likely through its crew ability), it will have that power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect causes a Vehicle to become an artifact creature with a specified power and toughness, that effect overwrites the Vehicle's printed power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "Vehicle is an artifact type, not a creature type. A Vehicle that's crewed won't normally have any creature type."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once a player announces that he or she is activating a crew ability, no player may take other actions until the ability has been paid for. Notably, players can't try to stop the ability by changing a creature's power or by removing or tapping a creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "Any untapped creature you control can be tapped to pay a crew cost, even one that just came under your control."
      },
      {
        "Date": "2017-09-29",
        "Text": "You may tap more creatures than necessary to activate a crew ability."
      },
      {
        "Date": "2017-09-29",
        "Text": "Creatures that crew a Vehicle aren't attached to it or related in any other way. Effects that affect the Vehicle, such as by destroying it or giving it a +1/+1 counter, don't affect the creatures that crewed it."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once a Vehicle becomes a creature, it behaves exactly like any other artifact creature. It can't attack unless you've controlled it continuously since your turn began, it can block if it's untapped, it can be tapped to pay a Vehicle's crew cost, and so on."
      },
      {
        "Date": "2017-09-29",
        "Text": "You may activate a crew ability of a Vehicle even if it's already an artifact creature. Doing so has no effect on the Vehicle. It doesn't change its power and toughness."
      },
      {
        "Date": "2017-09-29",
        "Text": "For a Vehicle to be able to attack, it must be a creature as the declare attackers step begins, so the latest you can activate its crew ability to attack with it is during the beginning of combat step. For a Vehicle to be able to block, it must be a creature as the declare blockers step begins, so the latest you can activate its crew ability to block with it is during the declare attackers step. In either case, players may take actions after the crew ability resolves but before the Vehicle has been declared as an attacking or blocking creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "When a Vehicle becomes a creature, that doesn't count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won't trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a permanent becomes a copy of a Vehicle, the copy won't be a creature, even if the Vehicle it's copying has become an artifact creature."
      }
    ],
    "Text": "Crew 1 (Tap any number of creatures you control with total power 1 or more: This Vehicle becomes an artifact creature until end of turn.)"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Efrem Palacios",
    "Flavor": "\"The hypocrisy of these elves is thicker than steel—destroying 'unnatural metal' with their own enchanted swords.\"<br/>\n—Kara Vrist, Neurok agent",
    "cmc": 4,
    "MultiverseID": 208254,
    "SetCode": "XLN",
    "Name": "Slice in Twain",
    "CardNumber": "127",
    "Colors": [ "Green" ],
    "Manacost": "{{2}}{{G}}{{G}}",
    "Types": [ "Instant" ],
    "Watermark": "Mirran",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the target artifact or enchantment is an illegal target by the time Slice in Twain resolves, the entire spell is countered. You won't draw a card. If, on the other hand, the target is a legal target but isn't destroyed (most likely because it has indestructible), you'll draw a card."
      }
    ],
    "Text": "Destroy target artifact or enchantment.<br/>\nDraw a card."
  },
  {
    "cmc": 5,
    "MultiverseID": 435364,
    "Colors": [ "Green" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If multiple sources deal damage to a creature with an enrage ability at the same time, most likely because multiple creatures blocked that creature, the enrage ability triggers only once."
      },
      {
        "Date": "2017-09-29",
        "Text": "If lethal damage is dealt to a creature with an enrage ability, that ability triggers. The creature with that enrage ability leaves the battlefield before that ability resolves, so it won't be affected by the resolving ability."
      }
    ],
    "Text": "Flash<br/>\nEnrage — Whenever Snapping Sailback is dealt damage, put a +1/+1 counter on it. (It must survive the damage to get the counter.)",
    "Rarity": "Uncommon",
    "Artist": "Dan Scott",
    "Flavor": "Lurking beneath the murky waters of Ixalan's rivers, sailbacks can rip a meal off the shore in the blink of an eye.",
    "SetCode": "XLN",
    "Name": "Snapping Sailback",
    "Manacost": "{{4}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "4",
    "Type": "Creature — Dinosaur",
    "Power": "4",
    "CardNumber": "208"
  },
  {
    "Rarity": "Rare",
    "Artist": "Kieran Yanner",
    "cmc": 2,
    "MultiverseID": 435407,
    "SetCode": "XLN",
    "Name": "Sorcerous Spyglass",
    "Manacost": "{{2}}",
    "Types": [ "Artifact" ],
    "CardNumber": "248",
    "Type": "Artifact",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can choose any card name, even if that card doesn't normally have an activated ability. You're not limited to the names of cards you saw in the opponent's hand."
      },
      {
        "Date": "2017-09-29",
        "Text": "You can't choose the name of a token unless that token has the same name as a card."
      },
      {
        "Date": "2017-09-29",
        "Text": "Activated abilities contain a colon. They're generally written \"[Cost]: [Effect].\" Some keyword abilities (such as equip and crew) are activated abilities and will have colons in their reminder text. Triggered abilities (starting with \"when,\" \"whenever,\" or \"at\") are unaffected by the last ability of Sorcerous Spyglass."
      },
      {
        "Date": "2017-09-29",
        "Text": "An activated mana ability is one that produces mana as it resolves, not one that costs mana to activate."
      },
      {
        "Date": "2017-09-29",
        "Text": "Sorcerous Spyglass affects cards regardless of what zone they're in. This includes cards in hand, cards in the graveyard, and exiled cards."
      }
    ],
    "Text": "As Sorcerous Spyglass enters the battlefield, look at an opponent's hand, then choose any card name.<br/>\nActivated abilities of sources with the chosen name can't be activated unless they're mana abilities."
  },
  {
    "Rarity": "Common",
    "Artist": "Deruchenko Alexander",
    "Flavor": "\"A fool's fire is quickly quenched.\"<br/>\n—Shaper Kumena",
    "cmc": 1,
    "MultiverseID": 435234,
    "SetCode": "XLN",
    "Name": "Spell Pierce",
    "Colors": [ "Blue" ],
    "Manacost": "{{U}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "81",
    "Text": "Counter target noncreature spell unless its controller pays {{2}}."
  },
  {
    "Rarity": "Rare",
    "Artist": "Victor Adame Minguez",
    "cmc": 5,
    "MultiverseID": 435235,
    "SetCode": "XLN",
    "Name": "Spell Swindle",
    "Colors": [ "Blue" ],
    "Manacost": "{{3}}{{U}}{{U}}",
    "Types": [ "Instant" ],
    "CardNumber": "82",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "For spells with {X} in their mana costs, use the value chosen for X to determine the spell's converted mana cost."
      },
      {
        "Date": "2017-09-29",
        "Text": "You may target a spell that can't be countered. When Spell Swindle resolves, the target spell will be unaffected, but you'll still get Treasures."
      }
    ],
    "Text": "Counter target spell. Create X colorless Treasure artifact tokens, where X is that spell's converted mana cost. They have \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "Toughness": "4",
    "Rarity": "Common",
    "Artist": "Lius Lasahido",
    "Flavor": "The conquistadors surrounded the dinosaur only to find that it had outflanked them.",
    "cmc": 5,
    "MultiverseID": 435365,
    "SetCode": "XLN",
    "Name": "Spike-Tailed Ceratops",
    "Power": "4",
    "Colors": [ "Green" ],
    "Manacost": "{{4}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "209",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Spike-Tailed Ceratops can block an additional creature each combat."
  },
  {
    "Names": [ "Thaumatic Compass", "Spires of Orazca" ],
    "Rarity": "Rare",
    "Artist": "Yeong-Hao Han",
    "Flavor": "\". . . a cryptic objective.\"<br/>\n—Jace Beleren",
    "cmc": 2,
    "MultiverseID": 435409,
    "SetCode": "XLN",
    "Name": "Spires of Orazca",
    "CardNumber": "249b",
    "Types": [ "Land" ],
    "Type": "Land",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Removing a creature from combat doesn't change the fact that it attacked, even though it's no longer an attacking creature. Notably, raid abilities will still be satisfied if every attacking creature is removed from combat."
      }
    ],
    "Text": "(Transforms from Thaumatic Compass.)<br/>\n{{Tap}}: Add {{C}} to your mana pool.<br/>\n{{Tap}}: Untap target attacking creature an opponent controls and remove it from combat."
  },
  {
    "Names": [ "Vance's Blasting Cannons", "Spitfire Bastion" ],
    "SuperTypes": [ "Legendary" ],
    "Artist": "Jonas De Ro",
    "Flavor": "Now instead of a ship, Ripley Vance commands a fortress.",
    "cmc": 4,
    "MultiverseID": 435328,
    "SetCode": "XLN",
    "Name": "Spitfire Bastion",
    "CardNumber": "173b",
    "Types": [ "Land" ],
    "Type": "Legendary Land",
    "Rarity": "Rare",
    "Text": "(Transforms from Vance's Blasting Cannons.)<br/>\n{{Tap}}: Add {{R}} to your mana pool.<br/>\n{{2}}{{R}}, {{Tap}}: Spitfire Bastion deals 3 damage to target creature or player."
  },
  {
    "Rarity": "Common",
    "Artist": "Yeong-Hao Han",
    "Flavor": "\"What is this foul presence that defies the sun's cleansing rays?\"<br/>\n—Itzama the Crested",
    "cmc": 5,
    "MultiverseID": 435279,
    "SetCode": "XLN",
    "Name": "Spreading Rot",
    "Colors": [ "Black" ],
    "Manacost": "{{4}}{{B}}",
    "Types": [ "Sorcery" ],
    "Type": "Sorcery",
    "CardNumber": "125",
    "Text": "Destroy target land. Its controller loses 2 life."
  },
  {
    "Rarity": "Mythic Rare",
    "Artist": "Chris Rahn",
    "Flavor": "\"The visions haunt me. I see the end of the world, brought on by the search for the Immortal Sun.\"<br/>\n—Shaper Pashona",
    "cmc": 7,
    "MultiverseID": 435315,
    "SetCode": "XLN",
    "Name": "Star of Extinction",
    "Colors": [ "Red" ],
    "Manacost": "{{5}}{{R}}{{R}}",
    "Types": [ "Sorcery" ],
    "Type": "Sorcery",
    "CardNumber": "161",
    "Text": "Destroy target land. Star of Extinction deals 20 damage to each creature and each planeswalker."
  },
  {
    "cmc": 4,
    "MultiverseID": 435191,
    "Colors": [ "White" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Tapping an attacking or blocking creature doesn't remove it from combat. If the target of Steadfast Armasaur's ability survives the damage, Steadfast Armasaur will deal combat damage to and be dealt combat damage by that creature as normal."
      },
      {
        "Date": "2017-09-29",
        "Text": "If Steadfast Armasaur is no longer on the battlefield as its ability resolves, use its toughness as it last existed on the battlefield to determine how damage is dealt."
      }
    ],
    "Text": "Vigilance<br/>\n{{1}}{{W}}, {{Tap}}: Steadfast Armasaur deals damage equal to its toughness to target creature blocking or blocked by it.",
    "Rarity": "Uncommon",
    "Artist": "Greg Opalinski",
    "Flavor": "\"Like the mighty armasaur, we will defend against all who invade our shores.\"<br/>\n—Itzama the Crested",
    "SetCode": "XLN",
    "Name": "Steadfast Armasaur",
    "Manacost": "{{3}}{{W}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Dinosaur",
    "Power": "2",
    "CardNumber": "39"
  },
  {
    "Rarity": "Common",
    "Artist": "Florian de Gesincourt",
    "Flavor": "Entire valleys have been formed by mummies laboring to find veins of lazotep.",
    "cmc": 0,
    "MultiverseID": 429666,
    "SetCode": "XLN",
    "Name": "Stone Quarry",
    "CardNumber": "274",
    "Types": [ "Land" ],
    "Type": "Land",
    "Text": "Stone Quarry enters the battlefield tapped.<br/>\n{{Tap}}: Add {{R}} or {{W}} to your mana pool."
  },
  {
    "cmc": 2,
    "MultiverseID": 435236,
    "Colors": [ "Blue" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      }
    ],
    "Text": "Flying<br/>\nRaid — Storm Fleet Aerialist enters the battlefield with a +1/+1 counter on it if you attacked with a creature this turn.",
    "Rarity": "Uncommon",
    "Artist": "Jesper Ejsing",
    "Flavor": "\"Only one thing beats the freedom of the sea: the freedom of the sky.\"",
    "SetCode": "XLN",
    "Name": "Storm Fleet Aerialist",
    "Manacost": "{{1}}{{U}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Human Pirate",
    "Power": "1",
    "CardNumber": "83"
  },
  {
    "cmc": 5,
    "MultiverseID": 435316,
    "Colors": [ "Red" ],
    "SubTypes": [ "Orc", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      }
    ],
    "Text": "Raid — When Storm Fleet Arsonist enters the battlefield, if you attacked with a creature this turn, target opponent sacrifices a permanent.",
    "Rarity": "Uncommon",
    "Artist": "Jason A. Engle",
    "Flavor": "\"Go ahead, build another. I'll burn that down as well.\"",
    "SetCode": "XLN",
    "Name": "Storm Fleet Arsonist",
    "Manacost": "{{4}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "4",
    "Type": "Creature — Orc Pirate",
    "Power": "4",
    "CardNumber": "162"
  },
  {
    "SubTypes": [ "Human", "Pirate", "Wizard" ],
    "Rarity": "Common",
    "Artist": "Kieran Yanner",
    "Toughness": "2",
    "cmc": 5,
    "MultiverseID": 435317,
    "SetCode": "XLN",
    "Name": "Storm Fleet Pyromancer",
    "Power": "3",
    "Colors": [ "Red" ],
    "Manacost": "{{4}}{{R}}",
    "Types": [ "Creature" ],
    "CardNumber": "163",
    "Type": "Creature — Human Pirate Wizard",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      }
    ],
    "Text": "Raid — When Storm Fleet Pyromancer enters the battlefield, if you attacked with a creature this turn, Storm Fleet Pyromancer deals 2 damage to target creature or player."
  },
  {
    "cmc": 3,
    "MultiverseID": 435237,
    "Colors": [ "Blue" ],
    "SubTypes": [ "Human", "Pirate" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities care only that you attacked with a creature. It doesn't matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."
      },
      {
        "Date": "2017-09-29",
        "Text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn't have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn't have to still be in the game or on the battlefield, respectively."
      }
    ],
    "Text": "Raid — When Storm Fleet Spy enters the battlefield, if you attacked with a creature this turn, draw a card.",
    "Rarity": "Uncommon",
    "Artist": "Scott Murphy",
    "Flavor": "\"They're searching in the same direction we are. And for the same thing, I'll wager.\"",
    "SetCode": "XLN",
    "Name": "Storm Fleet Spy",
    "Manacost": "{{2}}{{U}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Human Pirate",
    "Power": "2",
    "CardNumber": "84"
  },
  {
    "cmc": 4,
    "MultiverseID": 435238,
    "Colors": [ "Blue" ],
    "SubTypes": [ "Merfolk", "Wizard" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Storm Sculptor's last ability doesn't target the creature you'll return to hand. You choose one as the ability resolves. No player may take actions between the time you choose a creature to return and the time you do so."
      },
      {
        "Date": "2017-09-29",
        "Text": "Storm Sculptor's last ability isn't optional. If Storm Sculptor is the only creature you control when the ability resolves, you'll have to return it to its owner's hand."
      }
    ],
    "Text": "Storm Sculptor can't be blocked.<br/>\nWhen Storm Sculptor enters the battlefield, return a creature you control to its owner's hand.",
    "Rarity": "Common",
    "Artist": "Sidharth Chaturvedi",
    "Flavor": "In his hands, the wind can become a weapon or a means of escape.",
    "SetCode": "XLN",
    "Name": "Storm Sculptor",
    "Manacost": "{{3}}{{U}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Merfolk Wizard",
    "Power": "3",
    "CardNumber": "85"
  },
  {
    "Toughness": "4",
    "Rarity": "Rare",
    "Artist": "Joe Slucher",
    "Flavor": "When Huatli chooses a mount, its eyes glow with the flames of the sun.",
    "cmc": 5,
    "MultiverseID": 435449,
    "SetCode": "XLN",
    "Name": "Sun-Blessed Mount",
    "Power": "4",
    "Colors": [ "White", "Red" ],
    "Manacost": "{{3}}{{R}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "288",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "When Sun-Blessed Mount enters the battlefield, you may search your library and/or graveyard for a card named Huatli, Dinosaur Knight, reveal it, then put it into your hand. If you searched your library this way, shuffle it."
  },
  {
    "cmc": 6,
    "MultiverseID": 435318,
    "Colors": [ "Red" ],
    "SubTypes": [ "Dinosaur" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If your life total is brought to 0 or less at the same time that Sun-Crowned Hunters is dealt damage, you lose the game before its enrage ability resolves."
      },
      {
        "Date": "2017-09-29",
        "Text": "If multiple sources deal damage to a creature with an enrage ability at the same time, most likely because multiple creatures blocked that creature, the enrage ability triggers only once."
      },
      {
        "Date": "2017-09-29",
        "Text": "If lethal damage is dealt to a creature with an enrage ability, that ability triggers. The creature with that enrage ability leaves the battlefield before that ability resolves, so it won't be affected by the resolving ability."
      }
    ],
    "Text": "Enrage — Whenever Sun-Crowned Hunters is dealt damage, it deals 3 damage to target opponent.",
    "Rarity": "Common",
    "Artist": "Aaron Miller",
    "Flavor": "One alone is dangerous, and they are never alone.",
    "SetCode": "XLN",
    "Name": "Sun-Crowned Hunters",
    "Manacost": "{{4}}{{R}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "4",
    "Type": "Creature — Dinosaur",
    "Power": "5",
    "CardNumber": "164"
  },
  {
    "Rarity": "Rare",
    "Artist": "Christine Choi",
    "cmc": 6,
    "MultiverseID": 435319,
    "SetCode": "XLN",
    "Name": "Sunbird's Invocation",
    "Colors": [ "Red" ],
    "Manacost": "{{5}}{{R}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "165",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Casting Sunbird's Invocation won't cause its own ability to trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "The ability of Sunbird's Invocation resolves before the spell that caused it to trigger. It will resolve even if that spell is countered. If you cast a spell as part of the resolution of the ability, that spell resolves before the spell that caused the ability to trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "For spells with {X} in their mana costs, use the value chosen for X to determine the spell's converted mana cost."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the spell's converted mana cost is 0, you do nothing as the ability of Sunbird's Invocation resolves."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a revealed card in your library has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you cast one of the revealed cards, you do so as part of the resolution of the triggered ability. You can't wait to cast it later in the turn. Timing permissions based on the card's type are ignored, but other restrictions (such as \"Cast [this card] only during combat\") are not."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you cast a card \"without paying its mana cost,\" you can't pay any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, such as that of Costly Plunder, those must be paid to cast the card."
      },
      {
        "Date": "2017-09-29",
        "Text": "The converted mana cost of a split card, such as cards with aftermath from the Amonkhet block, is based on the combined mana cost of its two halves."
      }
    ],
    "Text": "Whenever you cast a spell from your hand, reveal the top X cards of your library, where X is that spell's converted mana cost. You may cast a card revealed this way with converted mana cost X or less without paying its mana cost. Put the rest on the bottom of your library in a random order."
  },
  {
    "Rarity": "Rare",
    "Artist": "Jason Chan",
    "cmc": 0,
    "MultiverseID": 191100,
    "SetCode": "XLN",
    "Name": "Sunpetal Grove",
    "CardNumber": "228",
    "Types": [ "Land" ],
    "Type": "Land",
    "Rulings": [
      {
        "Date": "2009-10-01",
        "Text": "This checks for lands you control with the land type Forest or Plains, not for lands named Forest or Plains. The lands it checks for don't have to be basic lands. For example, if you control Hallowed Fountain (a nonbasic land with the land types Plains and Island), Sunpetal Grove will enter the battlefield untapped."
      },
      {
        "Date": "2009-10-01",
        "Text": "As this is entering the battlefield, it checks for lands that are already on the battlefield. It won't see lands that are entering the battlefield at the same time (due to Warp World, for example)."
      }
    ],
    "Text": "Sunpetal Grove enters the battlefield tapped unless you control a Forest or a Plains.<br/>\n{{Tap}}: Add {{G}} or {{W}} to your mana pool."
  },
  {
    "SubTypes": [ "Human", "Scout" ],
    "Rarity": "Common",
    "Artist": "Filip Burburan",
    "Toughness": "3",
    "cmc": 5,
    "MultiverseID": 435192,
    "SetCode": "XLN",
    "Name": "Sunrise Seeker",
    "Power": "3",
    "Colors": [ "White" ],
    "Manacost": "{{4}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "40",
    "Type": "Creature — Human Scout",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "Vigilance<br/>\nWhen Sunrise Seeker enters the battlefield, it explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)"
  },
  {
    "Rarity": "Common",
    "Artist": "Jakub Kasper",
    "Flavor": "To survive imminent doom, it sometimes takes a foolhardy soul who acts first and fears later.",
    "cmc": 2,
    "MultiverseID": 402052,
    "SetCode": "XLN",
    "Name": "Sure Strike",
    "Colors": [ "Red" ],
    "Manacost": "{{1}}{{R}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "157",
    "Text": "Target creature gets +3/+0 and gains first strike until end of turn."
  },
  {
    "SuperTypes": [ "Basic" ],
    "Artist": "John Avon",
    "cmc": 0,
    "MultiverseID": 129754,
    "SetCode": "XLN",
    "Name": "Swamp",
    "CardNumber": "372",
    "Types": [ "Land" ],
    "Watermark": "Black",
    "Type": "Basic Land — Swamp",
    "Rarity": "Basic Land",
    "SubTypes": [ "Swamp" ]
  },
  {
    "Rarity": "Common",
    "Artist": "Josu Hernaiz",
    "Flavor": "The pirates of the Brazen Coalition are the descendants of those displaced by the Legion of Dusk, and they are eager for vengeance.",
    "cmc": 2,
    "MultiverseID": 435321,
    "SetCode": "XLN",
    "Name": "Swashbuckling",
    "Colors": [ "Red" ],
    "Manacost": "{{1}}{{R}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "167",
    "Type": "Enchantment — Aura",
    "SubTypes": [ "Aura" ],
    "Text": "Enchant creature<br/>\nEnchanted creature gets +2/+2 and has haste."
  },
  {
    "Rarity": "Rare",
    "Artist": "Eric Deschamps",
    "Flavor": "\"Take my blood if you want. Just don't take my gold!\"",
    "cmc": 3,
    "MultiverseID": 435280,
    "SetCode": "XLN",
    "Name": "Sword-Point Diplomacy",
    "Colors": [ "Black" ],
    "Manacost": "{{2}}{{B}}",
    "Types": [ "Sorcery" ],
    "CardNumber": "126",
    "Type": "Sorcery",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You reveal all three cards before opponents choose whether to pay life for any of them."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a multiplayer game, each opponent in turn order chooses whether to pay life for one card before proceeding to the next card. You choose the order to perform this process for the cards, but opponents may discuss them before making any choices. Opponents will then know choices made by earlier opponents when making their choices."
      }
    ],
    "Text": "Reveal the top three cards of your library. For each of those cards, put that card into your hand unless any opponent pays 3 life. Then exile the rest."
  },
  {
    "cmc": 4,
    "MultiverseID": 435239,
    "Colors": [ "Blue" ],
    "SubTypes": [ "Merfolk", "Wizard" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Tempest Caller's ability targets only the player. Creatures with hexproof that player controls will be tapped as that ability resolves."
      }
    ],
    "Text": "When Tempest Caller enters the battlefield, tap all creatures target opponent controls.",
    "Rarity": "Uncommon",
    "Artist": "Ryan Alexander Lee",
    "Flavor": "\"I am the storm.\"",
    "SetCode": "XLN",
    "Name": "Tempest Caller",
    "Manacost": "{{2}}{{U}}{{U}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Merfolk Wizard",
    "Power": "2",
    "CardNumber": "86"
  },
  {
    "Names": [ "Arguel's Blood Fast", "Temple of Aclazotz" ],
    "SuperTypes": [ "Legendary" ],
    "Artist": "Daarken",
    "Flavor": ". . . to the lost temple of a bat-god of night, eternal enemy to the Threefold Sun.",
    "cmc": 2,
    "MultiverseID": 435244,
    "SetCode": "XLN",
    "Name": "Temple of Aclazotz",
    "CardNumber": "90b",
    "Types": [ "Land" ],
    "Rarity": "Rare",
    "Type": "Legendary Land",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once you've announced the last ability of Temple of Aclazotz, it's too late for anyone to interrupt you by trying to remove the creature you sacrifice."
      },
      {
        "Date": "2017-09-29",
        "Text": "For the last ability of Temple of Aclazotz, use the creature's toughness as it last existed on the battlefield to determine how much life you gain."
      }
    ],
    "Text": "(Transforms from Arguel's Blood Fast.)<br/>\n{{Tap}}: Add {{B}} to your mana pool.<br/>\n{{Tap}}, Sacrifice a creature: You gain life equal to the sacrificed creature's toughness."
  },
  {
    "Toughness": "3",
    "Rarity": "Common",
    "Artist": "Lars Grant-West",
    "Flavor": "From the eyes up, it's solid bone and stubbornness.",
    "cmc": 3,
    "MultiverseID": 435193,
    "SetCode": "XLN",
    "Name": "Territorial Hammerskull",
    "Power": "2",
    "Colors": [ "White" ],
    "Manacost": "{{2}}{{W}}",
    "Types": [ "Creature" ],
    "CardNumber": "41",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Whenever Territorial Hammerskull attacks, tap target creature an opponent controls."
  },
  {
    "Names": [ "Thaumatic Compass", "Spires of Orazca" ],
    "Rarity": "Rare",
    "Artist": "Yeong-Hao Han",
    "Flavor": "\"Clearly, it indicates the aetheric azimuth of . . .\"<br/>\n—Jace Beleren",
    "cmc": 2,
    "MultiverseID": 435408,
    "SetCode": "XLN",
    "Name": "Thaumatic Compass",
    "Manacost": "{{2}}",
    "Types": [ "Artifact" ],
    "CardNumber": "249a",
    "Type": "Artifact",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "For more information on double-faced cards, see the Ixalan mechanics article (http://magic.wizards.com/en/articles/archive/feature/ixalan-mechanics)."
      },
      {
        "Date": "2017-09-29",
        "Text": "There are many important moments in the story, but the most crucial—called \"story spotlights\"—are shown on cards. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."
      }
    ],
    "Text": "{{3}}, {{Tap}}: Search your library for a basic land card, reveal it, put it into your hand, then shuffle your library.<br/>\nAt the beginning of your end step, if you control seven or more lands, transform Thaumatic Compass."
  },
  {
    "Toughness": "3",
    "Rarity": "Common",
    "Artist": "Jonathan Kuo",
    "Flavor": "They glide through the undergrowth, drawn to sounds of disturbance. They attack in unison and all share in the kill. And then they move on.",
    "cmc": 4,
    "MultiverseID": 435322,
    "SetCode": "XLN",
    "Name": "Thrash of Raptors",
    "Power": "3",
    "Colors": [ "Red" ],
    "Manacost": "{{3}}{{R}}",
    "Types": [ "Creature" ],
    "CardNumber": "168",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "As long as you control another Dinosaur, Thrash of Raptors gets +2/+0 and has trample."
  },
  {
    "Toughness": "5",
    "Rarity": "Uncommon",
    "Artist": "Tomasz Jedruszek",
    "Flavor": "\"It appears that nature has risen against us.\"<br/>\n—Captain Brinely Rage",
    "cmc": 7,
    "MultiverseID": 435366,
    "SetCode": "XLN",
    "Name": "Thundering Spineback",
    "Power": "5",
    "Colors": [ "Green" ],
    "Manacost": "{{5}}{{G}}{{G}}",
    "Types": [ "Creature" ],
    "CardNumber": "210",
    "Type": "Creature — Dinosaur",
    "SubTypes": [ "Dinosaur" ],
    "Text": "Other Dinosaurs you control get +1/+1.<br/>\n{{5}}{{G}}: Create a 3/3 green Dinosaur creature token with trample."
  },
  {
    "cmc": 2,
    "MultiverseID": 435323,
    "Colors": [ "Red" ],
    "SubTypes": [ "Human", "Knight" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If you don't control a Dinosaur as Tilonalli's Knight attacks, its ability won't trigger at all. If you don't control a Dinosaur as the ability of Tilonalli's Knight resolves, that ability has no effect."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once the ability of Tilonalli's Knight resolves while you control one or more Dinosaurs, Tilonalli's Knight gets +1/+1 for the rest of the turn even if you no longer control a Dinosaur later in the turn."
      }
    ],
    "Text": "Whenever Tilonalli's Knight attacks, if you control a Dinosaur, Tilonalli's Knight gets +1/+1 until end of turn.",
    "Rarity": "Common",
    "Artist": "Lius Lasahido",
    "Flavor": "The people of the Sun Empire worship the sun in three aspects. Tilonalli is the Burning Sun, associated with ferocity, fire, and passion.",
    "SetCode": "XLN",
    "Name": "Tilonalli's Knight",
    "Manacost": "{{1}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Human Knight",
    "Power": "2",
    "CardNumber": "169"
  },
  {
    "cmc": 3,
    "MultiverseID": 435324,
    "Colors": [ "Red" ],
    "SubTypes": [ "Human", "Shaman" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the target of the ability of Tilonalli's Skinshifter becomes an illegal target, Tilonalli's Skinshifter won't become a copy of anything. It will remain a 0/1 attacking creature."
      },
      {
        "Date": "2017-09-29",
        "Text": "Tilonalli's Skinshifter copies the printed values of the target creature, plus any copy effects that have been applied to it. It won't copy counters on that creature or effects that have changed its power, toughness, types, color, or so on."
      },
      {
        "Date": "2017-09-29",
        "Text": "Notably, Tilonalli's Skinshifter won't copy effects that make a noncreature permanent become a creature. If this causes Tilonalli's Skinshifter to stop being a creature, it's removed from combat."
      },
      {
        "Date": "2017-09-29",
        "Text": "If Tilonalli's Skinshifter copies a creature that's copying something else, it will become whatever the target is copying."
      },
      {
        "Date": "2017-09-29",
        "Text": "If an effect from a resolving spell or ability, such as that of Rallying Roar, begins to apply to Tilonalli's Skinshifter before it becomes a copy of another creature, that effect will continue to apply."
      },
      {
        "Date": "2017-09-29",
        "Text": "Because attackers have already been declared, any abilities Tilonalli's Skinshifter copies that trigger when it or other creatures attack won't trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "Once the ability of Tilonalli's Skinshifter resolves, its new characteristics don't change if the characteristics of the copied creature change or if the copied creature leaves the battlefield."
      },
      {
        "Date": "2017-09-29",
        "Text": "Tilonalli's Skinshifter remains a copy of the creature through the end step. Damage is removed from it at the same time that it stops being a copy."
      }
    ],
    "Text": "Haste<br/>\nWhenever Tilonalli's Skinshifter attacks, it becomes a copy of another target nonlegendary attacking creature until end of turn.",
    "Rarity": "Rare",
    "Artist": "Jason Rainville",
    "Flavor": "\"I am the ferocity of the Burning Sun. I am hide and feather, fang and claw.\"",
    "SetCode": "XLN",
    "Name": "Tilonalli's Skinshifter",
    "Manacost": "{{2}}{{R}}",
    "Types": [ "Creature" ],
    "Toughness": "1",
    "Type": "Creature — Human Shaman",
    "Power": "0",
    "CardNumber": "170"
  },
  {
    "cmc": 3,
    "MultiverseID": 435367,
    "Colors": [ "Green" ],
    "SubTypes": [ "Merfolk", "Scout" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Once an ability that causes a creature to explore begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the exploring creature after you reveal a nonland card but before it receives a counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If no card is revealed, most likely because that player's library is empty, the exploring creature receives a +1/+1 counter."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. If you reveal a nonland card this way, you won't put a +1/+1 counter on anything, but you may put the revealed card into your graveyard. Effects that trigger \"whenever a creature you control explores\" trigger if appropriate."
      }
    ],
    "Text": "When Tishana's Wayfinder enters the battlefield, it explores. (Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back or put it into your graveyard.)",
    "Rarity": "Common",
    "Artist": "Shreya Shetty",
    "Flavor": "\"There is always another way.\"",
    "SetCode": "XLN",
    "Name": "Tishana's Wayfinder",
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Merfolk Scout",
    "Power": "2",
    "CardNumber": "211"
  },
  {
    "cmc": 7,
    "MultiverseID": 435386,
    "Colors": [ "Blue", "Green" ],
    "SubTypes": [ "Merfolk", "Shaman" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The number of creatures you control is counted only as Tishana's last ability resolves. If Tishana is still on the battlefield, it'll count itself."
      },
      {
        "Date": "2017-09-29",
        "Text": "If Tishana enters the battlefield while you have no cards in hand, it will be put into your graveyard for having 0 toughness before its triggered ability resolves."
      },
      {
        "Date": "2017-09-29",
        "Text": "Because damage remains marked on a creature until it's removed as the turn ends, the damage Tishana takes during combat may become lethal if cards leave your hand later in the turn, such as by casting them in your postcombat main phase."
      }
    ],
    "Text": "Tishana, Voice of Thunder's power and toughness are each equal to the number of cards in your hand.<br/>\nYou have no maximum hand size.<br/>\nWhen Tishana enters the battlefield, draw a card for each creature you control.",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Anna Steinbauer",
    "SetCode": "XLN",
    "Name": "Tishana, Voice of Thunder",
    "Toughness": "*",
    "Manacost": "{{5}}{{G}}{{U}}",
    "Types": [ "Creature" ],
    "Power": "*",
    "Type": "Legendary Creature — Merfolk Shaman",
    "CardNumber": "230",
    "Rarity": "Mythic Rare"
  },
  {
    "cmc": 2,
    "MultiverseID": 435194,
    "Colors": [ "White" ],
    "SubTypes": [ "Human", "Soldier" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Triggered abilities use the word \"when,\" \"whenever,\" or \"at.\" They're usually written as \"[Trigger condition], [effect].\""
      },
      {
        "Date": "2017-09-29",
        "Text": "Replacement effects, such as a permanent entering the battlefield tapped or with counters on it, are unaffected. Abilities that apply \"as [this creature] enters the battlefield\" are replacement effects."
      },
      {
        "Date": "2017-09-29",
        "Text": "Tocatli Honor Guard's ability stops a creature's own enters-the-battlefield triggered abilities as well as other triggered abilities that would trigger when a creature enters the battlefield. This includes abilities that would trigger when Tocatli Honor Guard itself enters the battlefield."
      },
      {
        "Date": "2017-09-29",
        "Text": "The trigger event doesn't have to specify \"creatures\" entering the battlefield. For example, Contraband Kingpin has an ability that says \"Whenever an artifact enters the battlefield under your control, scry 1.\" If an artifact creature enters the battlefield under your control, that ability won't trigger. If a noncreature artifact enters the battlefield under your control, the ability will trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "Look at the permanent as it exists on the battlefield, taking into account continuous effects, to determine whether any triggered abilities will trigger. For example, if you control March of the Machines, which says, in part, \"Each noncreature artifact is an artifact creature,\" each artifact will be a creature at the time it enters the battlefield and will not cause triggered abilities to trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "If Tocatli Honor Guard and another creature enter the battlefield at the same time, neither creature entering the battlefield will cause triggered abilities to trigger."
      }
    ],
    "Text": "Creatures entering the battlefield don't cause abilities to trigger.",
    "Rarity": "Rare",
    "Artist": "Sara Winters",
    "Flavor": "The glorious city of Pachatupa is the center of the Sun Empire, and Tocatli, the emperor's palace, is its glowing heart.",
    "SetCode": "XLN",
    "Name": "Tocatli Honor Guard",
    "Manacost": "{{1}}{{W}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Human Soldier",
    "Power": "1",
    "CardNumber": "42"
  },
  {
    "Names": [ "Treasure Map", "Treasure Cove" ],
    "Rarity": "Rare",
    "Artist": "Cliff Childs",
    "Flavor": "Half the treasure is the glory of finding it.",
    "cmc": 2,
    "MultiverseID": 435411,
    "SetCode": "XLN",
    "Name": "Treasure Cove",
    "CardNumber": "250b",
    "Types": [ "Land" ],
    "Type": "Land",
    "Text": "(Transforms from Treasure Map.)<br/>\n{{Tap}}: Add {{C}} to your mana pool.<br/>\n{{Tap}}, Sacrifice a Treasure: Draw a card."
  },
  {
    "Names": [ "Treasure Map", "Treasure Cove" ],
    "Rarity": "Rare",
    "Artist": "Cliff Childs",
    "cmc": 2,
    "MultiverseID": 435410,
    "SetCode": "XLN",
    "Name": "Treasure Map",
    "Manacost": "{{2}}",
    "Types": [ "Artifact" ],
    "CardNumber": "250a",
    "Type": "Artifact",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If a third landmark counter is put on Treasure Map by something other than the resolution of its first ability (as modified by any applicable replacement effects), you won't remove those counters, transform Treasure Map, or get Treasures yet. You'll have to wait until you activate its first ability again."
      },
      {
        "Date": "2017-09-29",
        "Text": "If Treasure Map leaves the battlefield before its ability resolves, you can't put a landmark counter on it. However, if it somehow already had three landmark counters on it before it left the battlefield, you'll get three Treasures."
      },
      {
        "Date": "2017-09-29",
        "Text": "For more information on double-faced cards, see the Ixalan mechanics article (http://magic.wizards.com/en/articles/archive/feature/ixalan-mechanics)."
      }
    ],
    "Text": "{{1}}, {{Tap}}: Scry 1. Put a landmark counter on Treasure Map. Then if there are three or more landmark counters on it, remove those counters, transform Treasure Map, and create three colorless Treasure artifact tokens with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Jonas De Ro",
    "cmc": 4,
    "MultiverseID": 435325,
    "SetCode": "XLN",
    "Name": "Trove of Temptation",
    "Colors": [ "Red" ],
    "Manacost": "{{3}}{{R}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "171",
    "Type": "Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Each opponent only has to attack you or a planeswalker you control with one creature total, not one creature for you and one for each planeswalker you control. Other creatures are free to attack other players or other planeswalkers, or to not attack at all."
      },
      {
        "Date": "2017-09-29",
        "Text": "If a creature isn't able to attack you or a planeswalker you control for any reason (such as being tapped as its controller's declare attackers step begins or being affected by \"summoning sickness\"), that creature doesn't have to attack. If no creatures a player controls are able to attack you or a planeswalker you control, Trove of Temptation's requirement has no effect during that combat. If there's a cost associated with having a creature attack, its controller isn't forced to pay that cost, so it doesn't have to attack in that case either."
      },
      {
        "Date": "2017-09-29",
        "Text": "In a Two-Headed Giant game, each of your two opponents must attack your team or a planeswalker you control with at least one creature if able. Attacking a planeswalker your teammate controls doesn't satisfy Trove of Temptation's requirement. Combat damage from creatures attacking your team may be assigned to your teammate."
      }
    ],
    "Text": "Each opponent must attack you or a planeswalker you control with at least one creature each combat if able.<br/>\nAt the beginning of your end step, create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Dimitar",
    "cmc": 0,
    "MultiverseID": 435419,
    "SetCode": "XLN",
    "Name": "Unclaimed Territory",
    "CardNumber": "258",
    "Types": [ "Land" ],
    "Type": "Land",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "To choose a creature type, you must choose an existing creature type, such as Vampire or Knight. You can't choose multiple creature types, such as \"Vampire Knight.\" Card types such as artifact can't be chosen, nor can subtypes that aren't creature types, such as Jace, Vehicle, or Treasure."
      }
    ],
    "Text": "As Unclaimed Territory enters the battlefield, choose a creature type.<br/>\n{{Tap}}: Add {{C}} to your mana pool.<br/>\n{{Tap}}: Add one mana of any color to your mana pool. Spend this mana only to cast a creature spell of the chosen type."
  },
  {
    "Rarity": "Common",
    "Artist": "Josu Hernaiz",
    "Flavor": "Disputes within the Brazen Coalition can escalate from insult to broadside in the blink of an eye.",
    "cmc": 5,
    "MultiverseID": 435326,
    "SetCode": "XLN",
    "Name": "Unfriendly Fire",
    "Colors": [ "Red" ],
    "Manacost": "{{4}}{{R}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "172",
    "Text": "Unfriendly Fire deals 4 damage to target creature or player."
  },
  {
    "Rarity": "Common",
    "Artist": "Jung Park",
    "Flavor": "Kozilek's presence warped the land, stripping away layer after layer.",
    "cmc": 0,
    "MultiverseID": 407691,
    "SetCode": "XLN",
    "Name": "Unknown Shores",
    "CardNumber": "181",
    "Types": [ "Land" ],
    "Type": "Land",
    "Text": "{{Tap}}: Add {{C}} to your mana pool.<br/>\n{{1}}, {{Tap}}: Add one mana of any color to your mana pool."
  },
  {
    "Rarity": "Common",
    "Artist": "Gabor Szikszai",
    "Flavor": "The Feast of Blood sends new life essence flowing through the vampire who partakes, manifesting as even greater strength and speed.",
    "cmc": 1,
    "MultiverseID": 435195,
    "SetCode": "XLN",
    "Name": "Vampire's Zeal",
    "Colors": [ "White" ],
    "Manacost": "{{W}}",
    "Types": [ "Instant" ],
    "CardNumber": "43",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the creature is a Vampire, it gets +2/+2 and gains first strike. If the creature becomes a Vampire later in the turn, it won't gain first strike."
      }
    ],
    "Text": "Target creature gets +2/+2 until end of turn. If it's a Vampire, it gains first strike until end of turn."
  },
  {
    "Names": [ "Vance's Blasting Cannons", "Spitfire Bastion" ],
    "SuperTypes": [ "Legendary" ],
    "Artist": "Jonas De Ro",
    "Flavor": "With a broadside assault, Captain Vance carved the cliffs to form her new home.",
    "cmc": 4,
    "MultiverseID": 435327,
    "SetCode": "XLN",
    "Name": "Vance's Blasting Cannons",
    "Rarity": "Rare",
    "Colors": [ "Red" ],
    "Manacost": "{{3}}{{R}}",
    "Types": [ "Enchantment" ],
    "CardNumber": "173a",
    "Type": "Legendary Enchantment",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The card exiled by the first ability of Vance's Blasting Cannons is exiled face up."
      },
      {
        "Date": "2017-09-29",
        "Text": "Casting the exiled card follows the normal rules for casting that card. You must pay its costs, and you must follow all applicable timing rules. For example, if you exile a creature card this way, you must wait until your main phase to cast it."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you don't cast the exiled card, it remains in exile."
      },
      {
        "Date": "2017-09-29",
        "Text": "The second ability of Vance's Blasting Cannons resolves before the spell that caused it to trigger. The ability will resolve even if that spell is countered."
      },
      {
        "Date": "2017-09-29",
        "Text": "The second ability of Vance's Blasting Cannons counts all the spells you've cast, including Vance's Blasting Cannons itself if you cast it this turn. The ability won't trigger unless Vance's Blasting Cannons is on the battlefield as you cast your third spell of the turn."
      },
      {
        "Date": "2017-09-29",
        "Text": "For more information on double-faced cards, see the Ixalan mechanics article (http://magic.wizards.com/en/articles/archive/feature/ixalan-mechanics)."
      }
    ],
    "Text": "At the beginning of your upkeep, exile the top card of your library. If it's a nonland card, you may cast that card this turn.<br/>\nWhenever you cast your third spell in a turn, you may transform Vance's Blasting Cannons."
  },
  {
    "Rarity": "Common",
    "Artist": "David Palumbo",
    "Flavor": "The clerics known as condemners punish those who do not recognize the righteous authority of the church.",
    "cmc": 3,
    "MultiverseID": 435281,
    "SetCode": "XLN",
    "Name": "Vanquish the Weak",
    "Colors": [ "Black" ],
    "Manacost": "{{2}}{{B}}",
    "Types": [ "Instant" ],
    "Type": "Instant",
    "CardNumber": "127",
    "Text": "Destroy target creature with power 3 or less."
  },
  {
    "Rarity": "Rare",
    "Artist": "Milivoj Ćeran",
    "cmc": 5,
    "MultiverseID": 435412,
    "SetCode": "XLN",
    "Name": "Vanquisher's Banner",
    "Manacost": "{{5}}",
    "Types": [ "Artifact" ],
    "CardNumber": "251",
    "Type": "Artifact",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The choice of creature type is made as Vanquisher's Banner enters the battlefield. Players can't respond to this choice. The bonus starts applying immediately."
      },
      {
        "Date": "2017-09-29",
        "Text": "The last ability of Vanquisher's Banner resolves before the spell that caused it to trigger. The ability will resolve even if the creature spell is countered."
      },
      {
        "Date": "2017-09-29",
        "Text": "To choose a creature type, you must choose an existing creature type, such as Vampire or Knight. You can't choose multiple creature types, such as \"Vampire Knight.\" Card types such as artifact can't be chosen, nor can subtypes that aren't creature types, such as Jace, Vehicle, or Treasure."
      }
    ],
    "Text": "As Vanquisher's Banner enters the battlefield, choose a creature type.<br/>\nCreatures you control of the chosen type get +1/+1.<br/>\nWhenever you cast a creature spell of the chosen type, draw a card."
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Josu Hernaiz",
    "Flavor": "The dryads of the forest have no stake in Ixalan's conflict, but they hate to see any living being suffer.",
    "cmc": 2,
    "MultiverseID": 435368,
    "SetCode": "XLN",
    "Name": "Verdant Rebirth",
    "Colors": [ "Green" ],
    "Manacost": "{{1}}{{G}}",
    "Types": [ "Instant" ],
    "CardNumber": "212",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the target creature is an illegal target by the time Verdant Rebirth resolves, the entire spell is countered. You won't draw a card."
      }
    ],
    "Text": "Until end of turn, target creature gains \"When this creature dies, return it to its owner's hand.\"<br/>\nDraw a card."
  },
  {
    "cmc": 7,
    "MultiverseID": 435369,
    "Colors": [ "Green" ],
    "SubTypes": [ "Dinosaur", "Avatar" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The entering creature's toughness is determined as the ability of Verdant Sun's Avatar resolves. If that creature has left the battlefield, use its toughness as it last existed on the battlefield. If the creature's toughness was less than 0, your life total won't change."
      }
    ],
    "Text": "Whenever Verdant Sun's Avatar or another creature enters the battlefield under your control, you gain life equal to that creature's toughness.",
    "Rarity": "Rare",
    "Artist": "Izzy",
    "Flavor": "\"Ixalli's fertile rays enliven us all. Each of us is a testament to the sun's strength and love.\"<br/>\n—Chitlati, Lightning Rider",
    "SetCode": "XLN",
    "Name": "Verdant Sun's Avatar",
    "Manacost": "{{5}}{{G}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "5",
    "Type": "Creature — Dinosaur Avatar",
    "Power": "5",
    "CardNumber": "213"
  },
  {
    "Toughness": "2",
    "Rarity": "Uncommon",
    "Artist": "Kieran Yanner",
    "Flavor": "\"He is ambitious. Tireless. And utterly ruthless. Ideal for the frontier.\"<br/>\n—Viceroy Elia Sotonores, report to the queen",
    "cmc": 1,
    "MultiverseID": 435282,
    "SetCode": "XLN",
    "Name": "Vicious Conquistador",
    "Power": "1",
    "Colors": [ "Black" ],
    "Manacost": "{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "128",
    "Type": "Creature — Vampire Soldier",
    "SubTypes": [ "Vampire", "Soldier" ],
    "Text": "Whenever Vicious Conquistador attacks, each opponent loses 1 life."
  },
  {
    "cmc": 3,
    "MultiverseID": 435370,
    "Colors": [ "Green" ],
    "SubTypes": [ "Merfolk", "Shaman" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "You can't target the same Merfolk twice to have it receive two +1/+1 counters."
      },
      {
        "Date": "2017-09-29",
        "Text": "Vineshaper Mystic can be the target of its own ability."
      }
    ],
    "Text": "When Vineshaper Mystic enters the battlefield, put a +1/+1 counter on each of up to two target Merfolk you control.",
    "Rarity": "Uncommon",
    "Artist": "Kieran Yanner",
    "Flavor": "She has never touched a loom, yet the tapestries she weaves are vast and beautiful.",
    "SetCode": "XLN",
    "Name": "Vineshaper Mystic",
    "Manacost": "{{2}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Merfolk Shaman",
    "Power": "1",
    "CardNumber": "214"
  },
  {
    "cmc": 5,
    "MultiverseID": 435387,
    "Colors": [ "White", "Black" ],
    "SubTypes": [ "Vampire", "Knight" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Vona's last ability can be activated during any step or phase of your turn, including the combat phase. It's possible to attack with Vona and then activate its ability before blockers are declared. Doing so won't remove Vona from combat."
      }
    ],
    "Text": "Vigilance, lifelink<br/>\n{{Tap}}, Pay 7 life: Destroy target nonland permanent. Activate this ability only during your turn.",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Volkan Baga",
    "Flavor": "\"For four hundred years, I have led armies of conquest. These lands hold nothing that can stand against me.\"",
    "SetCode": "XLN",
    "Name": "Vona, Butcher of Magan",
    "Toughness": "4",
    "Manacost": "{{3}}{{W}}{{B}}",
    "Types": [ "Creature" ],
    "Power": "4",
    "Type": "Legendary Creature — Vampire Knight",
    "CardNumber": "231",
    "Rarity": "Mythic Rare"
  },
  {
    "Rarity": "Rare",
    "Artist": "Clint Cearley",
    "Flavor": "It wasn't long before the taverns of High and Dry were full of whispers about the new captain who could turn a person to stone with a glance.",
    "cmc": 4,
    "MultiverseID": 435283,
    "SetCode": "XLN",
    "Name": "Vraska's Contempt",
    "Colors": [ "Black" ],
    "Manacost": "{{2}}{{B}}{{B}}",
    "Types": [ "Instant" ],
    "CardNumber": "129",
    "Type": "Instant",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the target creature or planeswalker is an illegal target by the time Vraska's Contempt resolves, the entire spell is countered. You won't gain life."
      },
      {
        "Date": "2017-09-29",
        "Text": "There are many important moments in the story, but the most crucial—called \"story spotlights\"—are shown on cards. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."
      }
    ],
    "Text": "Exile target creature or planeswalker. You gain 2 life."
  },
  {
    "Rarity": "Mythic Rare",
    "SuperTypes": [ "Legendary" ],
    "Artist": "Chris Rahn",
    "Loyalty": 6,
    "cmc": 6,
    "MultiverseID": 435388,
    "SetCode": "XLN",
    "Name": "Vraska, Relic Seeker",
    "CardNumber": "232",
    "Colors": [ "Black", "Green" ],
    "Manacost": "{{4}}{{B}}{{G}}",
    "Types": [ "Planeswalker" ],
    "SubTypes": [ "Vraska" ],
    "Type": "Legendary Planeswalker — Vraska",
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If the target artifact, creature, or enchantment is an illegal target by the time Vraska's second ability resolves, the entire ability is countered. You won't get a Treasure. If, on the other hand, the target is a legal target but isn't destroyed (most likely because it has indestructible), you will get a Treasure."
      },
      {
        "Date": "2017-09-29",
        "Text": "For a player's life total to become 1, what actually happens is that the player loses the appropriate amount of life (or in some rare cases, gains the appropriate amount of life). For example, if the targeted player's life total is 4 when this ability resolves, that player loses 3 life. Other cards that interact with life loss will interact with this effect accordingly."
      }
    ],
    "Text": "+2: Create a 2/2 black Pirate creature token with menace.<br/>\n−3: Destroy target artifact, creature, or enchantment. Create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\"<br/>\n−10: Target player's life total becomes 1."
  },
  {
    "cmc": 8,
    "MultiverseID": 435196,
    "Colors": [ "White" ],
    "SubTypes": [ "Dinosaur", "Avatar" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If you put Wakening Sun's Avatar onto the battlefield from your hand without casting it, its ability won't trigger."
      },
      {
        "Date": "2017-09-29",
        "Text": "If you cast a creature spell that enters the battlefield as a copy of Wakening Sun's Avatar, such as Clone, the enters-the-battlefield ability will trigger."
      }
    ],
    "Text": "When Wakening Sun's Avatar enters the battlefield, if you cast it from your hand, destroy all non-Dinosaur creatures.",
    "Rarity": "Mythic Rare",
    "Artist": "Tyler Jacobson",
    "Flavor": "\"Kinjalli's encompassing rays herald new life in the moment of the sun's dawning.\"<br/>\n—Chitlati, Lightning Rider",
    "SetCode": "XLN",
    "Name": "Wakening Sun's Avatar",
    "Manacost": "{{5}}{{W}}{{W}}{{W}}",
    "Types": [ "Creature" ],
    "Toughness": "7",
    "Type": "Creature — Dinosaur Avatar",
    "Power": "7",
    "CardNumber": "44"
  },
  {
    "cmc": 4,
    "MultiverseID": 435371,
    "Colors": [ "Green" ],
    "SubTypes": [ "Merfolk", "Shaman" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "The land-animation effect lasts indefinitely. It doesn't wear off during the cleanup step or when you lose control of Waker of the Wilds."
      },
      {
        "Date": "2017-09-29",
        "Text": "If the ability targets a land that's already a creature, that land creature's base power and toughness will become 0/0, overwriting its previous base power and toughness. Other effects that modify its power and/or toughness (including any +1/+1 counters that were on it) will continue to apply."
      }
    ],
    "Text": "{{X}}{{G}}{{G}}: Put X +1/+1 counters on target land you control. That land becomes a 0/0 Elemental creature with haste. It's still a land.",
    "Rarity": "Rare",
    "Artist": "Shreya Shetty",
    "Flavor": "\"Our foes are many and mighty, but not as many as the trees or as mighty as the sea.\"",
    "SetCode": "XLN",
    "Name": "Waker of the Wilds",
    "Manacost": "{{2}}{{G}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Merfolk Shaman",
    "Power": "3",
    "CardNumber": "215"
  },
  {
    "Rarity": "Uncommon",
    "Artist": "Kieran Yanner",
    "Flavor": "When Captain Thorn adds a new ship to his fleet, he gives the crew a simple choice: follow me, or fall in the sea.",
    "cmc": 2,
    "MultiverseID": 435284,
    "SetCode": "XLN",
    "Name": "Walk the Plank",
    "Colors": [ "Black" ],
    "Manacost": "{{B}}{{B}}",
    "Types": [ "Sorcery" ],
    "Type": "Sorcery",
    "CardNumber": "130",
    "Text": "Destroy target non-Merfolk creature."
  },
  {
    "Toughness": "3",
    "Rarity": "Uncommon",
    "Artist": "Volkan Baga",
    "Flavor": "\"Trust me. The reward's not worth it.\"",
    "cmc": 2,
    "MultiverseID": 435285,
    "SetCode": "XLN",
    "Name": "Wanted Scoundrels",
    "Power": "4",
    "Colors": [ "Black" ],
    "Manacost": "{{1}}{{B}}",
    "Types": [ "Creature" ],
    "CardNumber": "131",
    "Type": "Creature — Human Pirate",
    "SubTypes": [ "Human", "Pirate" ],
    "Text": "When Wanted Scoundrels dies, target opponent creates two colorless Treasure artifact tokens with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "cmc": 3,
    "MultiverseID": 435240,
    "Colors": [ "Blue" ],
    "SubTypes": [ "Merfolk", "Wizard" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "Watertrap Weaver's ability can target a creature that's already tapped. That creature won't untap during its controller's next untap step."
      }
    ],
    "Text": "When Watertrap Weaver enters the battlefield, tap target creature an opponent controls. That creature doesn't untap during its controller's next untap step.",
    "Rarity": "Common",
    "Artist": "Josu Hernaiz",
    "Flavor": "The river is a powerful friend.",
    "SetCode": "XLN",
    "Name": "Watertrap Weaver",
    "Manacost": "{{2}}{{U}}",
    "Types": [ "Creature" ],
    "Toughness": "2",
    "Type": "Creature — Merfolk Wizard",
    "Power": "2",
    "CardNumber": "87"
  },
  {
    "cmc": 2,
    "MultiverseID": 435372,
    "Colors": [ "Green" ],
    "SubTypes": [ "Elemental" ],
    "Rulings": [
      {
        "Date": "2017-09-29",
        "Text": "If a creature leaves the battlefield before an effect instructs it to explore, it still explores. Effects that trigger when a creature you control explores, such as that of Wildgrowth Walker, trigger if appropriate."
      },
      {
        "Date": "2017-09-29",
        "Text": "If Wildgrowth Walker leaves the battlefield while its triggered ability is on the stack, you won't put a +1/+1 counter on anything but you will gain 3 life."
      }
    ],
    "Text": "Whenever a creature you control explores, put a +1/+1 counter on Wildgrowth Walker and you gain 3 life.",
    "Rarity": "Uncommon",
    "Artist": "Ryan Alexander Lee",
    "Flavor": "\"Hear me, stone, root, branch: be the fist of this land. Turn back those who trample upon your domain.\"<br/>\n—Song of the Shaper",
    "SetCode": "XLN",
    "Name": "Wildgrowth Walker",
    "Manacost": "{{1}}{{G}}",
    "Types": [ "Creature" ],
    "Toughness": "3",
    "Type": "Creature — Elemental",
    "Power": "1",
    "CardNumber": "216"
  },
  {
    "Toughness": "1",
    "Rarity": "Uncommon",
    "Artist": "Steve Prescott",
    "Flavor": "Goblins climb and swing with ease, whether through a pirate ship's rigging or a tree's branches.",
    "cmc": 2,
    "MultiverseID": 435329,
    "SetCode": "XLN",
    "Name": "Wily Goblin",
    "Power": "1",
    "Colors": [ "Red" ],
    "Manacost": "{{R}}{{R}}",
    "Types": [ "Creature" ],
    "CardNumber": "174",
    "Type": "Creature — Goblin Pirate",
    "SubTypes": [ "Goblin", "Pirate" ],
    "Text": "When Wily Goblin enters the battlefield, create a colorless Treasure artifact token with \"{{Tap}}, Sacrifice this artifact: Add one mana of any color to your mana pool.\""
  },
  {
    "Toughness": "3",
    "Rarity": "Common",
    "Artist": "Magali Villeneuve",
    "Flavor": "\"Currents are currents, whether in sea or sky.\"",
    "cmc": 5,
    "MultiverseID": 435241,
    "SetCode": "XLN",
    "Name": "Wind Strider",
    "Power": "3",
    "Colors": [ "Blue" ],
    "Manacost": "{{4}}{{U}}",
    "Types": [ "Creature" ],
    "CardNumber": "88",
    "Type": "Creature — Merfolk Wizard",
    "SubTypes": [ "Merfolk", "Wizard" ],
    "Text": "Flash<br/>\nFlying"
  },
  {
    "Rarity": "Common",
    "Artist": "Efflam Mercier",
    "Flavor": "Waterways carve their routes through the land to reflect the paths the aether streams cut through the clouds.",
    "cmc": 0,
    "MultiverseID": 429679,
    "SetCode": "XLN",
    "Name": "Woodland Stream",
    "CardNumber": "287",
    "Types": [ "Land" ],
    "Type": "Land",
    "Text": "Woodland Stream enters the battlefield tapped.<br/>\n{{Tap}}: Add {{G}} or {{U}} to your mana pool."
  }
]
